[
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-1",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "# Influence of processing parameters on the evolution of melt pool, porosity, and microstructures in Ti-6Al-4V alloy parts fabricated by selective laser melting\nJ. \nJ. \nS. Dilip $^{1,2}$  · Shanshan Zhang $^{1}$  · Chong Teng $^{3}$  · Kai Zeng $^{3}$  · Chris Robinson $^{3}$  · Deepankar Pal $^{3}$  · Brent Stucker $^{3}$\n\nReceived: 13 December 2016 / Accepted: 2 August 2017 / Published online: 9 August 2017 © Springer International Publishing AG 2017\n\nAbstract Selective laser melting involves melting and solidification of metal powder particles in a track- by- track and layer- by- layer method to fabricate 3D parts. The present investigation focuses on understanding the effect of laser power and scan speed on the evolution of melt pool, porosity and multiple thermal cycling effects on the microstructure in parts fabricated using selective laser melting. In this study, Ti- 6Al- 4V pre- alloyed powder was used to produce single- track deposits and bulk parts. Using different combinations of laser power and scan speeds, single- track deposits and bulk parts were produced. The cross- sections of the single- track deposits and bulk samples were prepared for metallographic observations and the melt pool shape and size and porosity were evaluated. When a low energy density was applied the un- melted powder particles produced irregularly shaped porosity, and a high energy density resulted in rounded porosity, which was due to keyhole effects. The samples produced with a proper combination of power and speeds were fully dense. Further, microstructural development under the influence of process condition was highlighted. Overall, the study demonstrates a good correlation between the single- track melt pool geometries, porosity in bulk parts and also demonstrates the microstructural inhomogeneity during deposition.\n\nKeywords Additive manufacturing · Selective laser melting · Ti- 6Al- 4V alloy · Single- track deposits",
    "summary": "Influence of processing parameters on the evolution of melt pool, porosity, and microstructures in Ti-6Al-4V alloy parts fabricated by selective laser melting",
    "size": 1941
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-2",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "Additive manufacturing belongs to the group of manufacturing technologies where 3D parts are fabricated by material addition in a layer- by- layer fashion, usually from a computer- aided design model [1]. Additive manufacturing technologies offer enhanced design capabilities for geometric freedom that allows producing parts which are otherwise not possible to fabricate with traditional manufacturing processes. There are various additive manufacturing processes such as selective laser melting, direct laser deposition, electron beam melting, wire- feed additive manufacturing, shape deposition modeling, ultrasonic consolidation, binder jetting, and friction freeform fabrication for producing metallic components [1- 8]. Titanium alloys are used in several structural applications due to their lower density, high strength to weight ratio, corrosion resistance, and elevated temperature properties [9]. Traditionally, titanium alloys are made by vacuum induction re- melting and carefully controlled thermo- mechanical processing to tune the microstructure that will demonstrate satisfactory mechanical properties. Although manufacturing methods are well established for titanium alloys, the high production cost limits the use of these alloys. Additive manufacturing could provide a means to fabricate parts in titanium alloys at a lower cost. Among the various grades of titanium alloys, Ti- 6Al- 4V ( $\\alpha + \\beta$  alloy) is the most popular and finds its applications in aerospace, automotive, biomedical, defence and industrial sectors [9, 10]. The alloy has good weldability characteristics, making it amenable for SLM.",
    "summary": "1 Introduction - Part 1/4",
    "size": 1634
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-3",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "Of the commercially available additive manufacturing technologies, selective laser melting (SLM) is one of the most popular and successful powder- bed fusion based additive manufacturing processes. In SLM, consolidation of metal powder is achieved by melting and solidifying a small volume of material in a track- by- track and layer- by- layer fashion using a high- intensity laser. In other words, the laser beam scans over a layer of powder in a straight line and melts the powder particles under the beam and creates a small molten pool of metal. As the laser beam traverses, it leaves a thin track of solidified metal behind. On repeating the single track deposit with a well- defined overlap (hatch spacing), a layer of cross- section is produced. Upon repeating this layer- by- layer deposition, an entire part is constructed [1]. A simple schematic of the SLM process showing track- by- track and layer- by- layer deposition is presented in Fig. 1 [11]. SLM is controlled by various processing parameters such as laser power  $(P)$ , scanning speed  $(v)$ , layer thickness  $(t)$  and hatch spacing  $(h)$ . These parameters define energy density of the process as [12]:\n\n$$\nE = \\frac{P}{\\nu\\times h\\times t}. \\tag{1}\n$$\n\nAlthough energy density is a measure of the energy input to the process, there are other factors such as the composition of the metal, atmosphere used, scan pattern, and powder- bed temperature, which also play a significant role [13]. All the parameters mentioned above mutually influence each other, but the degree of effect by each parameter is not well understood. Therefore, studying the basic element of SLM, i.e., the single- track deposits, will provide a deeper understanding of the process and could assist in identifying a process window for optimizing parameters, particularly when dealing with new alloy systems [11].",
    "summary": "1 Introduction - Part 2/4",
    "size": 1861
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-4",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "In recent times, a great deal of work has been carried out on the Ti- 6Al- 4V alloy for optimization of parameters, microstructural characterization, and mechanical property evaluation using SLM [12- 15]. Gong et al. [11] reported a strategic method to arrive at optimum parameters through producing single beads on the base plate and extended their work to characterize a test pad  $(10\\mathrm{mm}\\times 10\\mathrm{mm}\\times 1\\mathrm{mm})$  with multiple layers. Gong et al. described the effect of power and scan speed on the melt- pool geometry, and also showed surface topology of multi- layer pads, which were evaluated for porosity and quality evaluation. However, a detailed study on porosity and microstructures was not reported. Also, in their study, the single- track deposits were made on a base plate made on a Ti plate. Very recently, Yang et al. [16] investigated the role of melt pool on microstructure and mechanical properties of Ti- Al- 4V. The study explores the use of a keyhole mode over a conduction mode for SLM deposits, and it was noticed that the conduction mode provided denser parts with better mechanical properties. In their experiments, the single- track deposits were made on a pure Ti plate. In both the case studies, single- track deposits resulted in a significant amount of dilution with the base plate alloy. It is well known that dilution contributes to a change in the local composition of the melt pool, thus changing the melting temperature of the Ti- 6Al- 4V alloy powder in the local single- track vicinity. In other words, the volume of the melt pool created will be different from the actual volume when the melting temperature is changed. Hence, the estimate of melt pool size will probably be close to the actual one but not a true representation of the melt pool size. Therefore, a study on single tracks made of the same alloy (Ti- 6Al- 4V plate) is necessary to have an accurate measure of melt pool geometry. Thijis et al.",
    "summary": "1 Introduction - Part 3/4",
    "size": 1972
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-5",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": " [15] studied the influence of process parameters on porosity and the development of microstructures. In their study, they varied the energy density of the process (by altering the scan speed and hatch spacing) and presented its effects on porosity. They described the evolution of grain (elongated) structure in the deposits due to epitaxial growth, and the fast cooling in SLM resulting in a fully martensitic phase. The martensite phase formed will experience multiple thermal cycling effects during track- by- track and layer- by- layer material deposition and therefore, finally result in a microstructure containing a hierarchical structure of martensite [17].\n\nThe quality and the properties of parts produced by SLM primarily rely on the nature of single- track deposits, overlap between the layers, and thermal history. It is",
    "summary": "1 Introduction - Part 4/4",
    "size": 834
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-6",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "![](images/195db652df38a2c25c5935a689c5f1d554a8afa5b3595c30231f2efae2b273d6.jpg)  \nFig.1 A schematic the SLM process showing track-by-track and layer-by-layer deposition of material [9]\n\nessential to study and understand the mechanism of formation of single- track deposits based upon processing parameters such as scanning speed, laser power, and powder layer thickness. In the present work, we attempt to produce single- track deposits on Ti- 6Al- 4V alloy plate. The objectives of the present work are (i) to study the influence of process parameters on single- track deposits on the evolution of the melt pool and (ii) to understand the effect of process parameters on porosity and microstructures in bulk parts. We believe that this work will provide further insights into understanding the SLM process and could assist in developing a process window for faster identification of optimum process parameters.",
    "summary": "Single line scan",
    "size": 912
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-7",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "Ti- 6Al- 4V pre- alloyed powder  $(15 - 45\\mu \\mathrm{m})$  supplied by LPW Technology Inc., Pittsburg, PA, USA, was used in the present study. The powder was characterized using SEM for examining the particle size, shape and distribution. An EOS M270 direct metal laser sintering (DMLS) system with Yb- fiber laser (nominal maximum power  $200~\\mathrm{W}$ ) was used to fabricate the single- track deposits and bulk sample parts. Experiments were performed with multiple combinations of laser power and scan speeds to produce single- track deposits and bulk samples (Table 1). A layer thickness of  $30~\\mu \\mathrm{m}$  was maintained for all the test samples.",
    "summary": "2 Experimental work - Part 1/3",
    "size": 661
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-8",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "When a thin wall equivalent to the beam diameter is made, the laser will scan as one single line, and thus make a single line of deposit. It is known that support structures in an EOS system have a minimum smallest dimension of  $100~\\mu \\mathrm{m}$  [18]. Therefore, single- track deposits can be produced utilizing line support structure settings. To achieve a single line deposit, thin wall sections with the dimension of  $0.1\\mathrm{mm}\\times 0.1\\mathrm{mm}\\times 100\\mathrm{mm}$  were made using Materialise Magics software and placed at a height of  $5\\mathrm{mm}$ . Then support structures were generated under these thin wall sections/parts. It is to be noted that these thin walls are sacrificial parts and will be deleted once supports are generated. Then parameters (listed in Table 1) with various laser powers and scan speeds were applied to each of the single line supports. A Ti- 6Al- 4V alloy plate of  $3.3\\mathrm{mm}$  was placed on the build platform, and then a layer of  $30\\mu \\mathrm{m}$  thick powder was spread. A single exposure laser scan was applied to scan one single layer. In this method, single track deposits on a Ti- 6Al- 4V alloy plate (thickness  $3.3\\mathrm{mm}$ ) were made. The single- track deposits were pre- set at  $5\\mathrm{mm}$  distance apart. Single- track deposits of a length of  $100\\mathrm{mm}$  were made on the Ti- 6Al- 4V plate. A photograph of the plate containing the single- track deposits is shown in Fig. 2. The single- track deposits were cut at  $1 / 3$ ,  $1 / 2$  and  $2 / 3$  lengths (sections A, B, and C) for microscopy studies. The top surface of the single line deposit was examined under a scanning electron microscope. Later, bulk samples  $(10\\mathrm{mm}\\times 10\\mathrm{mm}\\times 5\\mathrm{mm})$  were built using the same set of parameters. The bulk samples were sectioned, polished, and etched with Keller's reagent. The bulk samples were characterized using optical microscopy for examining the porosity and microstructures.",
    "summary": "2 Experimental work - Part 2/3",
    "size": 2000
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-9",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": " The amount of porosity in the samples was estimated as per ASTM E- 562.\n\nTable 1 Single-track deposits and bulk samples made with various powers and scan speeds  \n\n<table><tr><td>Laser power (W)</td><td>50, 100, 150, 195</td></tr><tr><td>Scan speed (mm/s)</td><td>500, 750, 1000, 1200</td></tr></table>\n\n![](images/bc4755129a3dcc3b2fc40c34e8a418cb423b8af83078fbae2c5fc207d39808af.jpg)  \nFig. 2 Photograph of the Ti-6Al-4V plate showing single-track deposits (note: single tracks appear as thin vertical lines)",
    "summary": "2 Experimental work - Part 3/3",
    "size": 510
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-10",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "Ti- 6Al- 4V pre- alloyed powder was characterized using SEM. Figure 3a shows morphology and distribution of the powder particles. Particle size and distribution were determined by measuring the diameters of individual particles from several different micrographs. The particles have a particle size distribution between  $15$  and  $45\\mu \\mathrm{m}$ . The powders showed spherical morphology with bi- modal size distribution. Figure 3b shows a SEM micrograph revealing characteristic micro- dendritic features on the surface of powder particles. This phenomenon occurs due to nucleation and growth of dendrites in the powder particle during slow cooling occurring in atomization process [8].\n\n![](images/0caf6ded61408f6d6c3b0310bc1f6d8f13ff4e4f17883f31c4f25709ac56ec60.jpg)  \nFig. 3 a A low magnification SEM micrograph of Ti-6Al-4V powder. b A high magnification SEM micrograph of powder particles\n\n![](images/387aa2ecb8144033e251c67a723730b564fc38c08df88d6f74d669d8435428f5.jpg)  \nFig. 4 SEM images showing the top surface morphology of the single-track deposits",
    "summary": "3 Results and discussion - Part 1/12",
    "size": 1065
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-11",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "The top surface of the single line deposits was observed under SEM, and the results are presented in Fig. 4. The single- track deposit scanned with low laser power, and slow scan speed (50 W and  $500~\\mathrm{mm / s}$ ) shows a continuous, and a uniform weld bead. Keeping the laser power constant (50 W), with an increase in the scan speed the single- track deposit was noticed to become inconsistent and discontinuous (1000 mm/s), and eventually resulting in fragmentation of tracks (1200 mm/s), commonly referred to as balling [11]. Balling appears spherical in shape (as shown in Fig. 5, 50 W, 1200 mm/s) and bulging upwards which is a result of the dominant surface tension forces of the molten alloy. When such a sets of parameters are applied to fabricate the bulk parts, they may result in a significant amount of porosity [9, 11]. Keeping scan speed constant, and with an increase in the laser power, the single bead deposit shows an increase in width. This increase in the width is due to the higher intensity of the laser beam, which causes a higher volume of melting and results in a wider and deeper melt pool [11] (Fig. 6). In the case of single tracks deposited with a laser power of 100, 150, and 195 W, the bead width was observed to decrease with an increase in scan speed; however, balling phenomenon was not observed at these higher laser power settings.\n\nThe single- track deposits produced on a Ti- 6Al- 4V alloy plate were sectioned and prepared for microstructural\n\n![](images/9e2d4be8dcd27ef09e13cbae0859e5d638aa1adc2e9538e5b160a4359e873cdf.jpg)  \nFig. 5 Cross-section optical micrographs of the single-track deposits produced on a Ti-6Al-4V alloy plate using various parameter combinations\n\n![](images/9938f753186db0ec6e5b9cab603043c8d6846ff0e7e396727181a5ddc181f7c9.jpg)  \nFig. 6 Variation of melt pool geometry on process parameters a bead width, b depth of penetration and c depth-to-width ratio",
    "summary": "3 Results and discussion - Part 2/12",
    "size": 1924
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-12",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "observations. The etched cross- sections were examined under an optical microscope, and the micrographs are presented in Fig. 5. The morphology, width, and depth of the single- track deposits can be clearly observed from the optical micrographs. At a power level of  $50~\\mathrm{W}$  and scan speed of  $500~\\mathrm{mm / s}$ , the energy was sufficient to melt the powder and a small portion of the base plate  $(10~\\mu \\mathrm{m})$ . When the scan speed was increased, the depth of the melted region was observed to decrease and eventually resulted in balling, which can be observed for the single track made with  $50~\\mathrm{W}$ ,  $1200~\\mathrm{mm / s}$ . This phenomenon occurs due to the reduction in the energy density as the scan speed was increased according to Eq. 1 [10]. The melt pool depth was observed to increase significantly at lower scan speeds  $(500~\\mathrm{mm / s})$  and higher power levels particularly from  $100~\\mathrm{W}$  (depth:  $45~\\mu \\mathrm{m}$ ) to  $195~\\mathrm{W}$  (depth:  $176~\\mu \\mathrm{m}$ ). The melt pool geometry was observed to have a keyhole shape for the laser power of  $195~\\mathrm{W}$ , whereas for  $100~\\mathrm{W}$  it was bowl shape. This remarkable change in melt pool shape with laser irradiation can be attributed to keyhole versus conduction modes of melting. For lower laser power, melting occurs by locally melting the alloy with heat transfer by conduction and convection inside the melt pool. In the later case, with a laser power of  $195~\\mathrm{W}$ , melting of the alloy occurs by keyhole mode, giving rise to deeper penetration. Keyhole is always associated with vaporization of the alloy and in many cases results in entrapped pores in the melt pool [16].",
    "summary": "3 Results and discussion - Part 3/12",
    "size": 1724
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-13",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": " The single tracks with the parameter combinations of:  $100~\\mathrm{W}$ – $500~\\mathrm{mm / s}$ ,  $150~\\mathrm{W}$ – $500~\\mathrm{mm / s}$ ,  $150~\\mathrm{W}$ – $1000~\\mathrm{mm / s}$ ,  $195~\\mathrm{W}$ – $1000~\\mathrm{mm / s}$ , and  $195~\\mathrm{W}$ – $1200~\\mathrm{mm / s}$ , have moderate energy input and provide consistent melt pool shape with sufficient depth of penetration (two to three layers deep). These parameters above when used with a well- defined melt pool overlap could provide a window of optimum processing conditions to produce fully dense parts. It is worth noting that the heat affected zone size close to the melt pool also varies with the energy density applied.\n\nThe overall effect of process parameters on the width and depth of the single- track deposits is presented in Fig. 6. Laser power and scan speed have a significant effect on the single- track melt pool geometry. The results in Fig. 6a indicate for all power levels, an increase in scan speed shows a decrease in bead width. An increase in laser power results in an increase in the width, due to the increase in the energy density. The effect of process parameters on the depth of penetration can be observed from Fig. 6b. The results indicate that both laser power and scan speed significantly affect the amount of melting and the depth penetration. When the energy density is high (high power low speed), the result shows a higher depth of penetration and melting up to  $175~\\mu \\mathrm{m}$  (equivalent to six layers melted\n\nThe effect of process parameters on the depth- to- width ratio is presented in Fig. 6c. For depth- to- width ratios around 0.37 to 0.6, it has at least 2- 3 layers melted below and can ensure proper welding with the substrate. SLM can be considered very similar to laser welding, with high power levels and slow scan speeds, and a conduction mode similar to welding/deposition occurs, resulting in a deeper melt pool [11, 16, 19, 20].",
    "summary": "3 Results and discussion - Part 4/12",
    "size": 1954
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-14",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "Bulk sample parts of dimensions  $10\\mathrm{mm}\\times$ $10\\mathrm{mm}\\times 5\\mathrm{mm}$  were fabricated using the parameters listed in Table 1. The SLM- built sample parts were cut and prepared for microstructural studies. The polished and etched cross- section surfaces of the as- built bulk samples are presented in Fig. 7. The effect of process parameters on the porosity/density of the sample can be clearly observed in Fig. 7. The samples made with parameters  $50~\\mathrm{W}$  laser power and different scan speeds reveal irregular shape pores (dark) with sharp edges and also some unmelted powder particles in the micrographs. The porosity was observed to increase as the scan speed was increased. These results have a good match with the single- track melt pool observations. The sample with  $100\\mathrm{W}$  laser power and  $500~\\mathrm{mm / s}$  scan speed resulted in full density, and as the scan speed was increased the porosity in the parts showed a rise due to insufficient melting of the powder. With the higher laser power levels, 150 and  $195\\mathrm{W}$ , a scan speed of  $500~\\mathrm{mm / s}$  showed round voids. The sample with  $195\\mathrm{W}$  laser power showed larger pore sizes in the cross- section. The formation of porosity in the deposits could be derived from the keyhole- shaped melt pool that developed while high power parameters were used. High energy density causes the alloy to melt and vaporize in some local regions; since the process is dynamic and quick, the vapors cannot escape fully and become entrapped in the melt pool, resulting in pores (which appear round) in the deposit [16, 19- 22]. However, the pores when formed towards the top of the melt pool are not detrimental because re- melting causes gas to escape out of that layer during subsequent",
    "summary": "3 Results and discussion - Part 5/12",
    "size": 1802
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-15",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "![](images/a35bfb5a8ff933be38e5b2629cd4ede43f9e9b95cda5a6c67c4dc261241f98f6.jpg)  \nFig. 7 Cross-section optical micrographs of the bulk samples showing variation in porosity based upon process parameters\n\nTable 2 Calculated energy densities  $(\\mathrm{J} / \\mathrm{mm}^3)$  for various parameters applied for producing bulk samples  \n\n<table><tr><td rowspan=\"2\">Laser power (W)</td><td colspan=\"4\">Scan speed (mm/s)</td></tr><tr><td>500</td><td>750</td><td>1000</td><td>1200</td></tr><tr><td>50</td><td>33</td><td>22</td><td>16</td><td>13</td></tr><tr><td>100</td><td>66</td><td>44</td><td>33</td><td>27</td></tr><tr><td>150</td><td>100</td><td>66</td><td>50</td><td>41</td></tr><tr><td>195</td><td>130</td><td>86</td><td>65</td><td>54</td></tr></table>\n\nlayer deposition. The pores formed deep inside, and in the lower end of the melt pool, are more detrimental [9, 11, 15, 19, 22]. Therefore, higher power and lower speed should be avoided for overcoming such adverse defects. The samples made with parameters: (i) 150 W and scan speeds 750 and  $1000~\\mathrm{mm / s}$  and (ii) 195 W and scan speeds 1000 and  $1200~\\mathrm{mm / s}$  were fully dense.",
    "summary": "3 Results and discussion - Part 6/12",
    "size": 1154
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-16",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "The energy density gives an estimate of the energy input to the SLM process. Energy density estimation applied in SLM is calculated by using Eq. 1 and the values are presented in Table 2. The effect of energy density on the porosity of the samples produced by SLM of Ti- 6Al- 4V is shown in Fig. 8. The energy densities applied below  $50~\\mathrm{J / }$ $\\mathrm{mm}^3$  show a significant amount of porosity due to insufficient melting of the powder particles, which could be conceived from the shape of the porosity and presence of sintered un- melted powder particles. The energy densities applied higher than  $66~\\mathrm{J / mm}^3$  also show some amount of porosity due to higher energy resulting in keyhole effects confirmed by the rounded shape of pores [9, 11, 19, 20, 22]. The red dotted region in the Fig. 8 with the energy density values between 50 and  $66~\\mathrm{J / mm}^3$  produced samples near to full density.\n\n![](images/a2b8985daf788b6189b5143ef022e64ae4b367a9128cdaaba741629b881204a8.jpg)  \nFig. 8 Plot showing variation of porosity with respect to energy density",
    "summary": "3 Results and discussion - Part 7/12",
    "size": 1085
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-17",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "As described earlier, in SLM material addition takes place due to layer- by- layer melting and solidification of a thin layer of spread powder. In this process, the laser beam also re- melts some portion of the layers beneath to ensure good bonding between the layers. The solidification of the alloy begins with the formation of a  $\\beta$  nucleus, and the preexisting  $\\beta$  grains partially undergo melting and serve as heterogeneous sites for nucleation. Thus, newly formed  $\\beta$  will grow epitaxially in the build direction or opposite to the heat extraction [15, 23]. In close similarity to the weld solidification, the solidifying  $\\beta$  grains tend to orient towards the moving heat source (laser beam), resulting in a slightly tilted grain structure. Further, the  $\\beta$  grain orientation in the deposit highly depends on the laser power, scanning strategy and scan speed applied. They define the amount of time available for the melt to solidify at any particular instance of time [24]. The solidified high- temperature  $\\beta$  (bcc) phase is unstable at lower temperatures and will transform (below  $M_{\\mathrm{s}}$ ) to a metastable phase, martensitic  $\\alpha '$  (hcp) phase by a shear- diffusion less reaction since the cooling rates in SLM are high  $(10^{8} - 10^{5}~\\mathrm{K / s})$  [17]. Hence, the final resultant microstructure will have coarse columnar grains, which are highly oriented towards the build direction with martensite  $\\alpha '$  inside the grains [10, 17, 25]. Due to the inherent layer- by- layer deposition method, as a new layer is being deposited a narrow region (heat affected zone) close to the melt pool boundary will reach temperatures above the transformation temperature  $(990^{\\circ}\\mathrm{C})$ , and martensite  $(\\alpha ')$  transforms back to the high- temperature  $\\beta$  phase [12, 17, 25].",
    "summary": "3 Results and discussion - Part 8/12",
    "size": 1865
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-18",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": " As the laser beam traverses away, the high- temperature  $\\beta$  phase, under faster cooling conditions will transform to martensite  $(\\alpha ')$ . The martensite formed from re- heating of primary martensite  $(\\alpha ')$  to  $\\beta$  phase and transformed back to martensite will be from here on referred to as  $\\alpha '_{\\mathrm{(secondary)}}$  and the heat affected regions (areas colored in blue Fig. 10) result in  $\\alpha '_{\\mathrm{(tertiary)}}$ . In other words, as the build progresses, the layers will experience multiple thermal cycling effects which lead to the formation of alternate areas of martensite  $\\alpha '_{\\mathrm{(primary)}}$ ,  $\\alpha '_{\\mathrm{(secondary)}}$  and  $\\alpha '_{\\mathrm{(tertiary)}}$  in the entire part [17]. A schematic presented in Fig. 9 illustrates the evolution of microstructure in the selective laser melted Ti- 6Al- 4V alloy.\n\n![](images/670459e38fc2eac6b90007369e1229428129a17c8edd25d9cfc9e2e2601ab4c9.jpg)  \nFig. 9 A schematic illustration of microstructural evolution in a single-track, multi-layer, and multi-track, multi-layer Ti-6Al-4V SLM deposit\n\nmicrostructures it is important to understand the microstructural evolution of the alloy during the SLM process. In summary, the part will have preferentially- oriented epitaxial grains with high aspect ratio, with martensite.",
    "summary": "3 Results and discussion - Part 9/12",
    "size": 1338
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-19",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "A thermal simulation was also carried out for the parameter  $195\\mathrm{W}$  and  $1200~\\mathrm{mm / s}$  to estimate the temperature distribution from the melt pool boundary into the deposit. The temperature distribution plot defines the peak temperatures experienced by the regions while a track of material is being deposited. Therefore, the regions exposed to a temperature above the  $\\beta$  transus  $(990^{\\circ}\\mathrm{C})$  represent the extent of heat affected zone converting to  $\\beta$  .The theoretically calculated temperature profiles through simulations closely matched the experimentally observed values  $(20-$ $25\\mu \\mathrm{m})$  . To obtain the temperature distribution within the heat affected zone, the equation of heat transfer has been used as shown below [26, 27].\n\n![](images/33d7470fe3e3b7717009f315dc12b439ba5378a93442ddf9921e92ca50d36116.jpg)  \nFig. 10 Plot from simulated thermal cycle of the melt pool boundary during deposition of a single track of Ti-6Al-4V alloy in SLM\n\n$$\n\\rho C_{\\mathrm{v}}\\frac{\\partial T}{\\partial t} = K\\left(\\frac{\\partial T}{\\partial x} +\\frac{\\partial T}{\\partial y} +\\frac{\\partial T}{\\partial z}\\right) + Q\n$$\n\nwhere  $\\rho$  is the density,  $C_\\mathrm{v}$  is heat capacity,  $K$  is the heat conductivity,  $T$  is the temperature, and  $\\mathcal{Q}$  is the internal heat generation per unit volume which can be calculated by:\n\n$$\nQ = \\int \\limits_{\\nu}q\\mathrm{d}\\nu .\n$$\n\nThe heat flux  $q$  can be approximated by a Gaussian function of laser energy:\n\n$$\nq(x,y) = \\frac{2AP}{\\pi\\omega^2} e^{-\\frac{2(\\omega_x^2 + \\omega_y^2)}{\\omega^2}}\n$$",
    "summary": "3 Results and discussion - Part 10/12",
    "size": 1612
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-20",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "where  $A$  is the absorptivity of laser energy,  $P$  is the laser power,  $\\omega$  is the radius of the laser beam, and  $\\omega_{x}$  and  $\\omega_{y}$  are the distance between a point and the center of the laser beam in  $x$  and  $y$  directions. The temperature  $T$  is solved along each time step of the single bead scan with the consideration of nonlinear temperature dependent Ti- 6Al- 4V thermo- physical properties. The solidus temperature of the alloy Ti- 6Al- 4V corresponding to the melt pool boundary is taken as  $1873\\mathrm{K}$ $(1600^{\\circ}\\mathrm{C})$  [12, 27]. The melt\n\n![](images/6ce451d4a5f49118eaafceee290a5b4e2a0784ff725c20c12aefe4cfad93b9bf.jpg)  \nFig. 11 Typical optical micrographs of a vertical cross-section of the near full dense samples a  $100\\mathrm{W}$ ,  $500~\\mathrm{mm / s}$ , b  $150\\mathrm{W}$ ,  $750~\\mathrm{mm / s}$ , c  $150\\mathrm{W}$ ,  $1000~\\mathrm{mm / s}$ , d  $195\\mathrm{W}$ ,  $1000~\\mathrm{mm / s}$  and e  $195\\mathrm{W}$ ,  $1200~\\mathrm{mm / s}$\n\npool shape is obtained by tracking the material state using 3DSIM FLEX simulation software which solves the thermal diffusion problem for a moving laser source step by step. The temperature is recorded and outputted from the center of a melt pool towards the transverse direction with respect to the laser scanning direction. The temperature distribution away from the melt pool is plotted as a function of distance from the melt pool, the plotted region is indicated in Fig. 11.",
    "summary": "3 Results and discussion - Part 11/12",
    "size": 1489
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-21",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "The optical micrographs of the samples close to full density are presented in Fig. 11. The microstructural features show coarse columnar grains with martensite  $\\alpha^{\\prime}$ . The prior  $\\beta$  grains have their lengths running several millimeters, and the width of the grains was in the range of  $80-$ $200~\\mu \\mathrm{m}$ . The cross- section micrograph of the sample built using  $100\\mathrm{W}$ ,  $500~\\mathrm{mm / s}$  showed minor amounts of rounded porosity  $(0.4\\%)$ . The samples built using  $150$  and  $195\\mathrm{W}$  produced fully dense parts. The width of the grains was observed to be wider in the case of slower scan speeds, i.e., the samples at the same  $150\\mathrm{W}$  laser power with  $750~\\mathrm{mm / s}$  showed higher grain width when compared to  $1000~\\mathrm{mm / s}$  ones. A similar trend was observed for the samples built using  $195\\mathrm{W}$  with the scan speeds of  $1000$  and  $1200~\\mathrm{mm / s}$ .",
    "summary": "3 Results and discussion - Part 12/12",
    "size": 953
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-22",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "# 4 Summary\nThe present work focuses on the evolution of single- track melt pools and porosity in parts made using SLM of alloy Ti- Al6- 4V. The single- track deposits were made using\n\nvarying laser power and scan speeds, and their effects on the melt pool morphology were studied. Microstructural studies on the melt pool cross- section show that at a low power level and high scan speed the width of the track reduces, gradually becomes discontinuous, and eventually results in balling. The depth of penetration of the melt pool was observed to increase with the lower scan speed. At higher power levels, in some cases a keyhole effect was observed.\n\nThe bulk parts produced using parameters similar to single- track deposits showed a direct correlation to the energy density applied and the porosity evolution in the process. Characterization of the cross- sections of the bulk parts demonstrates a good correlation between the single- track melt pool geometry and porosity in the bulk parts. It was learned from this investigation that the process parameters with low energy density and high energy density both result in porosity in the parts, however, due to different reasons. The melt pool information of single- track deposits could be an aid to select a process window determining an optimum set of process parameters. SLM processing parameters with 150 W,  $750~\\mathrm{mm / s}$  and  $195\\mathrm{W}$ ,  $1000~\\mathrm{mm / s}$  and  $1200~\\mathrm{mm / s}$  result in well- defined bowl- shaped melt pools and contribute to near fully dense parts. Therefore, these sets of parameters could be recommended to produce denser parts in the Ti- 6Al- 4V alloy using selective laser melting.",
    "summary": "4 Summary",
    "size": 1694
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-23",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "1. Gibson I, Rosen D, Stucker B (2010) Additive manufacturing technologies: rapid prototyping to direct digital manufacturing. Springer \n2. Rafi HK, Karthik NV, Gong H, Starr TL, Stucker BE (2013) Microstructures and mechanical properties of Ti6Al4V parts fabricated by selective laser melting and electron beam melting. J Mater Eng Perform 22(12):3872-3883 \n3. Thompson SM, Bian L, Shamsaei N, Yadollahi A (2015) An overview of direct laser deposition for additive manufacturing; part i: transport phenomena, modeling and diagnostics. Addit Manuf 8:36-62 \n4. Baufeld B, Van der Biest O, Dillien S (2010) Texture and crystal orientation in Ti-6Al-4V builds fabricated by shaped metal deposition. Metall Mater Trans A 41(8):1917-1927 \n5. Wang F, Williams S, Colegrove P, Antonyssamy AA (2013) Microstructure and mechanical properties of wire and arc additive manufactured Ti-6Al-4V. Metall Mater Trans A 44(2):968-977 \n6. Dilip JJS, Miyanaji H, Lassell A, Starr TL, Stucker B (2017) A novel method to fabricate TiAl intermetallic alloy 3D parts using additive manufacturing. Def Technol 13(2):72-76 \n7. Dilip JJS, Janaki Ram GD (2014) Friction freeform fabrication of superalloy Inconel 718: prospects and problems. Metall Mater Trans A 45(1):182-192",
    "summary": "References - Part 1/3",
    "size": 1249
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-24",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": "8. Elahinia M et al (2016) Fabrication of NiTi through additive manufacturing: a review. Prog Mater Sci 83:630-663 \n9. Collings EW (1984) The physical metallurgy of titanium alloys. American Society for Metals, Technology & Engineering, Ohio \n10. Al-Bermani SS, Blackmore ML, Zhang W, Todd I (2010) The origin of microstructural diversity, texture, and mechanical properties in electron beam melted Ti-6Al-4V. Metall Mater Trans A 41(13):3422-3434 \n11. Anam M, Dilip JJS, Pal D, Stucker B (2016) A short study on the fabrication of single track deposits in SLM and characterization. In: 27th Solid freeform fabrication symposium, Austin, Texas \n12. Gong H, Rafi K, Gu H, Starr T, Stucker B (2014) Analysis of defect generation in Ti-6Al-4V parts made using powder bed fusion additive manufacturing processes. Addit Manuf 1-4:87-98 \n13. Gong H, Zeng K, Dilip JJS, Pal D, Stucker B (2014) Melt pool characterization for selective laser melting of Ti-6Al-4V pre-alloyed powder. In: Solid freeform fabrication symposium, University of Texas, Austin, pp 256-267 \n14. Xu W, Sun S, Elambasseril J, Liu Q, Brandt M, Qian M (2015) Ti-6Al-4V additively manufactured by selective laser melting with superior mechanical properties. JOM 67(3):668-673 \n15. Thijs L, Verhaeghe F, Craeghs T, Humbeeck JV, Kruth J-P (2010) A study of the microstructural evolution during selective laser melting of Ti-6Al-4V. Acta Mater 58(9):3303-3312 \n16. Yang J, Han J, Yu H, Yin J, Gao M, Wang Z, Zeng X (2016) Role of molten pool mode on formability, microstructure and mechanical properties of selective laser melted Ti-6Al-4V alloy. Mater Des 110:558-570 \n17. Yang J, Yu H, Yin J, Gao M, Wang Z, Zeng X (2016) Formation and control of martensite in Ti-6Al-4V alloy produced by selective laser melting. Mater Des 108:308-318 \n18. Yang L, Gong H, Dilip JJS, Stucker B (2014) Solid freeform fabrication symposium, University of Texas, Austin, pp 714-731 \n19.",
    "summary": "References - Part 2/3",
    "size": 1928
  },
  {
    "name": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d-part-25",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2017 - Progress in AM - Dilip et al. - Influence of processing parameters on the evolution of melt pool, porosity, and microstructures i.pdf-77ff682e-9368-48e6-a96a-c40309de953d.md",
    "content": " Svenungsson J, Choquet I, Kaplan AFH (2015) Laser welding process—a review of Keyhole welding modelling. Phys Proc 78:182-191 \n20. Verhaeghe F, Craeghs T, Heulens J, Pandelaers L (2009) A pragmatic model for selective laser melting with evaporation. Acta Mater 57(20):6006-6012 \n21. Akman E, Demir A, Canel T, Sınmazçelik T (2009) Laser welding of Ti6Al4V titanium alloys. J Mater Process Technol 209(8):3705-3713 \n22. Gao X-L, Zhang L-J, Liu J, Zhang J-X (2014) Porosity and microstructure in pulsed Nd:YAG laser welded Ti6Al4V sheet. J Mater Process Technol 214(7):1316-1325 \n23. Kou S (2003) Welding metallurgy. Wiley, New Jersey \n24. Zhao X, Li S, Zhang M, Liu Y, Sercombe TB, Wang S, Hao Y, Yang R, Murr LE (2016) Comparison of the microstructures and mechanical properties of Ti-6Al-4V fabricated by selective laser melting and electron beam melting. Mater Des 95:21-31 \n25. Kelly SM, Kampe SL (2004) Microstructural evolution in laser-deposited multilayer Ti-6Al-4V builds: part I. Microstructural characterization. Metall Mater Trans A 35(6):1861-1867 \n26. Krieth F, Bohn MS (1986) Principles of heat transfer, 4th edn. Harper and row publishers, New York \n27. Teng C, Gong H, Szabo A, Dilip JJS, Ashby K, Zhang S, Patil N, Pal D, Stucker B (2016) Simulating melt pool shape and lack of fusion porosity for selective laser melting of cobalt chromium components.",
    "summary": "References - Part 3/3",
    "size": 1370
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-1",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Mohammad Parsazadeh a, Shashank Sharma b, Narendra Dahotre a,b,*\n\na Center for Agile and Adaptive Additive Manufacturing, University of North Texas, 3940 N ELM Street, Denton, TX 76207, USA  b Department of Materials Science & Engineering, University of North Texas, 3940 N ELM street, Denton, TX 76207, USA\n\n# ARTICLEINFO\n",
    "summary": "Towards the next generation of machine learning models in additive manufacturing: A review of process dependent material evolution",
    "size": 323
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-2",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "# ABSTRACT\nKeywords:  Additive manufacturing  Defect detection  Physics informed machine learning  Product quality  Supervised learning  Unsupervised learning\n\nAdditive manufacturing facilitates producing of complex parts due to its design freedom in a wide range of applications. Despite considerable advancements in additive manufacturing techniques, 3D- printed parts are still suffering from durability, reproducibility, and reliability. One main reason, which increases the complexity of the problem and causes defects during manufacturing, is the high number of processing parameters. Machine learning approaches seem to be a promising solution to tackle the challenges in the additive manufacturing field. This paper employs a systematic literature review by employing natural language processing and text mining techniques to analyze the recent advancement in the application of machine learning in porosity detection and prediction in 3D- printed parts. Two methods of text analytics are used to evaluate different avenues of research in additive manufacturing. Most frequent machine learning methods employed to evaluate the porosity formed in the 3D- printed parts are introduced and classified based on their applications. Recent advancements in developing hybrid machine learning models reveal the importance of physical domain knowledge (e.g., thermomechanical laws and constraints) in these models and their accuracy. Eventually, challenges and opportunities that exist for the next generation of machine learning techniques in the AM field are identified and summarized.\n\n# 1. Introduction\n",
    "summary": "1. Introduction, ABSTRACT",
    "size": 1606
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-3",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "A group of track- by- track followed by layer- by- layer fabrication processes, which is now called additive manufacturing (AM), has had different names during the past 30 years. AM has evolved from rapid prototyping (RP) [1] and rapid tooling [2] methods to a technique employed for end- use parts. AM was also known as solid freeform fabrication (SFF) [3], 3D printing (3DP) [4], and rapid manufacturing (RM) [1]. AM, which was previously limited to prototype fabrication, is now capable of producing end- use metallic products [5]. AM has unique capabilities for building complex and customized one- of- a- kind parts (particularly in the aerospace [6] and biomedical industries [7]) from computer- aided design (CAD) [8] models. Compared to traditional manufacturing techniques, AM\n\nenables fabrication of intricate products with unique microstructure and material properties in a time- efficient and cost- effective way [9].\n\nAM processes can be classified into 7 categories based on ASTM F42 [10]. The articles reviewed here fall into 3 classes of deposition techniques, namely powder bed fusion (PBF), directed energy deposition (DED), and material extrusion, as shown in Fig. 1. In the PBF process, the powder bed uniformly spread over the substrate is selectively melted by a laser or electron beam, which is used as the energy source [11]. In the DED process, the continuous powder stream or wire fed from the deposition nozzle is melted by a focused laser beam to fabricate an object [12]. In the PBF process, the laser speed is approximately one order of magnitude faster than that in DED and the melt pool dimensions are approximately one order of magnitude smaller than that found in the DED process [13]. In the materials extrusion process, the metal powder is mixed with a polymer binder, then the mixture is extruded through the nozzle layer- by- layer to fabricate a part [5,14].",
    "summary": "1.1. Additive manufacturing - Part 1/2",
    "size": 1897
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-4",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "There are many barriers that still restrict the widespread application of metal- based AM as a mainstream manufacturing method. A major challenge in the current additive manufacturing (AM) field is the inconsistency of the printed products (repeatability) [15- 17]. Lack of standardization [18], process reliability, and part quality [19] are also other challenges in the AM field, which require more attention. These issues also affect the performance of the product [20,21]. To identify these technological obstacles and desired capabilities of AM, many recent road mapping efforts have been conducted [22,23]. However, a better understanding of AM manufacturing from design to production is still required.\n\nImproving the reliability and part quality needs a deep understanding of defect formation during manufacturing. In one attempt by Qu et al. [24], nanoparticles were employed to eliminate the large spatters by controlling laser powder bed interaction instabilities. The elimination of large spatters led to a significant reduction of defects in the 3D- printed parts, though multiple pores were observed in the samples printed in their study. Pore formation can have two origins in the AM process. One originated from the powders (gas entrapment in powders) and another one could be originated from the AM processing conditions (oxidation during the AM process, hydrodynamics conditions, including capillary and wetting effects, etc. [25,26]) [27]. These processing conditions could be more than 130 parameters [28], which affect the final quality of the 3D- printed parts and make the design challenging [29]. Carefully designed experiments are one way to evaluate various parameters, (e.g., powder quality, beam power, layer thickness, laser speed, and scan speed) affecting the quality of 3D- printed parts.",
    "summary": "1.1. Additive manufacturing - Part 2/2",
    "size": 1820
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-5",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "One major challenge of AM field that is rich with data is to store and analyze the data. Among all the data- driven methods, machine learning (ML) models seem to be promising to predict and optimize the quality of 3D- printed materials. Recent signs of progress in employing ML to analyze the data in the AM field have been reviewed with a focus on introducing the concept of ML and the potential ML algorithms for solving the existing problems in the AM field [30], investigating shallow and deep learning- based methods for monitoring processing parameters[31], predicting quality of 3D- printed parts using supervised learning [32], summarizing the ML algorithms used for defect detection in the metal laser- based AM process [33], predicting fatigue life and fracture of 3D- printed parts [34], optimizing processing parameters and detecting anomalies, and designing for AM, property prediction and material analytics [35- 38]. A few of these review papers [39] focused on the studies that implemented the laws of physics in developing ML models, but they are not covering a broad application of ML in the AM field. This review paper aims to conduct a systematic literature review to differentiate various ML approaches implemented to analyze the process- dependent material evolution, categorize the datatypes used to develop ML models in the AM field, summarize the studies that constrained their ML models by laws of physics, and discuss the challenges and opportunities in the AM field.",
    "summary": "1.2. Research strategy - Part 1/4",
    "size": 1494
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-6",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "To review the ongoing research regarding the application of ML in AM, a systematic literature review [40] has been conducted with a focus on recent publications on physics- informed machine learning models. The overall structure of this review paper is indicated in Fig. 2. The methodology used to conduct this literature review is also indicated in Fig. 3. At first, the relevant publications to the scope of this review are selected based on their qualities, publication date, and keywords. The titles, abstracts, and keywords of the selected articles for review are extracted and stored separately to further analyze the selected documents using the natural language processing (NLP) [41] and text mining approaches. To do this, NLP with K- means clustering and text mining techniques of the co- occurrence network were employed to extract the hidden knowledge. Several preprocessing steps should be taken to transform the text data into a more suitable form for text mining machine learning. At first, the text is split into smaller groups called tokens, which form strings. Then, the tokens, having low values archived in the stopwords list [42] or manually identified were removed. The process of\n\n![](images/c714e476797fc53a3ed8da5310199b32f29e61a92d221444b0036b64c57e04f9.jpg)  \nFig. 1. AM processes in machine learning.\n\n![](images/9b7060142514bc27cc923a9c3890308d6043b511bdab8a13a29d584d212aaed0.jpg)  \nFig. 2. Overall structure of this review paper.\n\n![](images/0c36723acdbd5d5933fd2b14692255a813a0f2c0dcdd64026e0d22c86cc8530a.jpg)  \nFig. 3. Methodology used to conduct this literature review.",
    "summary": "1.2. Research strategy - Part 2/4",
    "size": 1604
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-7",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "reducing the word into its base form (demmatization) and additional filtering were conducted as the last step of preprocessing to improve the performance of text mining and NLP techniques. To convert text into a digestible form for machine learning, the term frequency- inverse document frequency (TF- IDF) [43] method was employed. TF- IDF is a weighting scheme that assigns higher weights to the words that are not commonly observed in a dataset but are repeated frequently in a few documents. The matrix created using the TF- IDF approach is fed into a K- means clustering algorithm. The number of clusters in the K- means algorithm was chosen based on the within- cluster sum of square (WCSs) and average silhouette score criteria [44]. The WCSs and silhouette calculate the compactness of clusters and the separation of the distance between clusters, respectively. The principal component analysis (PCA) and t- distributed Stochastic Neighbor Embedding (t- SNE) were also employed to transform the high- dimensional TF- IDF matrix [43] into two- dimensional representation, and the results of these two transformations are indicated in Fig. 4. The results indicated that PCA performed better than t- SNE regarding visualizing the clusters, as the clusters are not clearly differentiable in t- SNE. The natural language processing analysis indicates that the articles selected to review based on the criteria indicated in Fig. 3 can be classified into three categories, namely the papers employed experimental and physics- based approaches, the papers employed data- driven approaches, and the literature review papers published recently in the AM field. A part of these clusters overlapped, which means that both data- driven and physics- based models were used and discussed in these manuscripts.",
    "summary": "1.2. Research strategy - Part 3/4",
    "size": 1802
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-8",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "As K- means clustering can only reveal the association between clusters of documents and fails to indicate the association between the words within a cluster, co- occurrence network [45] was applied to each cluster identified earlier as illustrated in Fig. 5. In the co- occurrence network, communities (or subgraphs) of words are formed among the words with strong co- occurrence. Dashed lines indicate the co- occurrence of words in different communities. Each community with enough nodes describes a storyline, and the\n\n![](images/9e1fc97ee243464b35151228d4ae9ad60208db1fcafeeac2d65ac94d9bb7e095.jpg)  \nFig. 4. Categorizing the articles reviewed in this paper using (a) PCA, (b) t-SNE.\n\nconnected communities could be merged into one storyline. In Fig. 5a, the network structure in subgraph No. 1 (in cyan) can construct a field of research related to \"defects\" demonstration and \"quality\" improvement in \"powder\" \"bed\" \"fusion\", while the network structure in subgraph No. 3 (in purple) can construct a field of research related to the \"effect\" of \"scan\" \"speed\", \"laser\" \"power\", and \"layer\" \"thickness\" on \"keyhole\" and \"conduction\" \"modes\" in \"melt\" \"pools\". Similarly, subgraph 1 (in cyan) anecdotes the application of \"machine\" \"learning\" \"approaches\" in \"classification\" of \"porosity\" and \"quality\" evaluation as depicted in Fig. 5b, and different research areas covered in the recently published review papers are depicted in Fig. 5c. These subgraphs provide brief straightforward storylines regarding the articles reviewed in this paper and research conducted in additive manufacturing.",
    "summary": "1.2. Research strategy - Part 4/4",
    "size": 1598
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-9",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "# 1.3. Defect detection\nTo obtain an optimal processing window for part manufacturing with little to no defects, various experimental monitoring approaches have been employed, which could be categorized into in- situ monitoring techniques conducted during the part\n\n![](images/c8dde39362f6665babc496c43e2dd69ec94bca9d8a74f149084f03f666cb8815.jpg)\n\nmanufacturing, and ex- situ monitoring techniques conducted after the part production [46]. For example, computed tomography (CT scan), a nondestructive evaluation technique, can be used for defect detection, geometric analysis, quantitative comparison, structural quantification, and porosity analysis [47,48]. The majority of these monitoring techniques pay particular attention to the characteristics of the melt pool, as the common defects (i.e., keyhole porosity, lack of fusion, balling), happening during the fabrication in the AM field, have an origin in the dynamics of the melt pool [49- 53]. These fabrication defects affect the structural performance and fracture behavior of the 3D- printed parts, as discussed in a study by Khosravani and Reinicker [54]. In experimental techniques, usually small cubes are built, and the mechanical properties of these cubes are evaluated [55] or material is printed on a single- track basis at different processing conditions [56,57]. Although the experimental approaches are reliable, they are tedious and expensive [37,35]. Physics- based models [58] could also be an alternative, but they are computationally expensive, and their accuracy depends on the assumptions, element type, boundary conditions, and constitutive models (i.e., finite element (FE) models) employed during the simulation [59,60]. They also require many simplifying assumptions, and the large uncertainty of the underlying thermo- physical process makes the models less reliable (i.e., analytical solutions, FE models) [61- 64].",
    "summary": "1.3. Defect detection",
    "size": 1898
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-10",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "To remedy the issues with experimental and physics- based approaches, data- driven approaches are employed. Data- driven approaches seem to be a suitable alternative, as these methods can predict highly non- linear relationships between a variety of parameters. Traditionally, the design of experiment (DOE) scheme has been used to analyze the processing parameters and optimize the output [65]. However, the DOE approaches require many trials and error efforts to find the zone where the response behavior changes. In the AM field, these trials and error efforts are time- consuming and costly [66,67]. ML models are an attractive alternative data- driven approach to optimize the response based on past data or experience [68]. Due to the high capability of the ML models in predicting highly nonlinear problems, these models have been previously used in many nonlinear problems (e.g., corrosion [69], erosion [70], mechanical properties optimization [71,72]), which are out of the scope of this review paper. ML can improve the quality of 3D- printed parts, optimize processing parameters, and reduce cost. Analyzing data using ML is relatively limited in materials science due to a variety of reasons. Developing an ML model requires a large dataset. The lack of a large dataset is a significant reason, limiting the use of ML [73]. Also, current ML models find statistical correlations between the inputs and output of AM problems at the expense of ignoring physical laws, which makes these models inexplicable. The models generated using this approach do not enlighten how they can make the final decision. For example, the melt pool images are widely used as the inputs in the ML- driven models without understanding the complex laws of nature and the physical relationship between the inputs and response.",
    "summary": "1.4. Apliction of machine learning in additive manufacturin - Part 1/2",
    "size": 1813
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-11",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " One way to go around these limitations is to link the ML- driven models to physics- based models and experimental data to analyze the process- structure- property of the fabricated part in a timely manner and accurately [59,74- 76]. The paradigm developed using this approach uplifts the conventional non- physics- informed ML models, which act as a black box, to physics- informed ML (PIML) models, which are capable to constrain the model based on domain- specific knowledge.\n\nThis review paper also introduces the responses studied in the metallic AM field to control and improve the quality of 3D- printed parts. Although the outputs of each of these processing- structure- property- performance (PSPP) stages affect the quality of the part [77- 79], this review paper focuses mostly on the recent application of ML in analyzing and optimizing the metallic AM processing parameters and their effects on the processing and structure stages with specific attention to the PIML models. A detailed review is available elsewhere regarding the application of ML in other stages of 3D printing [21,35,37,30,80] and more specific to polymeric materials [81]. The ML approaches implemented in the AM field were categorized, and the way that these data- driven approaches\n\n![](images/2b5669f8c7a6c99d2f49c477289dca6eec7601e1cf10e725bd2e57bd289d3364.jpg)  \nFig. 6. Word cloud of the input parameters studied in the articles reviewed.\n\naccelerate the discovery of the most suited processing conditions in the AM processes was discussed. Eventually, this review paper provides concluding remarks and future research directions toward the next generation of machine learning in AM.",
    "summary": "1.4. Apliction of machine learning in additive manufacturin - Part 2/2",
    "size": 1672
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-12",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "The final quality of 3D- printed parts depends on more than 130 processing parameters, which make the prediction of the quality of the parts very complex. The effects of many of these processing parameters on the quality of the 3D- printed parts have been evaluated in different studies. The processing parameters evaluated in the articles reviewed in this paper have been collected and the frequency of evaluating these input parameters was obtained using the wordCloud library in Python and indicated in Fig. 6. As indicated, the beam power and scan speed are the two most frequent processing parameters widely analyzed in different studies.\n\nThe processing parameters have a relationship with the parameters in other stages of manufacturing, which are directly or indirectly linked to the quality of 3D- printed parts. The interrelationships between the processing parameters, thermal history, solidification, microstructure, and mechanical properties of the AM parts were illuminated in Fig. 7. A better understanding of these interrelationships could improve the quality of the 3D- printed parts.",
    "summary": "2. Types of data in AM",
    "size": 1101
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-13",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Porosity, a common defect in 3D- printed parts, significantly affects the quality of parts and repeatability. Porosity formation could be due to the keyhole effect, gas entrapment, lack of fusion, and rapid solidification of the AM part [82,63,83,84]. The porosity size and shape formed by each of these phenomena could be different, as depicted in Fig. 8. Microscopic pores are usually formed due to gas entrapment (gas is sometimes trapped and remained inside the vapor cavity, as the vapor cavity is solidified and closed up before the gas can escape) [85], while the size of process- induced pores (i.e., lack- of- fusion porosity [86,87] and shrinkage porosity [88]) varies from sub- microns to macroscopic scales [89].",
    "summary": "2.1. Porosity formation - Part 1/4",
    "size": 724
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-14",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "When laser irradiation strikes the powder and substrate, two melting modes may occur. At low to moderate laser energy intensity, the material is locally melted without clear material vaporization. Conduction is the main mechanism of heat transfer inside the melt pool, which is expressed as conduction mode [83]. Insufficient penetration of the melt pool of a succeeding layer into the substrate or previous layer leads to lack- of- fusion and un- melted powders [90]. This un- melted particle causes high porosities and poor mechanical properties [91]. High melting rates may also cause keyhole porosity [92,25] and lack- of- fusion [27] as depicted in Fig. 9 due to Marangoni convection and recoil pressure [93]. At high laser energy intensity, the material vaporizes on the surface and forms a dense vapor plume, consisting of a cluster of molecules, atoms, ions, and electrons that creates a recoil momentum on the melt pool and forms a cavity [83] in the keyhole mode. In one definition, keyhole mode occurs when power density is higher than  $10^{6}W / cm^{2}$ , otherwise, conduction mode is dominant [94,95]. In another definition, if the aspect ratio of the melt pool is larger than unity, the melting occurs in the keyhole mode otherwise the conduction mode is dominant [96]. It is worth mentioning that the presence of keyhole mode does not necessarily lead to keyhole porosity [92].\n\nThe effects of scan speed and beam power, which determine the dominant melting mode, on the porosity formation were evaluated in a study by Jadhav et al. [97], and an L- PBF- based process map, revealing the threshold line between these modes were plotted in\n\n![](images/dc1bb28aade1e47de1439e6c4dfe17584e19bad0c8ac16838a1eb59e6cd25f2e.jpg)  \nFig. 7. Relationship between manufacturing processing parameters, thermal history, solidification, microstructure, and mechanical behavior of AM parts.",
    "summary": "2.1. Porosity formation - Part 2/4",
    "size": 1890
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-15",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "![](images/b07e18f62b813609c0beb30036521fc5c88ee99bd2fd21b6e620b4dda33ceb75.jpg)  \nFig. 8. Charachteristic pores in SLM (a) entrapped gas porosity, (b) incomplete melting-induced porosity, (c) lack of fusion with unmelted particles inside large irregular pores, and (d) cracks [104].\n\n![](images/3e9d0dc6968009de1e558aeaa6337fcd583c324d1a3d371aeec0aabed598395c.jpg)  \nFig. 9. Schematics of the relationships between surface morphology and defect formation in a powder-bed fusion type AM process [27]\n\nFig. 10. Also, the transition mode observed in between the conduction and keyhole modes results in oscillatory melt surface wave, melt spatter, and denudation, negatively affecting the surface roughness and mechanical properties [98]. Transition conditions can also be identified using the normalized enthalpy, which combines the effects of laser speed, power, and beam size during the LPBF process [92]. No method is capable of fully considering all processing parameters to predict the dominant melting mode and quality of the 3D- printed parts.",
    "summary": "2.1. Porosity formation - Part 3/4",
    "size": 1048
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-16",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Pores can also form due to balling effect, resulting in an uneven powder layer [99]. Balling effect depends on the wettability, capillary forces, and surface tension of the melt pool [100]. Balling phenomenon could also occur in high beam powers and scan speeds or in high scan speeds and low beam powers, causing weak bonding to the substrate [101]. Porosity can also be formed between grains and follow the shape of grain boundaries during solidification [102]. Predicting the nonlinear relationship between processing parameters and porosity is very difficult using conventional approaches. Density measurement and image processing methods are two common ways to identify the porosity percentage in a product. Wang et al. [103] recently reviewed the role of porosity defect in the 3D- printed parts, including the defect characterizations, formation and migration mechanisms, and their effects on the quality of 3D- printed parts. To evaluate the porosity percentage in the 3D- printed parts and develop a predictive model, data- driven techniques are employed due to the previously mentioned benefits of these techniques compared to other techniques.\n\n![](images/bfeabdf2915cda38209e502fe4795057ee3a72e37a5a3b4b193577d1887343f1.jpg)  \nFig. 10. (a) Morphology of melt tracks present on the top surface of the sample built, (b) L-PBF process map of pure copper, indicating a threshold line between the conduction and keyhole mode melting regimes [97].",
    "summary": "2.1. Porosity formation - Part 4/4",
    "size": 1453
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-17",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "One main contributor to dimensional inaccuracies produced by the AM approaches is material shrinkage (MS) [105], which is related to the powder properties and processing parameters [106]. Sintering shrinkage and thermal shrinkage are two common kinds of material shrinkage. The former is generally formed by densification, while the latter is mainly caused by cyclic heating and cooling, leading to significant residual stress and local plastic deformation [107]. To evaluate the material shrinkage, the shrinkage ratio, which is defined as the difference between the desired value and the actual value over the desired value, is employed. When the heated zone starts cooling down, along with changes in the microstructure, the material shrinkage occurs, but this deformation is restrained by the plastic strain formed during the heating step [108] and previously solidified layers underneath [109]. Thus, strong tensile stresses are formed at the interlayer zone [110]. These variations during the cooling step result in a significant deviation from the expected nominal geometry [111]. Zhu et al. [112] attributed the shrinkage of metallic powder to the scan speed and beam power during the SLM process. Wang et al. [113] simulated a multi- layer deposition process to analyze the surface unevenness and excessive build- ups, which always occur in the DED process and reported unstable linear powder feed rate, laser/powder defocusing, accumulated heat, and powder positive defocusing as the reasons of these dimensional inaccuracies in the 3D- printed parts. Raghunath and Pandey [114] used the Taguchi method [115] to design experiments and evaluate the importance of the processing parameters using the analysis of variance [65] between the processing parameters and shrinkage of 12 samples produced using the SLS technology. They concluded that hatch spacing and beam power significantly affect dimensional accuracy.",
    "summary": "2.2. Dimensional inaccuracies - Part 1/2",
    "size": 1922
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-18",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "![](images/97b2e35b0aca720711eb80dc807d02393c283f19fd72d080d3967e7d64d6f2fa.jpg)  \nFig. 11. (a) Surface microstructure of two different sizes of powders, (b) Optical microscopy of  $5\\mu m$  powder (left) and  $30 + 5\\mu m$  (right), and (c) sintered density and volumetric shrinkage relationship of  $5\\mu m$  powder and its bimodal mixtures [121].\n\nMaterial shrinkage during the sintering process could also contribute to porosity in 3D- printed parts and lead to part defects [116], as material shrinkage causes non- uniform internal stresses [117,118]. These non- uniform internal stresses result in the deformation of 3D- printed products [119]. This materials shrinkage could be controlled by correlating the material shrinkage with the processing parameters [119,120]. Bai et al. [121] evaluated the effect of powder size on the material shrinkage and porosity, as depicted in Fig. 11. They concluded that there is a relationship between material shrinkage and density as indicated in Fig. 11c. It is worth mentioning that the relationship depicted between the powder size and material shrinkage is highly dependent on other processing parameters, which require a large dataset to further investigate.",
    "summary": "2.2. Dimensional inaccuracies - Part 2/2",
    "size": 1208
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-19",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "One significant response parameter in the processing stage, which has been heavily employed to analyze the quality of the 3D- printed parts, is the melt pool dimensions. Melt pools are mainly defined as deposited, remelted, and heat- affected zones[83]. Melt pool geometry is indirect evidence of interactions between the processing parameters and microstructure of the materials (i.e., intrinsic materials properties) [122]. Keyhole formation, balling effect, and lack of fusion can be distinguished based on the melt pool geometry [123]. More importantly, melt pool depth has been measured and analyzed in many studies [124- 126,122], as the melt pool depth is of great interest compared to melt width and length. Melt pool depth reveals if the energy is sufficient to melt through the powder and substrate at a certain beam power and speed [29]. High energy deposition on powder layers causes metals to vaporize [91]. The reaction force of evaporation of liquid metals causes the formation of a vapor cavity in the melted region and causes a deeper melt pool. Several physics- based models have also been developed to predict the melt pool depth and width [127- 131], however, more physical phenomena should be considered in these models to make the model more reliable.",
    "summary": "2.3. Melt pool dimensions - Part 1/2",
    "size": 1273
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-20",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "As considering all physical phenomena occurring during the melt pool is difficult, the design of experiment scheme is used to develop regression models based on the processing parameters. In one attempt, Zhuang et al. [132] employed response surface methodology [65] to correlate the processing parameters with the dimensions of the melt pool produced in the SLM process. Melt pool dimensions and shape were also predicted using a coaxial imaging system in a study conducted by Sun et al. [133]. Melt pool dimensions could be used as a key feature to characterize the microstructure and predict the mechanical properties of the parts additively manufactured [50]. To do this, data- driven models could be assisting physics- based models to better identify the relationship between the processing parameters, melt pool dimensions, defect formation, and mechanical properties.",
    "summary": "2.3. Melt pool dimensions - Part 2/2",
    "size": 874
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-21",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "# 2.4. Remelted depth\nCarefully controlling the microstructure and homogeneity is one way to improve the quality of 3D- printed parts. The heat- affected zone [134] and the remelted depth are the parameters evaluated to enhance the quality of the 3D- printed parts through improving the material homogeneity [135], degassing and deoxidation [136], and reducing porosity [137]. Small remelted depth may result in incomplete fusion [138], poor metallurgical bonding between the previously solidified layer and the melted powder [139,140], uneven microstructure distribution [141], and poor wetting [142]. On the other hand, large remelted depth causes geometrical inaccuracy in the 3D- printed parts [143] and deteriorated interlayer metallurgical bonding [144].\n\nTo analyze the quality of the 3D- printed parts, many studies tried to find the relationship between the processing parameters and remelted depth. Vastola et al. [145] evaluated the effect of beam size, shape, and scan speed on the size of the remelted pool for an AISI 316L stainless steel. Zhang et al. [146] evaluated the relationship between the remelted depth and linear energy density defined as the beam power over scan speed for Ti6Al4V. Predicting the remelted depth requires identifying the dominant parameters and developing a correlation based on these parameters. Developing a correlation between the processing parameters and remelted depth requires employing appropriate data- driven techniques and a large dataset, which are further discussed in the next sections.",
    "summary": "2.4. Remelted depth",
    "size": 1542
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-22",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Another way to evaluate the microstructure of the AD- fabricated parts is to evaluate the real- time melt pool temperature distribution. Analyzing the heat transfer mechanisms, thermal accumulation, transient temperature distribution, and their relationship helps reduce residual stresses, distortion [147], micro- voids, and cracks formation in 3D- printed parts [148,149]. This thermal distribution in the material is related to scan strategies [150]. A small melt pool at low temperature implies insufficient overlaps between the current melt pool with the next melt pool and lack- of- fusion porosity in the built part [151]. In a melt pool, the cooling rate increases with the increase of the beam power and scan speed [152]. The creation of large thermal gradients is more probable at high cooling rates, which result in an increase of residual stresses, cracking [152], instability, and porosity formation [111,153]. On the other hand, low cooling rates and high temperatures may negatively affect the microstructure refinement and mechanical properties of the 3D- printed parts [152]. The desired uniform operating temperature helps melted material to flow within the melt pool moderately. However, non- uniform temperature gradients and repeated thermal cycles, occurring mainly in the DED process lead to porous and anisotropic microstructures [154] within the 3D- printed parts due to the rapid solidification [155]. This heterogeneous behavior in the microstructure due to the variation in the thermal history affects the mechanical properties, such as fatigue resistance and tensile strength [156]. To homogenize temperature distribution and reduce local heat accumulation, the scanning pattern, one influential parameter on the temperature distribution, needs to be optimized, which leads to minimum distortion [157]. The relationship between the processing parameters and the temperature of the melt pool has been analyzed by Hua et al. [158].",
    "summary": "2.5. Thermal history - Part 1/2",
    "size": 1958
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-23",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Balling can also be detected via observation of the temperature distribution of the melt pool and its surrounding area [159].\n\nin the resultant microstructures affect the mechanical properties of the 3D- printed parts [160]. As indicated in Fig. 12, thermal history could also be used as an input parameter [161,162] along with the processing parameters to evaluate the quality of the part, as developing a model using beam parameters (e.g., power, speed, and size) and build parameters (e.g., hatch spacing) may not account for the complex heat distribution in a real part.",
    "summary": "2.5. Thermal history - Part 2/2",
    "size": 575
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-24",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Acoustic and spectra emissions are two common data types that have been used to evaluate the quality of the 3D- printed parts. These acoustic emissions could be used as the input of an ML model, which are correlated to the possible defects, or could be used as the output of an ML model, which is linked to the processing parameters. Acoustic signals acquired during the AM processes are converted into electrical signals, and the signal features are extracted and employed to form clusters used to distinguish different defect mechanisms.\n\nAlso, the spectra emissions produced during the process are collected to extract information about the physics of the problem [164]. When the powder is melted by the laser, a part of the metal is evaporated, which forms plasma above the melt pool. Photons emitted as line emissions have specific wavelengths, and thermal radiation is collected in the spectra. The constitutive elements of the plasma are identified by these wavelengths of the line emissions in the spectra [165] The intensity and shape of spectra indicate the concentration and plasma condition, including the plasma temperature [165], and are directly related to the process parameters and quality of the 3D- printed parts.",
    "summary": "2.6. Acoustic and spectra signals",
    "size": 1232
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-25",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Machine learning approaches have gained increasing attention due to their great performance in data tasks, such as regression, classification, and clustering. They can be categorized according to the amount and type of supervision required during training [166] into supervised learning, unsupervised learning, semi- supervised learning, and reinforcement learning [166], as shown in Fig. 13. In supervised learning, the data are labeled, and the data are split into training data and testing data [55]. In unsupervised learning, the data are not labeled, and no training data are required to create the model. In semi- supervised learning, a small part of the datasets are labeled, and then the system learns from these labeled data and classifies a large amount of data. Reinforcement learning, however, is dissimilar from other ML approaches, because this approach uses a reward- and- penalty mechanism to train the algorithm. Favorable actions are rewarded and unfavorable actions are punished, leading to reinforcing good behavior [167]. Reinforced learning (RL) is a suitable approach for real- time metal AM process control in which it is adjusted through machine setting, as RL authorizes goal- seeking sequential decision- making, which was previously used in different AM applications, including controlling melt pool depth and\n\n![](images/dca14e5fbde7bb9ce8d1cbf53542501f1118439075aa25be3783d464a5cba5e9.jpg)  \nFig. 12. Geometric error compensation of Ti-6Al-4 V in the L-PBF process. The input parameters are (a) the thermal history and (b) processing parameters. The output is (c) the predicted distortion using an ML model [163].\n\n![](images/e324078e71008fe90c9f6424d22ccf24308e744384b8f90f80be2a2f5c7b5cec.jpg)  \nFig. 13. Applications of machine learning in the AM field.\n\nimproving mechanical properties consistency throughout the AM parts [168].",
    "summary": "3. Machine learning - Part 1/4",
    "size": 1862
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-26",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Developing a machine learning model starts with data preparation and data organization. Several different mathematical tools could be employed to represent scaler values. Typically, observations are stored in rows and each column represents a feature. These observations form a matrix as follows [169]:\n\n$$\nX = \\left[ \\begin{array}{cccc}x_{1,1} & x_{1,2} & \\dots & x_{1,m}\\\\ x_{2,1} & x_{2,2} & \\dots & x_{2,m}\\\\ \\vdots & \\vdots & \\ddots & \\vdots \\\\ x_{n,1} & x_{n,2} & \\dots & x_{n,m} \\end{array} \\right], \\tag{1}\n$$\n\nwhere the columns of  $X$  represent each feature (i.e., processing parameters) and the rows of  $X$  represent observations. Similarly, the output (i.e., resulting properties) can be stored in a separate vector as follows:\n\n$$\nY = \\left[ \\begin{array}{c}y_{1}\\\\ y_{2}\\\\ \\vdots \\\\ y_{n} \\end{array} \\right], \\tag{2}\n$$\n\nwhich is also called labeled data and employed mostly in supervised machine learning approaches.\n\nTwo hypotheses exist in machine learning: (1) A correlation exists between the input data and output (the relational hypothesis), (2) similar inputs in the design space will reach similar outputs (the similarity hypothesis). In supervised machine learning, the goal is to determine a relationship between  $x$  and  $y$  based on the previous observations of  $x$  and  $y$  as follows:\n\n$$\nf(x) = y. \\tag{3}\n$$\n\nThis functional mapping can take either the form of regression or classification. Functional relationships can have many forms, depending on the type of supervised machine learning model employed. One way to form this relationship is:\n\n$$\nX\\beta = Y, \\tag{4}\n$$\n\nwhere  $\\beta$  is a vector of coefficient, which defines the weight of inputs to predict  $Y$ . Least square regression is a common method to measure  $\\beta$ , which is based on the minimization of the difference as follows:\n\n$$\nmin\\| X\\beta -Y\\| _2^2 \\tag{5}\n$$",
    "summary": "3. Machine learning - Part 2/4",
    "size": 1877
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-27",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Similarly, Eq. 5 could be applied in an unsupervised approach, the closer  $X\\beta - Y$  is to 0, the more similar  $X\\beta$  is to  $f(x)$ , as unsupervised machine learning approaches are employed to detect similarities and conclude based on the similarity hypothesis. In unsupervised learning, a distance parameter can be defined between the data points in the design space as follows [170]:\n\n$$\n\\left\\| a - b\\right\\| _2 = d, \\tag{6}\n$$\n\nwhere  $a$  and  $b$  are the data at two specific conditions of the input values (features), and the value of  $d$  represents how close or similar  $a$  and  $b$  are. In general form, the distance function can be written in the form of [170]:\n\n$$\nd(a,b) = ||a - b|| = \\sqrt{\\sum_{s = 1}^{D}(a_s - b_s)^2}, \\tag{7}\n$$\n\nwhere  $D$  represents the dimensions or the number of features. Further details regarding the mathematics of ML models can be found in [169,170] for interested readers.",
    "summary": "3. Machine learning - Part 3/4",
    "size": 931
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-28",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "The machine learning models can also be categorized into batch/offline learning and online learning [166]. In offline learning, the model is incapable of learning incrementally and must be trained using all available data. The model requires a lot of time and computing resources. When the model is trained and is ready for production, it runs without learning anymore [166]. In online learning, the model can learn incrementally on the fly [166], as shown in Fig. 14. This approach is suitable when one is dealing with an extremely large dataset, which is updated and getting larger with time. Although online monitoring of the live AM process linked with a feedback control adjusting experimental parameters on the fly could be a major research thrust in AM, online learning has not been tested enough in the AM field. Similarly, ML methods can be classified into instance- based and model- based learning [166]. In instance- based models, the model identifies new cases by using a similarity measure, while a model is built and then used to make predictions in model- based learning [166]. The most common machine learning approaches used in the AM field are either offline instance- based or model- based, supervised, or unsupervised learning models, while other machine learning approaches have been less frequently employed in additive manufacturing. The ML models employed in the AM field and discussed here in this review are briefly summarized in Table 1.",
    "summary": "3. Machine learning - Part 4/4",
    "size": 1464
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-29",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "In the AM field, many studies [78,35,30,159] employed ML models to evaluate the response to each PSPP stage. For example, the roadmap of a potential approach [199], which utilizes a combination of a large amount of data collected from a large number of miniature specimens to train a machine learning model for evaluation of fatigue performance of AM parts, is illustrated in Fig. 15. This approach has the capacity of predicting fatigue crack growth of materials, analyzing the cause and effect flow to save time for experiments and simulations by developing ML forward models (PSPP left to right relationship), and optimizing the performance of AM parts by building ML inverse models (PSPP right to left relationship). In the AM processing stage, the input parameters indirectly affect the performance [77]. Depending on the type of the problem in AM, regression, classification, or clustering approach is employed, as indicated in Fig. 13. Tuning processing parameters is difficult [200]. Conventional ML approaches could be a suitable solution to link the processing parameters to the microstructure of the 3D- printed part and its performance. In contrast to experimental techniques, which are only designed and applicable for a particular subject, ML approaches are highly flexible and can be easily applied from one application to another [46]. However, these ML approaches sacrifice the complex physical relationships between the inputs and outputs in the AM field, which encourage practitioners toward developing the next generation of machine learning approaches by considering the laws of physics in the ML model. A recent review paper [39] listed five main ways to integrate physics into ML and develop physics- informed machine learning models (PIML), namely model input, model training, model components, model architecture, and model output.",
    "summary": "3.1. Supervised learning - Part 1/7",
    "size": 1856
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-30",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "In physics- informed model input (PIMI), hidden physical information is extracted from in- situ production data and linked to the processing parameters and/or simulation data to develop an ML model and create a meaningful relationship between the inputs and response. Projecting the time- temperature series into the time- frequency domain using wavelet transforms is an example of this method described in a study by Xie et al. [261]. Physics- informed model training (PIMT) and physics- informed model components (PIMC) are other types of PIML models, which have been employed in the AM field. The latter is based on physical consistency between inputs and outputs by punishing nonsense outputs through loss function [202], while the former is based on physics- informed activation functions and/or physics- informed initialization procedures. For instance, Inyang- Uloh and Mishra [203] developed a PIMC model, termed constrained- flow model, to analyze the spatial effect of droplet deposition in inkjet 3- D printing and proposed an\n\n![](images/4cf4e8a48153335ce28065de813e5aec89e23cba0b681dcfac9fcac95e7b50cd.jpg)  \nFig.14. Online learning flowchart.\n\nTable 1 Machine learning models.  ",
    "summary": "3.1. Supervised learning - Part 2/7",
    "size": 1192
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-31",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "<table><tr><td>Model</td><td>Description</td><td>Application in AM</td><td>Feature</td></tr><tr><td>Random forest (RF) [171]</td><td>Consisting of several decision trees trained on random sub-samples. \nReturning the average outputs of the decision trees (regression). \nReturning the highest vote of the decision trees (classification).</td><td>Reg., Clas.</td><td></td></tr><tr><td>Support vector machine (SVM) [172]</td><td>Predicting based on finding hyperplane, separating data points of different categories (regression).</td><td>Reg., Clas.</td><td></td></tr><tr><td>Gaussian process regression model (GPR) [173]</td><td>Probabilistic algorithms, returning a probability distribution over output values.</td><td>Reg., Clas.</td><td>Predict fairly well on small datasets.</td></tr><tr><td>Ridge linear regression (Ridge) [174]</td><td>A regularized linear regression.</td><td>Reg.</td><td>Reduce the model complexity and overfitting.</td></tr><tr><td rowspan=\"2\">Artificial neural network (ANN) [175]</td><td>Mimics human brain with individual networks exchanging information.</td><td rowspan=\"2\">Reg., Clas.</td><td>Large dataset required.</td></tr><tr><td>Includes an input layer, hidden layer(s), and an output layer.</td><td>Perform better with more than 1 hidden layer.</td></tr><tr><td>Convolution neural network (CNN) [176]</td><td>Consisting of multiple convolutional kernels to compute feature maps.</td><td>Clas.</td><td>Widely used for image recognition in AM.</td></tr><tr><td>XGBoost [177]</td><td>Implementing gradient boosted trees to generate predictions.</td><td>Reg., Clas.</td><td></td></tr><tr><td>Logistic regression (LR) [178]</td><td>Probability values and logistic function outputs are used in classification.</td><td>Reg., Clas.</td><td></td></tr><tr><td>Gradient Boosting trees (GB) [179]</td><td>It builds one tree at a time, which tries to improve errors produced by the previous tree.</td><td>Reg., Clas.",
    "summary": "3.1. Supervised learning - Part 3/7",
    "size": 1937
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-32",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "</td><td></td></tr><tr><td>Lasso linear regression (Lasso) [180]</td><td>A regularization method, optimizing the weights of linear regression.</td><td>Reg.</td><td rowspan=\"2\">More accurate prediction with less overfitting compared to linear regression. \nFor larger k, the more accurate interpolation, and the higher computational cost.</td></tr><tr><td>K-neighbours regression (KNN/ KNR) [181]</td><td>A nonlinear regression algorithm.</td><td>Reg.</td></tr><tr><td>Dense convolutional networks (DenseNet) [182]</td><td>Connecting each layer to every other layer in a feed-forward fashion.</td><td>Clas.</td><td>Effective for handling overfitting, and huge computation. \nSuitable for classifying melt pool images.</td></tr><tr><td rowspan=\"2\">Self-organizing map (SOM) [183]</td><td rowspan=\"2\">An artificial neural networks-based model that employs competitive learning to discern patterns.</td><td rowspan=\"2\">Clus.</td><td>Perform well in unsupervised tasks.</td></tr><tr><td rowspan=\"2\">Highly capable of visualizing data. \nImproved version of ANNs.</td></tr><tr><td>Self-organized and error driven (SOEDNN) [184]</td><td>A hybridized SOM and ANN method.</td><td>Clas.</td></tr><tr><td>Principal component analysis (PCA) [185]</td><td>A statistical technique, converting a set of correlated variables into a set of values linearly uncorrelated.</td><td>Dim. reduction.</td><td>In AM field, help to visualize data.</td></tr><tr><td>Multilinear principal component analysis (MPCA) [186]</td><td>A method to extract features of multidimensional data expressed as a tensor.</td><td>Dim. reduction.</td><td>Tensor based algorithm</td></tr><tr><td>Linear discriminant analysis (LDA) [187]</td><td>A method to find a linear combination of features, which characterizes or separates two or more classes.</td><td>Dim. reduction.</td><td>LDA is closely related to PCA.",
    "summary": "3.1. Supervised learning - Part 4/7",
    "size": 1863
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-33",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "</td></tr><tr><td>Bayesian network classifier (BN) [188]</td><td>A probabilistic classifier, providing probability information about the examined product.</td><td>Clas.</td><td>Useful in defect detection.</td></tr><tr><td>Spectral convolutional neural networks (SCNN) [189]</td><td>A recent extension of CNNs with improved efficiency in classification/regression tasks.</td><td>Reg., Clas.</td><td>Operating well on irregular data grids.</td></tr><tr><td>Support vector regression (SVR) [190]</td><td>A method to find the best fit line.</td><td>Reg.</td><td>Uses the same principles as SVM.</td></tr><tr><td>Locally linear embedding (LLE) [191]</td><td>It computes low dimensional neighborhood preserving embeddings of high dimensional data.</td><td>Clus.</td><td>Discover nonlinear structure in high dimensional data</td></tr><tr><td>Bag-of-Words (BoW) [192]</td><td>It works based on quantization of affine invariant descriptors of image patches.</td><td>Clus.</td><td>Simple computationally efficient and intrinsically invariant method</td></tr><tr><td>A means clustering algorithm (KMC) [193]</td><td>A simple method to classify dataset using a pre-defined number of clusters (k).</td><td>Clus.</td><td>Widely used image and acoustic emission analysis.</td></tr><tr><td>Deep belief network (DBN) [194]</td><td>A probabilistic graphical model that contains numerous layers for deep learning.</td><td>Clus.</td><td>Layer-by-layer training repeated to learn a deep model.</td></tr><tr><td>Gaussian mixture model (GMM) [195]</td><td>A function comprised of several Gaussians.</td><td>Clas.</td><td>Relatively time efficient model.</td></tr><tr><td>Deep reinforcement learning (DRL) [196]</td><td>A combination of deep learning and reinforcement learning.</td><td>Clas., Reg.</td><td>Automatically learning a policy with minimal manual training.</td></tr><tr><td>Proximal policy optimization (PPO) [196]</td><td>A widely successful actor-critic method.</td><td>Clas., Reg.",
    "summary": "3.1. Supervised learning - Part 5/7",
    "size": 1971
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-34",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "</td><td>Simple to use and tune.</td></tr><tr><td>Deep Q-network (DQN) [197]</td><td>A combination of deep learning and reinforcement learning.</td><td>Clas., Reg.</td><td>Fast convergence.</td></tr><tr><td>Soft actor critic (SAC) [198]</td><td>An off-policy actor-critic method.</td><td>Clas., Reg.</td><td>One of the most efficient RL algorithms used in real-world robotics.\n\n![](images/aa6b98f5be5d87a9444fcc3456998971046f8b12a03733c5081c0b3c9f2143a0.jpg)  \nFig. 15. Roadmap of a data-driven approach to analyze fatigue performance of AM parts using miniature specimens [199]\n\nactivation function to analyze the spatiotemporal evolution of the height profile. In another study [204], the same authors built on their previous work [203] by establishing a PIMT for the stability of training the model and translating this model to the physical stability of the height evolution in the inkjet 3- D printing.\n\nOther pillars of PIML are physics- informed model architecture (PIMA) and physics- informed model output (PIMO). In PIMA, the model, representing input information is trained during model optimization to perform physics- based analysis. Using the PIMA concept, Li et al. [205] presented a novel wavelet- driven deep neural network by replacing the first convolutional layer of the standard convolutional neural network (CNN) with a continuous wavelet convolutional (CWConv) layer to make more meaningful kernels employed for extracting defect- related impact component embedded in the vibration signal. Also, PIMO is based on the idea of considering physical consistency in the model while reaching the final decision. Grezmak et al. [206] employed this approach and presented an explainable CNN for gearbox fault diagnosis using Layer- wise Relevance Propagation (LRP) [207], which clarifies the",
    "summary": "3.1. Supervised learning - Part 6/7",
    "size": 1805
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-35",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "rationale behind the most time- frequency contributors to fault type and severity identification. With that in mind, direct use of physical parameters (e.g., temperature, beam power, scan speed, etc.) as the inputs to the ML models do not meet the PIML definition and should not be mistakenly considered as a PIML approach. In other words, any ML models with physically meaningful inputs or outputs are not necessarily called physics informed, as ML models should be constrained by the laws of physics to become a PIML model. Although PIMI has been employed in some AM- related studies, other types of PIML methods (i.e., PIMC, PIMO, and PIMA) have been barely used in the AM field. This gap can be addressed by developing more PIMC- , PIMA- , and PIMO- based models and evaluating the accuracy of these models and the data size required to develop such a model in the AM field. This review paper refers interested readers to Ref. [39] for more details regarding these types of PIML methods, and the details are not repeated here. In supervised learning ML algorithms, the data are labeled, and the problems are categorized into classification and regression [166] methods. In the classification method, a model is trained to identify to which category the new data belong (categorical variables), while the regression approach is used to predict the numeric value of a target. Depending on the type of the problem (i.e., classification or regression), a supervised learning model is employed. However, there is no rule, specifying which model performs better in a certain problem, as each of these models may perform differently from one problem to another. The application of these methods in machine learning is discussed in the following sections.",
    "summary": "3.1. Supervised learning - Part 7/7",
    "size": 1751
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-36",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "3.1.1.1. Conventional models. ML- driven regression models seek to predict the variables of interest by finding statistical correlations between these variables and the input parameters at the expense of the laws of nature. These non- mechanistic ML- driven regression models are not constrained by the laws of physics. They do not require a large computational cost imposed by complex physics, such as the laser- powder interaction, fluid dynamics, heat transfer, laser energy distribution, etc. Also, oversimplified assumptions (e.g., neglecting the heat loss caused by substrate and powder reflection) introduced in the FEM models [58] are not reflected in the ML- driven regression models. More importantly, all physical phenomena that occurred during data gathering are translated to the ML model, which increase the prediction accuracy regardless of throwing light on these laws of nature.\n\nTo improve the accuracy of these ML- driven regression models, the number of input parameters is significant. The more relevant input parameters are entered into the model, the more accurate the model would be. However, covering more input parameters requires a larger dataset, which is hardly obtainable in the AM field. Selecting the most significant input parameters is one way to reduce the data size required for developing an ML- driven regression model, which was employed by Ye et al. [208]. They implemented Spearman's rank correlation [209] to select the most significant input parameters, consisting of the processing parameters (static) with the features extracted from the in- situ melt pool images to develop a semi- dynamic ML model with a small data size to predict the melt pool depth and height as summarized in Fig. 16.",
    "summary": "3.1.1. Regression - Part 1/9",
    "size": 1735
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-37",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Accessing a large dataset is a key parameter in accurately predicting the response in ML. In a study by Akbari et al. [101] a quite large experimental dataset has been collected from over 80 AM articles, including several processing conditions, material properties,\n\n![](images/3acea9fa930f9f708ceed6a8a91bb816bcbc3bd995dcbdb0c4365f89f90238bd.jpg)  \nFig. 16. Schematic description of workflow applied in a study by Ye et al. [208].",
    "summary": "3.1.1. Regression - Part 2/9",
    "size": 431
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-38",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "melt pool dimensions, and flaw types. This benchmark was then used to develop several ML- driven regression and ML- driven classification models to predict the melt pool dimensions and flaw type, respectively, as indicated in Fig. 17. They also compared the performance of these models and the sensitivity of the models to the data size. Using the random forest, logistic regression, and neural network models, they visualized the decision boundaries for the dataset obtained from printing parts using Ti- 6Al- 4 V powder at different power and velocity values. They also used the confusion matrix to visualize the performance of the random forest model for different baseline plus absorptivity coefficients in Fig. 18. Although this large dataset could help cover several input parameters, many other input parameters are still missing, and also a limited range could be covered for each parameter compared to the big picture of AM. Generating a large dataset is not the only issue for developing an ML model, labeling this large dataset is also time- consuming and laborious. To obviate the labeling problem, in- situ data could be labeled using the ex- situ data in some cases, and then in- situ data could be employed to train a supervised machine learning model that can predict the final properties of the 3D- printed part on- the- fly. This approach was tested by Yuan et al. [210] to label in- situ video clips using the ex- situ height map analysis algorithm. The labeled in- situ data were then used to train a CNN model employed to predict the melt pool width, standard deviation, and track continuity.",
    "summary": "3.1.1. Regression - Part 3/9",
    "size": 1613
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-39",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Chowdhury and Anand [211] simulated the deformation of a 3D- printed part for a defined set of process parameters using a thermo- mechanical FEA model. The deformation and preprocessing data were used from the CAD model to create a dataset for training an ANN model. The ANN model learned the direction and magnitude of thermal deformation in each region of a 3D- printed part and was later used to generate a modified geometry, which is capable of compensating for the thermal effects induced in the part during the AM process. The model developed in their study was not validated by experimental data. Developing a more comprehensive FEA model validated by experimental data to predict and modify the thermal shrinkage and thermal deformation could be a good continuation of this work. With all issues mentioned here regarding preparing a dataset suitable for developing an ML model in mind, it seems that developing a PIML model is more important than preparing a large dataset due to the many benefits of the PIML models mentioned earlier.",
    "summary": "3.1.1. Regression - Part 4/9",
    "size": 1043
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-40",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "3.1.1.2. Physics- informed models. To make the ML- driven regression models physics- informed, domain- specific knowledge and/or domain- specific constraints are required. Employing physics- based models that are iterative in nature (e.g., finite element methods) could be one alternative combined with data- driven ML models to generate PIML models. Employing a finite element model validated by experimental data to predict the temperature field and produce the data required to train an ML model is an example of a physics- informed ML- driven regression model employed by Pham et al. [212] and Fetni et al. [213] for a two- dimensional simulation and Roy et al. [214] for a three- dimensional fused filament fabrication (FFF) simulation indicated in Fig. 19. These models proposed a set of distance- based features by considering the characteristics of the thermal processes and built a PIML model, which requires a smaller data size or is capable of covering a larger domain compared with previously proposed conventional ML models [64,58,215] based on temporal information that is critical in making the model PIML- driven, as this information cannot be captured from in- situ temperature data alone. It is worth mentioning that laws of physics are employed in the PIML models to cover the missing information, which cannot be captured using experiments, and experiments are employed along with laws of physics to justify and cover the assumptions that simplify the physics- informed models (e.g., constant thermophysical properties, sophisticated effects of microstructure, etc.). An ML model cannot be called physics- informed in the absence of one of these main components. For instance, the proposed data- driven methods by Mozaffar et al. [64] and Ren et al. [216] were not demonstrated on real- time experimental data and were hardly",
    "summary": "3.1.1. Regression - Part 5/9",
    "size": 1845
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-41",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "![](images/95197c139c87aa226643f4062f242a6d5220e7e1467ff2580bda39e46a648516.jpg)  \nFig. 17. Schematic description of workflow applied in a study by Akbari et al. [101].\n\n![](images/e3b3ca971ad7267841b843cf00d360617293d7c83e4dc8d6a5af9addeefd34cf.jpg)  \nFig. 18. Classification decision boundaries of the dataset based on power and velocity for (a) random forest model, (b) logistic regression model, (c) Neural Network model. Confusion matrix for the classification task for random forest classifier with baseline plus absorptivity coefficient (d) 1, (e) 2, (f) with baseline plus both absorptivity coefficients and hatch spacing as features in a study by Akbari et al. [101].\n\n![](images/921138431cbe16481117d6491fea7613f4b7e57715a4de0fc26f15a4dddc7971.jpg)  \nFig. 18. Workflow of surrogate model construction [214].",
    "summary": "3.1.1. Regression - Part 6/9",
    "size": 817
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-42",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "convinceable to consider them as physics- informed ML models, as laws of physics should be an assistive tool, constraining the domain under study. This point was clearly indicated in a study by Ren and Wang [217] by developing Gaussian process regression models to predict the melt pool volume using a simulated dataset, an experimental dataset, and a mix of the simulated and experimental datasets. They indicated that the melt pool volume suddenly had a large overshoot due to heat accumulation as depicted in Fig. 20. This large melt pool overshoot was controlled by significantly reducing the laser power of the second and the subsequent tracks. Then, the physics- informed Gaussian process regression model was used to predict this dynamic evolution of the melt pool, as depicted in Fig. 20. It was also found that the model performance can be improved by mixing the numerical and experimental datasets when the experimental data size is not large enough, as the high- fidelity simulated dataset, even though subject to errors, at least can catch the trend of the real- time experimental data. This helps achieve a PIML model with a limited number of experimental data, which could be employed to accurately predict the melt pool size.\n\nTo reduce the dependency on a large number of datasets, Zhu et al. [218] introduced a PIMT model, a physics- informed neural network (PINN) model, that incorporates both data and fundamental principles of physics (i.e., continuity, momentum, and energy governing equations) into a deep neural network to inform the training processes. To do this, the loss function used in conventional deep neural networks to measure the model performance against ground truth values was modified by these laws of physics, which were often expressed as a set of PDEs with appropriate initial and boundary conditions, and was penalized by the residuals of the",
    "summary": "3.1.1. Regression - Part 7/9",
    "size": 1884
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-43",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "![](images/f13346566f7c81e79a139ab270ec22d7f97cb364392546510b9bbbb63a087a71.jpg)  \nFig. 20. Control performance for a six-track with length  $= 20mm$  under the laser scan speed of  $600mm / s$  [217].\n\nNavier- Stokes and energy conservation equations on a set of collocation points. They demonstrated that their PINN model is capable of predicting temperature and melt pool dynamics using a moderate number of labeled datasets, as depicted in Fig. 21. However, the model developed in their study was oversimplified and did not reflect the complexity of metal AM processes, as free- surface deformation of the melt pool, evaporation phenomenon, and ambient gas phase were not considered in the developed PIMT model. Employing multi- phase Navier- Stokes equations modified by missing phenomena (e.g., evaporation) to capture the heat loss, liquid fraction change, and fluid motion and applying additional PDEs (e.g., convection equation of level set and volume of fluid approach) used in the previous studies [219,220] could be a great continuation of Zhu et al. study [218].\n\n![](images/11b364d5072e2bb59e46dc507bdc74e601958bf4ff4274e562069abe3d410649.jpg)  \nFig. 21. Comparison of the predictions of the temperature and melt pool fluid dynamics of FEM, physics-informed neural network, and experiment (laser power of 195W and scanning speed of  $0.8m / s$  at quasi-steady state. [218].",
    "summary": "3.1.1. Regression - Part 8/9",
    "size": 1388
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-44",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Selecting the scanning strategy based on the previous thermal history may not be practical from in- situ data alone. However, physics- informed models could assist to make it possible. Ren et al. [221] developed a PIMI model using an FE model to map the temperature field and scanning pattern traced for material deposition for every unit of the simulation step, as depicted in Fig. 22. Extracting this time- sensitive deposition information was critical in making a PIMI model, as this model is not easily achievable from in- situ temperature data alone. In another study [162], the same authors employed an RNN approach for developing a PIMI model to predict the thermal distribution of the next layer using the thermal field of two previous deposited layers and the candidate scan strategy. The temperature distribution predicted using the PIMI model is further employed to select the most suitable scan strategy for the next layer, which minimizes the local heat accumulation during the deposition. The process continues until the fabrication is complete.",
    "summary": "3.1.1. Regression - Part 9/9",
    "size": 1059
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-45",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "3.1.2.1. Conventional models. ML classification approaches have been mainly used to detect defects and anomalies in the AM field. Mahmoudi et al. [222] developed a system to detect printing process deviations by capturing the in- situ thermal field of melt pools during fabrication. As depicted in Fig. 23, a similar approach was taken in a study by Seifi et al. [223] to detect the thermal- defect relationship in real- time manufacturing, as there is a direct relationship between the thermal history of the 3D- printed part and its microstructure. To identify this relationship, the highly dynamic thermophysical AM process captured by a pyrometer camera during manufacturing was characterized by developing a tensor- based modeling approach. The key layerwise signature features were extracted from the melt pool images by multilinear principal component analysis (MPCA) and these features were employed to predict the overall quality of the deposited layers using an SVM classifier.",
    "summary": "3.1.2. Classification - Part 1/16",
    "size": 987
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-46",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Acoustic emission was also used as the input of an LR model to detect two types of primary defects (i.e., crack and porosity) in a study by Gaja et al. [224]. The results showed the high potential capability of acoustic emission for assessing the overall deposition quality and identifying defects, as indicated in Fig. 24. Although the models developed in Gaja et al. study [224] revealed a promising accuracy in detecting defects, their model should be further extended to cover other types of defects, such as balling, lack- of- fusion, etc. To do this, the LR model employed by Gaja et al. [224] may not be capable to be used in non- binary classification tasks with more than two labels. Thus, this model is not suggested for classification problems. CNN model could be a proper alternative employed in a study by Shevchik et al. [225] to classify the quality of 3D- printed parts into poor, medium, and high through linking acoustic emission of the parts printed at different processing parameters to their qualities. They also used spectral convolutional neural networks (SCNN) [189,226], a recent extension of CNN, to develop a model and compared the accuracy of their CNNs and SCNNs models together. These efforts were also further extended by Ye et al. [227] to link acoustic emission to five different melt states (i.e., underheating, medium\n\n![](images/b8455175be532741761557de0bbf77f83b6b54c60aed8bf62867595d12659f59.jpg)  \nFig. 22. Applying RNN-DNN model to predict thermal history [221].\n\n![](images/42e2a87beb9504c13dfe17bf3dea21c1d9a6ad707fa9352dc3fcb3e072a2237d.jpg)  \nFig. 23. (a) A general overview of parameter selection using cross-validation (b) the part with an unhealthy layer, which includes pores, and (c) one iteration of cross-validation in a study by Seifi et al. [223].\n\n![](images/b197ff926ebdda849e3b89537401bd53fd0e5b3aa024f3d3a2df62e0960d9df9.jpg)  \nFig. 24. Developing ANN model using acoustic emissions in a study by Gaja et al. [224].",
    "summary": "3.1.2. Classification - Part 2/16",
    "size": 1972
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-47",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "underheating, normal, medium overheating, and overheating) formed at different processing parameters using an SVM model. The results showed a fairly high accuracy if all the acoustic emission features are used, and no PCA or FDA dimensionality reduction is conducted for data dimensionality reduction, as these dimensionality reduction methods worked more like a feature extraction method rather than real feature selection in their study.\n\nLinking the morphology of the 3D- printed parts to the defect formation is another way to evaluate the overall quality of deposited layers. Gobert et al. [228] used SVM to detect defects on a staircase cylinder by labeling different defects (i.e., porosity, incomplete fusion, crack, or inclusion). To develop such a model, multiple images were collected at each printed layer and multi- dimensional visual features were extracted and evaluated using a binary classification technique. The regions were then categorized as either a",
    "summary": "3.1.2. Classification - Part 3/16",
    "size": 972
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-48",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "defect or a nominal build condition. The true location of the defects and nominal build areas were then obtained using a CT scan [47], which was then transferred into a layerwise image domain and fed into the classifiers. These steps are indicated in a flowchart in Fig. 25. Khanzadeh et al. [16] developed an ML framework to establish a relationship between the melt pool morphological characteristics and defects in the microstructure, as indicated in Fig. 26. They employed thermal images to find the melt pool profile and functional principal component analysis to extract the critical features of the melt pools, which are responsible for the majority of the variations in the melt pool. They then used this information to train different ML models (i.e., KNN, SVM, DT, DA), predict defects in the AM parts, and compare the accuracy of these models using the highest rate of accurately classifying melt pools  $(M_{1})$  and lowest rate for incorrectly identifying normal melt pools as pores  $(M_{2})$  as listed in Table 2. Similarly, the type and severity of porosity have been linked to physically intuitive process signatures (i.e., melt pool length, temperature gradient, and ejecta or spatter characteristics), which were extracted from melt pool images, using relatively simple ML models (KNN, LR, and SVM) in a study by Smoqi et al. [229]. The accuracy of these models was then compared with a more complex ML model (i.e., CNN), which directly used raw melt pool images. This procedure was indicated in Fig. 27. The results indicated that the relatively simple ML models trained with pragmatic physically informed melt pool shapes are as effective for defect prediction as using a complex CNN model. In another study [230], a dense convolution network (DenseNet) model was selected among four different models (i.e.",
    "summary": "3.1.2. Classification - Part 4/16",
    "size": 1829
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-49",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": ", AlexNet, GoogLeNet, ResNet, DenseNet) due to better distinguishing information than other models to predict the relationship between the melt pool shape and melt pool states (i.e., normal melting, incomplete melting, and discontinuity melting states) as depicted in Fig. 28. CNN was also employed to classify the melt pool size, which helps detect irregular melt pool formation, without considering spattering using in- situ melt pool monitoring in a study by Yang et al. [231] and detected defects in 3D- printed parts by processing the geometrical anomalies in a study by Khan et al. [232]. The model developed in the latter study integrated the concepts of image processing- computer vision and machine learning and evaluated the effect of various parameters (i.e., input size, batch size, validation split, class mode, activation function, optimizer, steps per epoch, number of epochs), affecting the accuracy of the model as depicted in Fig. 29. Similar to all other conventional data- driven methods, their model requires a large dataset and can be further optimized by enabling defect detection in the vertical plane and by classifying the cause of the defects. In detection and classification problems, CNN is the most common approach widely used in the AM field [233].",
    "summary": "3.1.2. Classification - Part 5/16",
    "size": 1279
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-50",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "In another attempt [234], the layerwise optical images of the powder bed fusion were obtained during manufacturing. Theoretical and multifractal features were extracted during layer- by- layer deposition from each image and linked to the process parameters using several ML classifiers (i.e., SVM, complex tree, LDA, KNN, bagged trees, and ANN) to identify the effect of these parameters on the porosity formation. Also, the ANNs approach was used to find the relationship between the beam power, melt pool shapes, and flaws [235]. Similar to regression problems, linking processing parameters to the parameters, determining the quality of the 3D- printed parts requires a large dataset. Preparing a large dataset mined from a large number of publications is one solution, which was employed by Hertlein et al. [236]. They employed a Bayesian network to link laser power, scan speed, hatch space, and layer thickness to relative\n\n![](images/7958a31e0814f5348458efd194b8d8934051dc3ebb9471096725326e16960367.jpg)  \nFig. 25. Flowchart of the steps taken for discontinuity detection in a study by Gobert et al. [228].\n\n![](images/543de2ae34a28353b04b321a7a710852abc9ac27d4736dd978991d52c2663fe7.jpg)  \nFig. 26. Demonstration of porosity prediction procedure using supervised ML [16].\n\ndensity, hardness, ultimate tensile strength in two directions, and surface roughness. Creating a large dataset may help to cover more input parameters, but many other significant input parameters (e.g., laser type, spot size, powder diameter, preheating, etc.) are still missing.",
    "summary": "3.1.2. Classification - Part 6/16",
    "size": 1561
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-51",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "In defect detection problems, linking process conditions to defects, the first step toward in- process quality assurance, is significant. The model trained with melt pool dimensions may be able to accurately classify the melt pool state. However, considering the melt pool images as the input parameters rather than the processing parameters is quite time- consuming and costly, as extra steps are added to prepare these micrographs. It is also worth mentioning that although physically meaningful inputs (e.g., temperature distribution, the morphology of melt pool) are used as the inputs of these relatively simple ML models, the temptation of calling these models PIML should be rejected, as these models reviewed above are not constrained by laws of physics.",
    "summary": "3.1.2. Classification - Part 7/16",
    "size": 762
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-52",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "3.1.2.2. Physics- informed Models. The ML models developed earlier for classification problems are well known for their exemplary performance to learn complex process- property correlations. However, these models are limited to machine settings and ignore the physical laws of the problem. If the machine, components, or range of processing parameters change, the dominant laws of physics may change due to these changes, and consequently, these models fail. In classification problems, developing PIML models is an appropriate solution to obviate such a problem using ML models, which are employed more often in recent publications. In a study by Liu et al. [237], porosity sizes categorized into three levels (i.e., pass, flag, and fail) were correlated with the laser- related physical effects instead of machine setting parameters using six different ML models. The accuracy of the PIML model developed in their study was compared with the accuracy of an ML model that directly used machine setting parameters. They concluded that the ML model developed using the machine setting parameters has nearly the same performance as the PIML model, as depicted in Fig. 30. However, the PIML model does not rely on the machine setting and can be applied to predict quality in different machines and settings.\n\nMechanistic input parameters predicting balling defect [238,239] using 6 out of 10 most important processing parameters and material properties is a good example of the PIML model employed by Du et al. [240] summarized in Fig. 31. Also, the thermal history of an AM part was predicted from the datasets containing generic and engineered features constructed based on the physics of the underlying thermal process using an extremely randomized tree model in a study conducted by Ness et al. [241]. In their work, the\n\nTable 2 The relationship between the model, data, and accuracy.  ",
    "summary": "3.1.2. Classification - Part 8/16",
    "size": 1888
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-53",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "<table><tr><td>Reference</td><td>Model</td><td>Data size</td><td>Accuracy</td></tr><tr><td rowspan=\"4\">Ren et al.[221]</td><td>DNN</td><td>47152</td><td>94.15%</td></tr><tr><td>CNN</td><td></td><td>75.4%</td></tr><tr><td>RNN</td><td></td><td>94.84%</td></tr><tr><td>DNN-RNN</td><td></td><td>98.09%</td></tr><tr><td>Ren et al.[162]</td><td>RNN</td><td>340</td><td>95.05%</td></tr><tr><td>Khanzadeh et al. [62]</td><td>SOM</td><td>1564</td><td>96 %</td></tr><tr><td rowspan=\"5\">Khanzadeh et al.[16]</td><td>QDA</td><td>2800</td><td>M1= 98.21, M2= 1.79%</td></tr><tr><td>LDA</td><td></td><td>M1= 71.15%, M2= 0.1%</td></tr><tr><td>DT</td><td></td><td>M1= 90.74%, M2= 0.3%</td></tr><tr><td>SVM</td><td></td><td>M1= 90.96%, M2= 0.35%</td></tr><tr><td>KNN</td><td></td><td>M1= 98.44%, M2= 0.19%</td></tr><tr><td rowspan=\"4\">Smoqi et al.[229]</td><td>KNN</td><td>22400</td><td>F1-score = 0.97</td></tr><tr><td>SVM</td><td></td><td>F1-score = 0.85</td></tr><tr><td>LR</td><td></td><td>F1-score = 0.83</td></tr><tr><td>CNN</td><td></td><td>F1-score = 0.94</td></tr><tr><td>Du et al.[240]</td><td>Genetic algorithm</td><td>166</td><td>90%</td></tr><tr><td>Pham et al.[212]</td><td>FFNN</td><td>19.9 million</td><td>99%</td></tr><tr><td>Fetni et al.[213]</td><td>ANN</td><td>4 million</td><td>99%</td></tr><tr><td>Roy et al.[214]</td><td>ANN</td><td>26000 (training)</td><td>Error &amp;lt; 5%</td></tr><tr><td rowspan=\"2\">Ren et al.[217]</td><td rowspan=\"2\">GPR</td><td>data numerical = 8010</td><td>RMSE largest = 0.006mm²</td></tr><tr><td>data experimental = 64</td><td>RMSE largest = 0.0095mm²</td></tr><tr><td>Yang et al.[231]</td><td>CNN</td><td>5689</td><td>91%</td></tr><tr><td>Kwon et al.[235]</td><td>ANN</td><td>13200</td><td>Error = 1.1%</td></tr><tr><td rowspan=\"10\">Akbari et al.[101]</td><td>RF</td><td>2200</td><td>88.41%, AUC-ROC = 98%</td></tr><tr><td>XGBoost</td><td></td><td>R²= 99.62%, MAE = 10.92</td></tr><tr><td>NN</td><td></td><td>R²= 95.8%, MAE = 20.",
    "summary": "3.1.2. Classification - Part 9/16",
    "size": 1963
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-54",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "54</td></tr><tr><td>GPR, SVM, LR, GB, Lasso, Ridge</td><td></td><td></td></tr><tr><td>Lasso</td><td></td><td>Average Rank = 7</td></tr><tr><td>Ridge</td><td></td><td>Average Rank = 8</td></tr><tr><td>ElasticNet</td><td></td><td>Average Rank = 7</td></tr><tr><td>SVR</td><td></td><td>Average Rank = 3.7</td></tr><tr><td>KNN</td><td></td><td>Average Rank = 6</td></tr><tr><td>ANN</td><td></td><td>Average Rank = 2</td></tr><tr><td>Yuan et al.[230]</td><td>DenseNet</td><td>80</td><td>99.3%</td></tr><tr><td rowspan=\"2\">Gaja et al.[224]</td><td>LR</td><td>37</td><td>MSE = 1.72</td></tr><tr><td>ANN</td><td></td><td>MSE = 1.70</td></tr><tr><td>Ye et al.[227]</td><td>SVM</td><td>34</td><td>77.99%</td></tr><tr><td>Hertlein et al.[236]</td><td>BN</td><td>349</td><td>-</td></tr><tr><td>Liu et al.[237]</td><td>LR, GPR, SVR</td><td>549</td><td>Error = 10–26%</td></tr><tr><td>Ren et al.[247]</td><td>KMC, LSTM-Autoencoder</td><td>4290</td><td>MSE LSTM-encoder = 6.9 × 10-4</td></tr><tr><td>Ye et al.[248]</td><td>DBN</td><td>+ 18000</td><td>95.93%</td></tr><tr><td>Ye et al.[249]</td><td>DBN</td><td>-</td><td>83.4%</td></tr><tr><td>Okaro et al.[250]</td><td>GMM</td><td>49</td><td>77%</td></tr><tr><td rowspan=\"2\">Yuan et al.\n\ndomain knowledge provided the laws of physics and made the model PIMI that corrects, enriches, and enhances the data. They demonstrated that simulation- to- simulation predictions are possible with high accuracy for the transferability of thermal histories between a variety of patterns, geometries, meshes, and power intensities, which proves the potential of PIMI in AM. A summary of the supervised models reviewed here is listed in Table 3.",
    "summary": "3.1.2. Classification - Part 10/16",
    "size": 1666
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-55",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "In addition to the resource- intensive nature of conventional ML models, the latency of detection and poor generalizability are common drawbacks of applying these models in the AM field [242- 244]. The data recorded continuously using heterogeneous sensors need to be transferred to a data analysis procedure, which causes an inherent latency during data analysis. Also, data- driven approaches developed using simple geometries (e.g., cubes and cylinders) may not be generalizable to complex, practical AM parts. One way to resolve these issues in the classification problem is to employ a PIML approach. A PIML model was developed by twinning in- situ melt pool temperature measurements with a mechanistic- based thermal model, predicting the thermal history of the part updated layer- by- layer to detect flaw formation in a study conducted by Yavari et al. [245]. Facilitating precise and interpretable detection of flaws and obviating the need of transferring sensor signatures to a separate data analysis algorithm, which leads to precluding the inherent latency in data- driven flaw detection, are the key outcome of employing the PIML model.\n\nAnother significant research thrust in AM is to develop online ML methods for in- situ monitoring of the AM processes and link these data to a feedback control system that adjusts experimental parameters on the fly. Developing models capturing the complexity of AM processes is now achievable through the use of high- performance computers. However, taking these data into the production environment is still a challenge, which can be achieved by leveraging both numerical and experimental data from a structured database. Developing online PIML models by a combination of numerical and experimental data suggested by Yan et al. [220] may be a great\n\n![](images/c0d84ead30fbdaf9cd4ef6a2ab36e61470aff835382f0ef1ee90ec27d37953e1.jpg)  \nFig. 27. Schematic representation of data processing and machine learning approach used in Smoqi et al. [229] work.",
    "summary": "3.1.2. Classification - Part 11/16",
    "size": 2000
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-56",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "![](images/661b2efe887b079afb43a50f20fbff57aade558e1116b28217230ae8f1c5a847.jpg)  \nFig. 28. The proposed in-situ monitoring method by Yuan et al. [230].\n\nsolution to online monitoring of the AM processes and modifying them based on the live feedback collected during the process, as indicated in Fig. 32. Towards developing such a framework, online ML models have been developed to rapidly detect surface defects by developing an in- situ point cloud processing that enables live surface monitoring with no need for sensor intermittence [246].\n\n![](images/03beb0846a7331913767274352f7c3975c950779052748c49ae837c15d0a2e80.jpg)  \nFig. 29. Structure of CNN code employed in a study by Khan et al. [232].\n\n![](images/cec1bd18dd788f390f8861869db809c5d85b20b610f5a4f17a03df82a106b4c2.jpg)  \nFig. 30. Summary of developing ML and PIML models in a study by Liu et al. [237] work.\n\nHowever, involving more physical phenomena in the problem by including micro- scale models (e.g., electron or photon material interactions causing heat generation), mesoscale models (e.g., individual power particle evolution driven by fluid flow and thermal diffusion, surface tension force, Marangoni effect), and macro- scale models (e.g., FEA codes to resolve the fabrication process of a complex product) could further improve the performance of the model toward developing online PIML models.\n\n![](images/8bed8264e390ea9066be83c1080570763d82879fdc85dc87b809dd85228acaa7.jpg)  \nFig. 31. Schematic representation of the approach proposed and used in Du et al. [240] work.\n\nTable 3 Supervised learning.  ",
    "summary": "3.1.2. Classification - Part 12/16",
    "size": 1579
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-57",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "<table><tr><td>Reference</td><td>AM process</td><td>Materials</td><td>Input</td><td>Output</td><td>ML method</td></tr><tr><td>Rong-Ji et al. [119]</td><td>SLS</td><td>-</td><td>Lt, BP, h, v, tS, Ts, F</td><td>Material shrinkage</td><td>ANNs</td></tr><tr><td>Tran et al. [252]</td><td>SLM</td><td>SS316L</td><td>BP, v, LSS, Lt, PM, PSD</td><td>Depth of melt pool</td><td>ANNs</td></tr><tr><td>Lee et al. [122]</td><td>SLM</td><td>alloy 625, 718</td><td>BP, v, LSS, Lt, PSD</td><td>MP dimensions</td><td>Br, Kr, LR, NN, RF SVM</td></tr><tr><td>Schmid et al. [253]</td><td>SLM</td><td>AlS-10Mg</td><td>BP, v, h</td><td>MP dimensions</td><td>CNNs</td></tr><tr><td>Chen et al. [254]</td><td>SLM</td><td>TIBt, AlAl10Mg</td><td>BP, v</td><td>MP dimensions</td><td>ANNs</td></tr><tr><td>Meng and Zhang [255]</td><td>SLM</td><td>SS316L</td><td>BP, v</td><td>Remelted depth</td><td>GP</td></tr><tr><td>Tapia [100]</td><td>SLM</td><td>SS17-4 PH</td><td>BP, v</td><td>Porosity, ρ</td><td>GP</td></tr><tr><td>Olleak and Xi [59]</td><td>SLM</td><td>Ti-Al- 4v Alloy</td><td>BP, v, η, LSS</td><td>MP</td><td></td></tr><tr><td>dimensions</td><td>GP, FEM</td><td></td><td></td><td></td><td></td></tr><tr><td>Kamath [29]</td><td>SLM</td><td>SS316L</td><td>BP, v, η, LSS</td><td>Depth of MP</td><td>GP, MT</td></tr><tr><td>Mozaffar [64]</td><td>DED</td><td>SS316L</td><td>BP, v, tS, GS, S</td><td>Thermal history</td><td>RNN</td></tr><tr><td>Zhang [58]</td><td>DED</td><td>Nickel-718</td><td>BP, v, Tt, Lt, lw</td><td>Thermal history</td><td>xGBoost, LSTM</td></tr><tr><td>Singh et al. [256]</td><td>SLM</td><td>Bronze</td><td>BP, v, h</td><td>ρ</td><td>MLP</td></tr><tr><td>Tapia et al. [257]</td><td>SLM</td><td>SS316L</td><td>BP, v</td><td>Depth of MP</td><td>GP</td></tr><tr><td>Caiazzo and Caggiano [258]</td><td>DED</td><td>2020 Al alloy</td><td>BP, v, PFR</td><td>MP dimensions</td><td>ANNs</td></tr><tr><td>Lu et al.",
    "summary": "3.1.2. Classification - Part 13/16",
    "size": 1904
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-58",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " [259]</td><td>DED</td><td>SS316</td><td>BP, v PFR</td><td>Depositionheight</td><td>ANNs, LS-SVM</td></tr><tr><td>Aoyagi et al. [27]</td><td>EBM</td><td>COCr</td><td>BP, v</td><td>Porosity</td><td>SVM</td></tr><tr><td>Khanzadeh et al. [16]</td><td>DED</td><td>Ti-Al-4 V</td><td>Thermal history</td><td>Porosity</td><td>DT, KNN, SVM, DA</td></tr><tr><td>Jafari-Mardani et al. [260]</td><td>DED</td><td>Ti-Al-4 V</td><td>Thermal history</td><td>Porosity</td><td>KNN, NN, SOEDNN</td></tr><tr><td>Kappes et al. [261]</td><td>SLM</td><td>Inconel 718</td><td>PP, PO, FRP</td><td>Porosity</td><td>RFN</td></tr><tr><td>Ren et al. [221]</td><td>DED</td><td>-</td><td>TS, tS, geometry shape</td><td>Thermal history</td><td>RNN-DNN</td></tr><tr><td>Ren et al. [162]</td><td>DED</td><td>SS316L</td><td>TS</td><td>Thermal history</td><td>RNN</td></tr><tr><td>Smooij et al. [229]</td><td>SLM</td><td>AT3 718Plus</td><td>MP dimensions, T</td><td>Porosity</td><td>KNN, SVM, LR, CNN</td></tr><tr><td>Pham et al. [212]</td><td>DED</td><td>M4 high speed steel</td><td>BP, t</td><td>Thermal history</td><td>FFNN</td></tr><tr><td>Fetni et al. [213]</td><td>DED</td><td>316L SS</td><td>x,y,t,xL,yL,dL,dy</td><td>Thermal history</td><td>FFNN</td></tr><tr><td>Roy et al. [214]</td><td>FFF</td><td></td><td>d,Lg</td><td>Thermal history</td><td>ANN</td></tr><tr><td>Ren et al. [217]</td><td>SLM</td><td>Inconel 625</td><td>BP, Thermal history</td><td>MP dimensions</td><td>GPR</td></tr><tr><td>Zhu et al. [218]</td><td>SLM</td><td>Inconel 625</td><td>BP, v</td><td>MP dimensions, Thermal history</td><td>NN</td></tr><tr><td>Yang et al. [231]</td><td>SLM</td><td>Inconel 625</td><td>TS</td><td>MP dimensions</td><td>CNN</td></tr><tr><td>Kwon et al. [235]</td><td>SLM</td><td>SUS316L</td><td>MP images</td><td>ρ</td><td>ANN</td></tr><tr><td>Ye et al. [208]</td><td>DED</td><td>SS316</td><td>BP, v, PFR, W, T</td><td>MP depth and height</td><td>ANN</td></tr><tr><td>Yuan et al.",
    "summary": "3.1.2. Classification - Part 14/16",
    "size": 1948
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-59",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " [230]</td><td>DED</td><td>SS316</td><td>Melt pool shapes</td><td>MP state detection</td><td>DenseNet</td></tr><tr><td>Mahmoudi et al. [222]</td><td>LPBF</td><td>SS</td><td>Thermal history</td><td>Anamoly detection</td><td>GP</td></tr><tr><td>Gaja et al. [224]</td><td>LMD</td><td>Ti-Al-4 V</td><td>Acoustic emissions</td><td>Defect detection</td><td>LR, ANN</td></tr><tr><td>Gobert et al. [228]</td><td>SLM</td><td>SS GP-1</td><td>Layerwise optical images</td><td>Defect detection</td><td>SVM</td></tr><tr><td>Seifi et al. [223]</td><td>DED</td><td>Ti-Al-4 V</td><td>Thermal history</td><td>Anamoly detection</td><td>SVM</td></tr><tr><td>Ye et al. [227]</td><td>SLM</td><td>SS 104L</td><td>Acoustic emissions</td><td>Defect detection</td><td>SVM</td></tr><tr><td>Hertlein et al. [236]</td><td>SLM</td><td>316L</td><td>P, V, h, Lt</td><td>ρ, hardness, roughness, ultimate tensile strength</td><td>BN</td></tr><tr><td>Shevchik et al. [225]</td><td>SLM</td><td>SS 116L</td><td>Acoustic emissions</td><td>Anamoly detection</td><td>CNNs, SCNNs</td></tr><tr><td>Liu et al.",
    "summary": "3.1.2. Classification - Part 15/16",
    "size": 1067
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-60",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Powder layer thickness  $(l_{t})$  , beam power  $(BP)$  , melt pool width  $(W)$  distance (d), hatch spacing  $(h)$  , length of geometry  $(L_{g})$  scan speed  $(\\nu)$  , interval time  $(t_{s})$  surroundings temperature  $(T_{s})$  Temperature  $(T)$  and scanning mode  $(F)$  , laser spot size (LSS), laser type (LT), powder material (PM), powder size distribution (PSD), depth of melt pool (DMP), remelted depth (RD), melt pool dimensions (MPD), material shrinkage (MS), crosssectional bead image (CSI), Pressure intensity PI), laser radiation (LR), absorptivity  $(\\eta)$  ,toolpath strategy (TS), geometric size (GS), geometric shape (S), spread of the ejecta (SE), layer width  $(l_{w})$  , density  $(\\rho)$  , wire/powder feed rate (P/WFR), arcvoltage (AV), nozzle to plate distance (NPD), Energy density  $(E)$  part position (PP), part orientation (PO), fraction recycled powder (FRP), laser position  $(x_{L},y_{L})$",
    "summary": "3.1.2. Classification - Part 16/16",
    "size": 933
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-61",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Unsupervised learning is employed to identify underlying patterns in the input data [166] with minimal human supervision. Developing in- situ monitoring technologies is critical for better understanding defect formation, assessing the process performance, and assuring the quality, integrity, and safety of AM parts. Unsupervised learning methods along with in- process monitoring provide the capability of early detection of defect formation. Unsupervised learning eliminates the need for person- hours to label the data, but this approach may still need classification after clustering. Table 4 summarized a list of unsupervised ML algorithms used for detecting defects using data clustering.\n\n![](images/0ea23377f184fbc7d16c22a47546a42a62d58630a534fb60b18eb6bdf7dee8cf.jpg)  \nFig. 32. Framework for achieving high-performance parts using online PIML methods suggest by Yan et al. [220].\n\nTable 4 Unsupervised learning.  ",
    "summary": "3.2. Unsupervised learning - Part 1/2",
    "size": 923
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-62",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "<table><tr><td>Reference</td><td>AM process</td><td>Materials</td><td>Input</td><td>Output</td><td>MI method</td></tr><tr><td>Donegan et al. [285]</td><td>SLM</td><td>Ti-6Al-4</td><td>Thermal history</td><td>Process history</td><td>KMC</td></tr><tr><td>Tan et al. [286]</td><td>SLS</td><td>-</td><td>IR images</td><td>Anamoly detection</td><td>EDS</td></tr><tr><td>Scime and Beuth [49]</td><td>SLM</td><td>Inconel 718</td><td>IR images</td><td>Anamoly detection</td><td>KMC</td></tr><tr><td>Scime and Beuth [279]</td><td>SLM</td><td>-</td><td>powder bed images</td><td>Anamoly detection</td><td>KMC</td></tr><tr><td>Wu et al. [200]</td><td>-</td><td>-</td><td>Optical image</td><td>Anamoly detection</td><td>Not specified</td></tr><tr><td>Pagan et al. [287]</td><td>-</td><td>IN625</td><td>Diffraction images</td><td>Anamoly detection</td><td>LLE</td></tr><tr><td>Grasso et al. [273]</td><td>SLM</td><td>AISI</td><td>Optical images</td><td>Defect detection</td><td>PCA</td></tr><tr><td>Khanzadeh et al. [62]</td><td>DED</td><td>Ti-6Al-4 V</td><td>Thermal history</td><td>Porosity</td><td>SOM</td></tr><tr><td>Scime and Beuth [49]</td><td>DED</td><td>Inconel 718</td><td>Thermal history</td><td>Porosity and balling</td><td>BoW</td></tr><tr><td>Senll et al. [272]</td><td>SLM</td><td>Ti-6Al-4 V, Inconel 718, Haynes 282</td><td>2D and 3D pores</td><td>Porosity type</td><td>KMC</td></tr><tr><td>Taheri et al. [265]</td><td>DED</td><td>Ti-6Al-4 V</td><td>AE</td><td>Process conditions</td><td>KMC</td></tr><tr><td>Gaja et al. [263]</td><td>DED</td><td>Ti-6Al-4 V and H13 tool steel</td><td>AE</td><td>Crack, porosity</td><td>KMC</td></tr><tr><td>Ren et al. [247]</td><td>DED</td><td>AI7075 alloy</td><td>BP, v, PFR</td><td>Porosity</td><td>KMC</td></tr><tr><td>Ye et al. [248]</td><td>SLM</td><td>SS 304</td><td>AE</td><td>Defect pattern</td><td>DBN</td></tr><tr><td>Ye et al. [249]</td><td>SLM</td><td>SS 304</td><td>NIR image</td><td>Defect pattern</td><td>DBN</td></tr><tr><td>Gracia-Moreno et al.",
    "summary": "3.2. Unsupervised learning - Part 2/2",
    "size": 1998
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-63",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "One of the significant challenges in the AM processes is the lack of a systematic classification of defects, effective characterization of process conditions during manufacturing, and the unavailability of an appropriate approach to link the variations in the processing parameters to these defects [262]. One way to evaluate the quality of the 3D- printed parts is to obtain acoustic emissions during manufacturing. In one attempt [263], the acoustic emission was recorded during layer- by- layer material deposition and the silhouette value [264] was calculated for different numbers of clusters. It was found that the largest silhouette value can be obtained if the number of clusters is set to two, which indicates two classes of defects (i.e., porosity and crack) exist in the data. Then, the KMC algorithm, which aims to minimize the distances between all the vectors of a cluster and its center and maximize the distance between the centers of the clusters, was employed to analyze the AE signals and predict the defect type, as indicated in a flowchart in Fig. 33. More defect patterns were included in a model developed by Ye et al. [248] by gathering the acoustic signals from different defect patterns (i.e., balling, slight balling, normal, slight overheating, and overheating) formed during manufacturing at various energy densities. The relationship and hierarchical information of the raw acoustic signals were extracted using this approach with no need for preprocessing and feature extraction from the signals. Taheri et al. [265] analyzed the relationship between the process conditions (i.e., normal, low powder, and powder spray process conditions) and the acoustic emissions through in- situ monitoring of the DED process and classification of acoustic emission data using KMC. Although the model can fairly accurately correlate the processing",
    "summary": "3.2.1. Clustering - Part 1/6",
    "size": 1864
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-64",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "![](images/1d3d5ee70e55ce51d9af5fd6f5f954e4b46c79fdf30ddce4ed930a54cd15aa1a.jpg)  \nFig. 33. Step-by-step operations used to perform acoustic emission analysis in a study by Gaja and Liou [263].\n\nconditions to the acoustic emissions, the lowest classification accuracy occurred at low beam power process conditions. Different behavior of acoustic patterns due to the complexity of thermal behavior could be one reason for low classification accuracy at low beam power.\n\nThe inputs used in the clustering approaches could also be in the form of spectra emissions, linking the process parameters to the quality of the 3D- printed parts. The intensity and shape of spectra emissions indicate the concentration and plasma condition are directly related to the process parameters and the quality of 3D- printed parts. For instance, the spectra emissions were collected during the manufacturing process for the parts printed at varying laser power, scan speed, and power delivery rate, and the spectra features were extracted using an LSTM- autoencoder. These features were then employed to classify the quality of the part based on the processing parameters using a KMC model [247].\n\nOne of the most popular data types used to train and develop an unsupervised ML model is optical measurements, which have been employed to collect the temperature field, image of the powder bed, and molten pool in the AM process [266,267]. The authors [248] previously developed a DBN model to detect defect type through acoustic signals and applied the same approach in another study [249] to correlate the plume and spatter near- infrared (NIR) images obtained during manufacturing with the melted state and energy density. The accuracy of the model developed using acoustic emission data in ref. [248] was reported higher than the accuracy of the model developed using the NIR images reported in ref. [249].",
    "summary": "3.2.1. Clustering - Part 2/6",
    "size": 1888
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-65",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "A convolutional autoencoder (CAE) model [268] (a subset of convolutional neural networks) and an auto decoder [269], which was often used to convert high- dimensional data obtained from images into a simplified reconstructed output, was employed in a study by Silbernagel et al. [270] to classify the quality of the 3D- printed parts produced at different processing parameters. To do this, a large number of optical images were segmented and fed into a CAE model and were clustered based on the best gap value technique using a so- called gap statistic method [271]. The clusters were manually scored to represent the lowest to the highest quality, and then these results were applied to the original images to optimize the processing parameters. Although the model indicated the potential of scoring the quality of the part and the traditional parameter optimization, disparities exist between the ML model and the traditional optimization process. This disparity could be due to the limited diversity in the data employed in the image classification.\n\nA rapid pore classification KMC model was developed using two different sources of data, namely 3D pore data collected using the XCT technique and 2D pore data collected using the optical microscopy technique by Snell [272]. The results revealed that KMC is not",
    "summary": "3.2.1. Clustering - Part 3/6",
    "size": 1316
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-66",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "suitable to analyze the 2D pore data. Although a fair starting point for 2D pore data clustering was established, more information is needed to reliably classify the data. KMC was found suitable more for analyzing 3D pores (i.e., lack- of- fusion and keyhole pores), as 3D pore data provided more information than 2D pores. KMC was also employed to automatically detect defect onset and spatially identify defects during the in- situ SLM process by identifying the molten areas with different behavior from other sections of the same layer [273]. The proposed approach considered the defects formed due to overheating and could be further extended by considering other defect scenarios. SOM, a neural network- based model (Fig. 34), was employed in a study by Gracia- Moreno [274] to develop an automatic porosity classification method based on the size, distribution, and origin of pores. Porosity formation was also predicted by Khanzadeh et al. [275,62] in the parts using the thermal profile of the melt pools. The authors basically identified pores from thermal profile images by categorizing melt pools into normal and porosity (abnormal) clusters. Porosity cluster includes the melt pools with low or high temperature and irregular shapes, as indicated in Fig. 35. They also compared the results with their previous study [276] considering morphological features of melt pools (e.g., length, width, area, etc.). They concluded that SOM clustering based on morphological features fails to properly distinguish different clusters. This means that the basic features of melt pools may not be sufficient for the identification of defects, and this detection could be performed better by considering the thermal distribution of melt pools as input. Although the authors utilized SOM to differentiate melt pool morphologies, the descriptor of the melt pool shape chosen in their studies was neither scale invariant nor capable of including spatter or vapor plume information.",
    "summary": "3.2.1. Clustering - Part 4/6",
    "size": 1976
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-67",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " This gap was addressed in a study by Scime and Beuth [49] by incorporating the information about the shape of the melt pool, spatter, and vapor plume to improve the difference between in- situ morphologies. The authors combined the morphology of the melt pools previously collected by the authors [96] with fundamental knowledge of the space process [277]. The space process was analyzed using contemporary computer vision (CV) feature extraction methods [278], which were used to classify anomalies (i.e., recoater streaking, recoater hopping, debris, super- elevation, part failure, incomplete spreading) at the powder spreading [279] and powder characterization [280] stages. Scale Invariant Feature Transforms (SIFT) [281] and Bag- of- Words [192] unsupervised ML techniques linked these data to processing defects previously reported by the authors in ref. [96] using a multi- class SVM model. A flowchart of this methodology is shown in Fig. 36. Several other studies [282,283] evaluated the effect of temperature on the relative density and revealed a relationship between single melt pool events and defect formation. However, little to no studies monitored melt pools over multiple slices, revealing hidden patterns in noisy data. A recent study by Voigt et al. [284] employed photodiode on- axis signal to monitor melt pool condition over multiple slices and concluded density enhancement of the melt pool signal at the edges. This observation, which was obtained by clustering time- series sequences into three classes using unsupervised machine learning revealed that melt pool condition changes particularly close to the edges during the manufacturing of a slice.",
    "summary": "3.2.1. Clustering - Part 5/6",
    "size": 1677
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-68",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "According to the studies reviewed in this section, the role of laws of physics in the unsupervised methods is less pronounced, as the inputs of these unsupervised models are mainly categorized into acoustic emissions, spectra emissions, and images. Two first inputs may not be producible through common available numerical methods (e.g., FEM). However, laws of physics, for example, can contribute to developing dimensionless numbers that could be used as the input of an ML model predicting acoustic signals. Also, image- based data can also be generated using laws of physics and fed into PIMI models. Working toward developing image- based data with the aid of laws of physics and employing these data to develop unsupervised PIML models could be a promising avenue of research. Also, other types of PIML models (i.e., PIMT, PIMC, PIMA, and PIMO) could still be employed to develop unsupervised PIML models, which could be another promising avenue of research in the field of AM.",
    "summary": "3.2.1. Clustering - Part 6/6",
    "size": 982
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-69",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "As mentioned, supervised learning ML models require a great number of data labeled for training. Labeling these data is prohibitively time- consuming and costly, particularly when the size of the dataset is massive. More importantly, labeling data is a manual task, which increases the possibility of mislabeling due to human bias. In unsupervised ML models, the data are not required to be labeled. However, unsupervised machine learning is computationally expensive, as all the possibilities are evaluated to find the best pattern among the data. Unsupervised learning ML models are less accurate than supervised learning models, and the user needs to\n\n![](images/a6aab2f7b5f4828c069fea98b34cbd8081d71167220f95d3c0d3d16c883f1c4e.jpg)  \nFig. 34. A sample SOM network.\n\n![](images/9aa48e494e8371a5bf10f7f5b4ae2bf9c6de8232a7e32440601fedb82831d6d7.jpg)  \nCorrelation matrix showing how pores were identified in the present methodology  Fig. 35. Predicting pores from thermal profiles [62].\n\ninterpret the clusters at the end [166]. To resolve the issues mentioned for both supervised and unsupervised ML models, semi- supervised models are employed. In semi- supervised ML models, a supervised ML model is trained using a small labeled dataset supported by unlabeled data. By adding cheap and abundant unlabeled data along with labeled data in a semi- supervised ML model, the model will no longer have the limits mentioned in both supervised and unsupervised ML algorithms [288].",
    "summary": "3.3. Semi-supervised learning - Part 1/3",
    "size": 1478
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-70",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Despite the great practical value of semi- supervised ML models, These models have been less frequently used in the AM field. In the AM field, it is difficult to collect labeled data, though it is relatively easy to gather unlabeled data. The models developed using the semi- supervised ML approach have mostly been used in defect detection problems. To evaluate the quality of an AM part, a Gaussian mixture model was developed to automatically detect faults in the AM products in a study by Okaro et al. [250]. In their work, a large photodiode dataset was developed to extract key features. The monitoring system set up in their work includes in- situ monitoring and ex- situ labeling methods. To label the ex- situ data as faulty or acceptable, ultimate tensile strength tests were conducted. It was found that the semi- supervised model developed in this study can capture the benchmark results more closely than those obtained using the supervised approach as depicted in Fig. 37. A combination of supervised and unsupervised ML models (i.e., KNN) was also employed as a semi- supervised ML model to classify the printed layers into either drift (hotspot in the layer) or no drift (no hot spot in the layer) in a study by Yadav et al. [289]. Larsen et al. [290] modeled the laser dynamics of the SLM process directly from high- speed images, and the model was tested on various porosity levels and successfully differentiated the optimal processing and defective materials. Semi- supervised CNN was also employed to categorize the quality of the parts into under- melt, beautiful- weld, and over- melt in a study conducted by Li et al. [291]. The model revealed a promising performance using limited low- quality (i.e., noisy and blurred images) labeled data.",
    "summary": "3.3. Semi-supervised learning - Part 2/3",
    "size": 1765
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-71",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " In another study [251], the in- situ monitoring data in the form of video records were gathered during the printing of the part to predict the average width of the tracks and the quality of the part (track continuity) using CNN supervised and semi- supervised models. No rule exists regarding the number of labeled data required to train a semi- supervised model. Different labeled data sizes were chosen to evaluate the effect of the number of labeled data on the performance of the semi- supervised model. They reported that the semi- supervised CNN model outperformed the fully supervised method in both regression and classification problems. Comparing the results obtained using the semi- supervised method with the same results obtained using an unsupervised CNN model could be a great continuation of this work to further evaluate the semi- supervised performance. A summary of the semi- supervised models reviewed here is listed in Table 5.",
    "summary": "3.3. Semi-supervised learning - Part 3/3",
    "size": 949
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-72",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Reinforced learning is a separate framework inspired by human cognitive capabilities of learning in its surrounding world [167]. RL is a different training process, which focuses on training agents, which interact with the environment to maximize the reward [167]. For example, Mozaffar et al. [292] proposed a framework for the toolpath design by employing PPO, DQN, and SAC algorithms. Wasmer et al. [293] classified the quality of a 3D- printed cuboid shape fabricated at different laser speeds using in- situ acoustic\n\n![](images/812f39e35052649c4c6c2c270e32ba3a3e8a85c6c7deb12140b4b470276ec623.jpg)  \nFig. 36. Developing a hybrid supervised and unsupervised model to classify melt pools [49]. (a)-(f) feature extraction process using CV and BoW (g) fingerprints representation used to describe melt pool morphologies, (h)-(i) linking in-situ and ex-situ results (the micrographs shown in step (i) were collected from [96], and (j)-(k) training of the classification algorithm and classifying new data.\n\n![](images/6761c7627d6740051b4f4c3927a4153b10c45d6c7fb2664840f95801fdedab7b.jpg)  \nFig. 37. Receiver operating characteristic curves for the ensemble of experiments in a study conducted by Okaro et al. [250]. The red line indicates the benchmark result (supervised learning when all 49 points are labeled).\n\nTable 5 Semi-supervised learning.  ",
    "summary": "3.4. Reinforced learning - Part 1/3",
    "size": 1351
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-73",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "<table><tr><td>Reference</td><td>AM process</td><td>Materials</td><td>Input</td><td>Output</td><td>ML method</td></tr><tr><td>Okaro et al. [250]</td><td>SLM</td><td>IN718</td><td>PD</td><td>Faulty/acceptable</td><td>GMM</td></tr><tr><td>Larsen and Hooper [290]</td><td>SLM</td><td>-</td><td>HSI</td><td>Anamoly detection</td><td>VRNN</td></tr><tr><td>Li et al. [291]</td><td>LBAM</td><td>ASTM F75 I CoCrMo</td><td>Micrograph image</td><td>Defect detection</td><td>CNN</td></tr><tr><td>Yuan et al. [251]</td><td>SLM</td><td>SS316</td><td>Video data</td><td>Track width and continuity</td><td>CNN</td></tr><tr><td>Yadav et al. [289]</td><td>SLM</td><td>AISIO/Mg</td><td>Optical tomography image</td><td>hot spot detection</td><td>A combination of KMC and KNN</td></tr></table>",
    "summary": "3.4. Reinforced learning - Part 2/3",
    "size": 774
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-74",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "emissions and RL. Deep learning was also combined with reinforced learning to create a subset of deep reinforced learning (DRL) employed in a study by Ogoke and Farimani [168] to generate a control policy for managing the melt pool depth by controlling either the scan speed or power of the laser during the melting process. In the traditional 3D- printed cases where the processing parameters (e.  $\\mathbf{g}_{\\cdot}$  scan speed) are kept unchanged throughout the entire trajectory, the melt pool noticeably becomes deeper at the locations at which the laser changes its direction. The growth in the melt pool dept at the spots where the laser changes its direction is due to heat accumulation. With the aid of DRL, the learned control policy is capable of achieving a considerably smaller melt pool depth variation than the constant process parameter scenario. The model proposed in the study by Ogoke and Farimini [168] was developed based on the numerical data and could be further extended using experimental data with necessary modifications. For example, due to the lag time between the order and execution of an action, controlling the scan speed might be difficult, particularly at high scan speeds. Also, some modifications in the printing process are required to change the processing parameters during manufacturing. A summary of the reinforced learning models reviewed here is listed in Table 6.",
    "summary": "3.4. Reinforced learning - Part 3/3",
    "size": 1410
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-75",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "The ultimate goal of finding the relationships between various types of input and response parameters of 3D- printed parts is to manufacture the parts in high quality regardless of the algorithms, input, and output data used during the manufacturing. The studies reviewed here linked the processing parameters to the defects formed during manufacturing in various ways. However, some challenges exist, which may lead to opportunities in the AM field. To discuss the challenges and suggest opportunities based on these challenges, two strategies have been executed; 1) the most frequent challenges directly discussed in the research papers reviewed here are summarized and echoed; 2) the challenges, gaps, and possible contributions to the AM field are identified based on reviewing the literature. In this section, three aspects of challenges are summarized based on the previous literature review. Also, four research directions and opportunities are suggested for future research and development of ML in the AM field.\n\n# 4.1. Challenges",
    "summary": "4. Challenges and opportunities, 4.1.1. Standardization - Part 1/2",
    "size": 1039
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-76",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "# 4.1.1. Standardization\nOne main challenge of the application of ML in the AM field is the lack of standardization, which hinders the real- world adaptation of ML in the prediction of the quality of the 3D- printed part. No comprehensive and accessible database, which includes different materials and printing processes, exists. Also, despite employing numerous criteria to evaluate the quality of 3D- printed parts, no specific measuring criteria have been defined to judge the quality of the 3D- printed parts. Due to a lack of standardization, the majority of studies reviewed earlier focused on the detection of defects rather than the detection and evaluation of the impact of defects. Developing binary defect classification ML models may help get a rough idea regarding the presence of defects and the quality of 3D- printed parts. However, defects need to be classified into more categories from negligible to severe defects. Developing such an ML model might be more challenging due to a lack of standardization and dataset size.",
    "summary": "4. Challenges and opportunities, 4.1.1. Standardization - Part 2/2",
    "size": 1040
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-77",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "One of the challenges of developing ML models in the AM field is to develop a large dataset. Although small datasets sometimes have been used to train ML models, the performance of these models highly depends on the size of the dataset. Also, the size of dataset required to develop an ML model depends on the number of input parameters and the range of these input parameters. Apparently, if the number of input parameters increases or a wide range for each input parameter is studied, a larger dataset is required to develop the model. This issue has been mostly neglected in the articles reviewed earlier. Also, interpretability and traceability of the results yielded\n\nTable 6 Reinforced learning.  \n\n<table><tr><td>Reference</td><td>AM process</td><td>Materials</td><td>Input</td><td>Output</td><td>ML method</td></tr><tr><td>Wasmer et al. [293]</td><td>SLM</td><td>SS 316L</td><td>AE</td><td>Porosity type</td><td>RL</td></tr><tr><td>Ogoke et al. [168]</td><td>SLM</td><td>-</td><td>P, v</td><td>MPD</td><td>DRL</td></tr><tr><td>Mozafar et al. [292]</td><td>DED</td><td>-</td><td>2D sections</td><td>TP</td><td>PPO, DQN, SAC</td></tr></table>\n\nby ML models is another issue that should be addressed to assist the decision- makers in better understanding the defect formation and its impact on the quality of the AM part. ML models are also lacking transferability [294], which limits the application of ML in the AM field.",
    "summary": "4.1.2. Data availability and model interpretation, 4.1.3. Physics-informed Models - Part 1/2",
    "size": 1428
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-78",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "# 4.1.3. Physics-informed Models\nLaws of physics could help decision- makers reach a better understanding of the relationship that exist between the PSPP steps of manufacturing, but these rules impose some limitations. Many studies focused on the accuracy of the data- driven models used to predict the quality of the 3D- printed parts. However, these models eventually provide the output for which they were trained. One solution for this drawback is to employ both data- driven and laws of physics while developing a model. However, physical modeling techniques may not be accurate enough, as they are still limited by many assumptions, simplifications, and approximations [295].\n\n# 4.2. Opportunities\n",
    "summary": "4.1.2. Data availability and model interpretation, 4.1.3. Physics-informed Models - Part 2/2",
    "size": 704
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-79",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "# 4.2.1. Moving toward PIML models\nOne solution for many challenges listed above is to move toward PIML models. Compared to many ML models developed in the AM field, very few PIML models have been developed. The physics- informed ML models become more and more essential for overcoming these challenges. By incorporating the laws of physics into the model, the model variability can be minimized. The physics used in the PIML model could help develop models with a smaller dataset and more input parameters with a wider range [296]. Although physics- based models may not accurately predict the output due to many assumptions, simplifications, and approximations considered to develop the models, these models are still able to shed the light on the hidden knowledge of the AM problems. Also, finding the physical relationships between different parameters could be used within the PIML model. The processing parameters, for example, can turn into a set of dimensionless numbers, which describe the physics of the problem. When the physics of the problem is understood, the validity of these dimensionless numbers can be derived in a certain range, which makes the model valid beyond the range of the processing parameters employed to generate the dataset. This means that the ML model developed using this technique incorporates a higher number and a wider range of processing parameters with a smaller dataset size. More importantly, the PIML models have been mainly developed in the AM field, as PIML is the most convenient type of PIML model among all models introduced. Developing a different type of PIML (e.g., PIMT, PIMA, and PIMO) other than PIML or even developing PIML models using more than one definition of PIML model is an underdeveloped and underexplored research area, which could be investigated.",
    "summary": "4.2.1. Moving toward PIML models",
    "size": 1814
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-80",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "Developing machine learning models using different types of input parameters could be a promising avenue of research. Most existing machine learning models consider one type of input parameter to develop an ML model. This means that all other types of data (e.g., image- based data, acoustic data, dimensions of melt pools, etc.) are wasted and the model accuracy is just based on one type of data. Hybrid algorithms need to be developed with the ability to handle more than one type of data. Acoustic emission data, for example, could be linked to image- based data to develop a more robust machine learning model. With the development of such models, the application of ML in AM could become more and more practical.",
    "summary": "4.2.2. Employing different types of inputs",
    "size": 718
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-81",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "# 4.2.3. Developing practical models\nIn the AM field, developing machine learning models should become less costly and laborious. During the manufacturing of 3D- printed parts, a part of the data could be captured using in- situ monitoring techniques. The ML models developed in the AM field are mainly based on offline machine learning techniques, and this real- time data cannot be used in this type of ML model. With offline ML models, the chance of training and modifying the quality of the part during manufacturing is missing. However, the real- time data could be used to develop online ML models. Less effort is required to capture the data during manufacturing and also more data could be obtained with much less labor job. Due to these benefits of online learning, it is expected that more online learning models are employed for future studies in the AM field.\n\nAlso, one laborious task of collecting and preparing data for analysis is to label the data. Employing supervised techniques requires labeled data, and unsupervised techniques are not as accurate as supervised techniques. One way to reduce the cost and effort of preparing data is to use semi- supervised techniques. Despite the high capability of semi- supervised techniques in predicting the quality of the 3D- printed parts, they have been less employed in the AM field.\n\n# 4.2.4. Length scales\nDeveloping ML models at different length scales could reach a better understanding of the problem and improve the accuracy of the developed model. The models developed in the AM field mostly fall on the macro- scale. More attention should be paid to the microstructure of the 3D- printed parts by developing micro- scale ML models. Also, developing ML models linking microscales to meso or macro scale could be another interesting topic in the AM field.",
    "summary": "4.2.3. Developing practical models, 4.2.4. Length scales",
    "size": 1824
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-82",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "This paper reviewed recent AM publications with a focus on the application of machine learning in predicting the quality of 3D- printed parts. The common input and response parameters employed in the ML models to evaluate the quality of the 3D- printed parts were introduced along with different machine learning models used in the AM field. The articles reviewed here elucidate some key\n\npoints, which are listed as follow:\n\nSupervised machine learning approaches are the most popular algorithms among ML algorithms in the defect detection and quality evaluation of 3D- printed parts. However, data preparation for supervised machine learning algorithms is costly and time- consuming, which may make these approaches less practical in the AM field. Although unsupervised and semi- supervised techniques are more suitable for AM problems due to the cost of labeling data, these approaches have been less frequently used in the AM field. Future work in the AM field is envisioned to move towards semi- supervised and reinforcement learning algorithms. Semi- supervised machine learning models have demonstrated a high potential to be widely used in the AM field, as they fully satisfy the issues with supervised and unsupervised machine learning algorithms. Developing PIML models in the AM field is in its infancy, as the majority of the ML models developed to detect defects and evaluate the quality of 3D- printed parts ignored the physics of the problem and focused more on different methods of ML models and their accuracy. Among these PIML models, PIMT, PIMC, PIMA, and PIMO models have been left underexplored in detecting defects and analyzing the quality of 3D- printed parts, while more attention needs to be paid to PIMI models. Investigating the benefits of simultaneously employing more than one of these methods is believed to be unexplored.",
    "summary": "5. Summary and concluding thoughts - Part 1/2",
    "size": 1854
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-83",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "According to the literature, machine learning algorithms seem to be a great solution to the continued challenges in the AM field and persistent quality issues of 3D- printed parts. The next generation of machine learning models will be physics- informed, online, and with less training and supervision needs.",
    "summary": "5. Summary and concluding thoughts - Part 2/2",
    "size": 308
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-84",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper.\n\n# Data availability\nData will be made available on request.\n\n# Acknowledgements\nAcknowledgementsThe authors acknowledge the infrastructure and support of the Center for Agile and Adaptive and Additive Manufacturing (CAAM) funded through State of Texas Appropriation: 190405- 105- 805008- 220.",
    "summary": "Declaration of Competing Interest",
    "size": 464
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-85",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "[1] Hague R, Dickens P, Hopkinson N. Rapid manufacturing: an industrial revolution for the digital age. John Wiley & Sons; 2006. [2] Levy G, Schindel R, Overview of layer manufacturing technologies, opportunities, options and applications for rapid tooling. Proc Inst Mech. Eng, Part B: J Eng Manuf 2002;216(12):1621- 34. [3] Beaman JJ, Barlow JW, Bourell DL, Crawford RH, Marcus HL, McAlea KP. Solid freeform fabrication: a new direction in manufacturing. Kluwer Academic Publishers, Norwell, MA 1997;2061:25- 49. [4] Kruth J- P, Leu M- C, Nakagawa T. Progress in additive manufacturing and rapid prototyping. Cirp Annals 1998;47(2):525- 40. [5] Shahrubdin N, Lee TC, Ramlan R. An overview on 3d printing technology: technological, materials, and applications. Proc Manuf 2019;35:1286- 96. [6] K.M. Taminger, R.A. Hafley, Electron beam freeform fabrication for cost effective near- net shape manufacturing. In: NATO/RTO AVT- 139 Specialists' Meeting on Cost Effective Manufacture via Net Shape Processing, 2006. [7] Xing Y, Luo C, Wu Z, Zhang K, Liu L. Fabrication and properties of micro- additive manufactured ni- based composite coatings by short- pulsed laser. Optics & Laser Technol 2022;150:107973. [8] Z. Doubrovski, J.C. Verlinden, J.M. Geraeerts, Optimal design for additive manufacturing: opportunities and challenges, in: International design engineering technical conferences and computers and information in engineering conference, Vol. 54860, 2011, pp. 635- 646. [9] Gao W, Zhang Y, Kamunjian D, Ramam R, Chen T, Williams CB, Wang CC, Shiri TC, Zhang S, Zavattier PD. The status, challenges, and future of additive manufacturing in engineering. Comput Aided Des 2015;69:65- 89. [10] A.C.F. on Additive Manufacturing Technologies, A.C.F. on Additive Manufacturing Technologies. Subcommittee F42. 91 on Terminology, Standard terminology for additive manufacturing technologies, Astm International, 2012. [11] Chatham CA, Long TE, Williams CB.",
    "summary": "References - Part 1/34",
    "size": 1955
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-86",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " A review of the process physics and material screening methods for polymer powder bed fusion additive manufacturing. Prog Polym Sci 2019;93:68- 95. [12] Kladovasilakis N, Charalampous P, Kostavetis I, Tzetzis D, Tzovaras D. Impact of metal additive manufacturing parameters on the powder bed fusion and direct energy deposition processes: a comprehensive review. Prog Addit Manuf 2021;6(3):349- 65. [13] Kershbaumer G, Ernst G. Hybrid manufacturing process for rapid high performance tooling combining high speed milling and laser cladding. Proc 23rd Int Congr Appl Lasers Electro- Optics (ICALEO) 2004:1710- 20. [14] P. Ninpetch, P. Kowitwarangkul, S. Mahathanabodee, P. Chalermkarnnon, P. Ratanadecho, A review of computer simulations of metal 3d printing, in: AIP Conference Proceedings, Vol. 2279, AIP Publishing LLC, 2020, p. 050002. [15] Brzeski D, Hia IL, Chauvette J- F, Farahani RD, Piccirelli N, Ross A, Therriault D. Design of thermoset composites for high- speed additive manufacturing of lightweight sound absorbing micro- scaffolds. Addit Manuf 2021;47:102245. https://doi.org/10.1016/j.addma.2021.102245. URL https://www.sciencedirect.com/science/article/pii/S221486042100405X. [16] Khanzadeh M, Chowdhury S, Marufuzzaman M, Tschopp MA, Bian L. Porosity prediction: Supervised- learning of thermal history for direct laser deposition. J Manuf Syst 2018;47:69- 82. https://doi.org/10.1016/j.jmsy.2018.04.001. URL https://www.sciencedirect.com/science/article/pii/S0278612518300402.",
    "summary": "References - Part 2/34",
    "size": 1496
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-87",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "[17] Li L, McGuan R, Isaac R, Kavehpour P, Candler R. Improving precision of material extrusion 3d printing by in- situ monitoring & predicting 3d geometric deviation using conditional adversarial networks. Addit Manuf 2021;38:101695. https://doi.org/10.1016/j.addma.2020.101695. URL https://www. sciencedirect.com/science/article/pii/S2234860420310678. [18] Kawakar R, Dubey HK, Lokhande SP. A review for advancements in standardization for additive manufacturing. Materials Today: Proceedings 2022;50: 1983- 90. [19] Bandyopadhyay A, Zhang Y, Bose S. Recent developments in metal additive manufacturing. Current opinion in chemical engineering 2020;28:96- 104. [20] Rashid AA, Khan SA, Al- Ghamdi SG, Koç M. Additive manufacturing of polymer nanocomposites: Needs and challenges in materials, processes, and applications. Journal of Materials Research and Technology 2021;14:910- 41. https://doi.org/10.1016/j.jmrt.2021.07.016. URL https://www.sciencedirect. com/science/article/pii/S2238785421006797. [21] Nasiri S, Khosravani MR. Machine learning in predicting mechanical behavior of additively manufactured parts. Journal of Materials Research and Technology 2021;14:1137- 5. https://doi.org/10.1016/j.jmrt.2021.07.004. URL https://www.sciencedirect.com/science/article/pii/S223878542100670. [22] D.L. Borell, M.C. Leu, D.W. Rosen, Roadmap for additive manufacturing identifying the future of freeform processing (2009). [23] Measurement science roadmap for metal- based additive manufacturing (2013). [24] Qu M, Guo Q, Escano LI, Nabaa A, Hojjatadeh SMH, Young ZA, Chen L. Controlling process instability for defect lean metal additive manufacturing. Nat Commun 2022;13(1):1- 8. [25] Gong H, Rafi K, Gu H, Starr T, Stucker B. Analysis of defect generation in ti- 6al- 4v parts made using powder bed fusion additive manufacturing processes. Addit Manuf 2014;41:487- 98. https://doi.org/10.1016/JADDMA.2014.08.003. [26] Baurei A, Scharowsky T, Körner C.",
    "summary": "References - Part 3/34",
    "size": 1957
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-88",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Defect generation and propagation mechanism during additive manufacturing by selective beam melting. J. Mater. Process. Technol. 2014;214:2522- 8. https://doi.org/10.1016/J.JMATPROTEC.2014.05.002. [27] Aoyagi K, Wang H, Sudo H, Chiba A. Simple method to construct process maps for additive manufacturing using a support vector machine. Addit Manuf 2019; 27:353- 62. [28] Yadroitseau I. Direct manufacturing of 3d objects by selective laser melting of metal powders. Ph.D. thesis. Saint- Etienne; 2008. [29] Kamath C. Data mining and statistical inference in selective laser melting. Int. J. Adv. Manuf. Technol. 2016;86:1659- 77. https://doi.org/10.1007/s00170- 015- 8289- 2. [30] Johnson N, Vulimiri P, To A, Zhang X, Brice C, Kappes B, Stebner A. Invited review: Machine learning for materials developments in metals additive manufacturing. Addit Manuf 2020;36:101641. [31] Zhu K, Fuh JYH, Lin X. Metal- based additive manufacturing condition monitoring: A review on machine learning based approaches. IEEE/ASME Trans. Mechatron. 2021. [32] Tercan H, Meisen T. Machine learning and deep learning based predictive quality in manufacturing: a systematic review. J Intell Manuf 2022:1- 27. [33] Fu Y, Downey AR, Yuan L, Zhang T, Pratt A, Balogun Y. Machine learning algorithms for defect detection in metal laser- based additive manufacturing: a review. Journal of Manufacturing Processes 2022;75:693- 710. [34] Nasiri S, Khosravani MR. Applications of data- driven approaches in prediction of fatigue and fracture. Materials Today Communications 2022;33:104437. [35] Wang C, Tan XP, Tor SB, Lim CS. Machine learning in additive manufacturing: State- of- the- art and perspectives. Addit Manuf 2020;36:101538. https://doi. org/10.1016/j.addma.2020.101538. [36] Qin J, Hu F, Liu Y, Witherell P, Wang CC, Rosen JW, Simpson T, Lu Y, Tang Q. Research and application of machine learning for additive manufacturing. Addit Manuf 2022:102691.",
    "summary": "References - Part 4/34",
    "size": 1935
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-89",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " [37] Tian C, Li T, Bustillos J, Bhattacharya S, Turnham T, Yeo J, Moridi A. Data- driven approaches toward smarter additive manufacturing. Advanced Intelligent Systems 2021;3(12):2100014. [38] Kumar S, Gopi T, Harikeerthana N, Gupta NK, Gaur V, Kroloczyk GM, Wu C. Machine learning techniques in additive manufacturing: a state of the art review on design, processes and production control. J Intell Manuf 2022;1- 35. [39] Guo S, Agarwal M, Coo C, Tian Q, Gao RX, Grace WG, Guo Y, Mac. Machine learning for metal additive manufacturing: Towards a physics- informed data- driven paradigm. Journal of Manufacturing Systems 2022;62:145- 63. [40] Fink A. Conducting research literature reviews: From the internet to paper. Sage publications; 2019. [41] Chowdhary K. Natural language processing. Fundamentals of artificial intelligence 2020:603- 49. [42] Bird S. Ntik: the natural language toolkit. In: Proceedings of the COLING/ACL 2006 Interactive Presentation Sessions; 2006. p. 69- 72. [43] Jones KS. A statistical interpretation of term specificity and its application in retrieval. Journal of Documentation 1972. [44] Rousseew PJ. Silhouettes: a graphical aid to the interpretation and validation of cluster analysis. Journal of computational and applied mathematics 1987;20: 53- 65. [45] Higuchi K. Kh coder 3 reference manual. Kioto (Japan): Ritsumeikan University; 2016. [46] Bayat M, Dong W, Thorborg J, To AC, Hattel JH. A review of multi- scale and multi- physics simulations of metal additive manufacturing processes with focus on modeling strategies. Addit Manuf 2021;47:102278. [47] Khosravani MR, Reinicke T. On the use of x- ray computed tomography in assessment of 3d- printed components. J. Nondestr. Eval. 2020;39(4):1- 17. [48] Du Plessis A, Yadroitsev I, Yadroitseva I, Le Roux SG. X- ray microcomputed tomography in additive manufacturing: a review of the current technology and applications. 3D Printing and Additive Manufacturing 2018;5(3):227- 47. [49] Scime L, Beuth J.",
    "summary": "References - Part 5/34",
    "size": 1992
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-90",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Using machine learning to identify in- situ melt pool signatures indicative of flaw formation in a laser powder bed fusion additive manufacturing process. Addit Manuf 2019;25:151- 65. [50] Criales LE, Arisoy YM, Lane B, Moylan S, Donmez A, Ozel T. Laser powder bed fusion of nickel alloy 625: experimental investigations of effects of process parameters on melt pool size and shape with sinter analysis. Int. J. Mach. Tools Manuf. 2017;121:22- 36. [51] Dilip J, Zhang S, Teng C, Zeng K, Robinson C, Fei D, Stucker B. Influence of processing parameters on the evolution of melt pool, porosity, and microstructures in ti- 6al- 4v alloy parts fabricated by selective laser melting. Progress in Additive Manufacturing 2017;2(3):157- 67. [52] Keshavarzkermani A, Marzbanrad E, Esmaeilizadeh R, Mahmoodkhani Y, Ali U, Enrique PD, Zhou NY, Bonakdar A, Toyserkani E. An investigation into the effect of process parameters on melt pool geometry, cell spacing, and grain refinement during laser powder bed fusion. Optics & Laser Technology 2019;116: 83- 91. [53] Yu G, Gu D, Dai D, Xia M, Ma C, Chang K. Influence of processing parameters on laser penetration depth and melting/re- melting densification during selective laser melting of aluminum alloy. Appl. Phys. A 2016;122(10):1- 12. [54] Khosravani MR, Reinicke T. Fracture behavior of intact and defected 3d- printed parts. Procedia Structural Integrity 2021;31:105- 10. [55] Yasa E, Kruth JP, Deckers J. Manufacturing by combining selective laser melting and selective laser erosion/laser re- melting. CIRP Ann. 2011;60:263- 6. https://doi.org/10.1016/J.CIRP.2011.03.063. [56] Yadroitsev I, Gusarov A, Yadroitsava I, Smurov I. Single track formation in selective laser melting of metal powders. J. Mater. Process. Technol. 2010;210: 1624- 31. https://doi.org/10.1016/J.JMATPROTEC.2010.05.010. [57] A. Laohrapapanon, P. Jeamwatthanachai, M. Wongcumchang, N. Chantarapanich, S. Chantaweroad, K. Shthiseripratip, S.",
    "summary": "References - Part 6/34",
    "size": 1960
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-91",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Wisutmethangoon, Optimal scanning condition of selective laser melting processing with stainless steel 3161 powder, in: Advanced Materials Research, Vol. 341, Trans Tech Publ, 2012, pp. 816- 820. [58] Zhang Z, Liu Z, Wu D. Prediction of melt pool temperature in directed energy deposition using machine learning. Addit Manuf 2021;37:101692. [59] Oleak A, Xi Z. Calibration and validation framework for selective laser melting process based on multi- fidelity models and limited experiment data. J. Mech. Des. 2020;142(8):081701. [60] Luo Z, Zhao Y. A survey of finite element analysis of temperature and thermal stress fields in powder bed fusion additive manufacturing. Addit Manuf 2018;21: 318- 32.",
    "summary": "References - Part 7/34",
    "size": 701
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-92",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "[61] Mohammadpour P, Plotkowski A, Phillion AB. Revisiting solidification microstructure selection maps in the frame of additive manufacturing. Addit Manuf 2020;31:100936. [62] Khanzadeh M, Chowdhury S, Tschopp MA, Doude HR, Marufuzzaman M, Bian L. In- situ monitoring of melt pool images for porosity prediction in directed energy deposition processes. IISE Transactions 2019;51(5):437- 55. [63] Shamsaei N, Yadollahi A, Bian L, Thompson SM. An overview of direct laser deposition for additive manufacturing: part ii: Mechanical behavior, process parameter optimization and control. Additive Manufacturing 2015;8:12- 35. https://doi.org/10.1016/J.AEPDMA.2015.07.002. [64] Mozaffar M, Paul A, Al- Bahrani R, Wolff S, Choudhary A, Agrawal A, Ehmann K, Cao J. Data- driven prediction of the high- dimensional thermal history in directed energy deposition processes via recurrent neural networks. Manufacturing letters 2018;18:35- 9. [65] Montgomery DC, Runger GC. Applied statistics and probability for engineers. John Wiley & Sons; 2010. [66] Wang C, Tan X, Du Z, Chandra S, Sun Z, Lin C, Tor S, Lim C, Wong C. Additive manufacturing of niti shape memory alloys using pre- mixed powders. J. Mater. Process. Technol. 2019;271:152- 61. [67] Wang C, Tan X, Liu E, Tor SB. Process parameter optimization and mechanical properties for additively manufactured stainless steel 316l parts by selective electron beam melting. Materials & Design 2018;147:157- 66. [68] Zhang Y, Zhang J. Modeling of solidification microstructure evolution in laser powder bed fusion fabricated 316l stainless steel using combined computational fluid dynamics and cellular automata, Additi Manuf 2019;28:750- 65. [69] Soomro AA, Mokhtar AA, Kurnia JC, Lashari N, Lu H, Sambo C. Integrity assessment of corroded oil and gas pipelines using machine learning: A systematic review. Eng. Fail. Anal. 2020;131:105810. https://doi.org/10.1016/j.engfailanal.2021.105810. URL https://www.sciencedirect.",
    "summary": "References - Part 8/34",
    "size": 1964
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-93",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "com/science/article/pii/S13505630721006713. [70] Patnaik A, Satapathy A, Chand N, Barkoula NM, Biswas S. Solid particle erosion wear characteristics of fiber and particulate filled polymer composites: A review. Wear 2010;268:249- 63. https://doi.org/10.1016/j.wear.2009.07.021. URL https://www.sciencedirect.com/science/article/pii/S004316480900475X. [71] Huang DJ, Li Q. A machine learning guided investigation of quality repeatability in metal laser powder bed fusion additive manufacturing. Materials & Design 2021;203:109606. [72] He P, Liu Q, Kruzic JJ, Li X. Machine- learning assisted additive manufacturing of a tinc reinforced alsi10mg composite with tailorable mechanical properties. Mater. Lett. 2022;307:131018. [73] Wang C, Tan X, Tor S, Lim C. Machine learning in additive manufacturing: State- of- the- art and perspectives. Addit Manuf 2020;36:101538. [74] Druzgalski C, Ashby A, Guss G, King W, Rehling TT, Matthews MJ. Process optimization of complex geometries using feed forward control for laser powder bed fusion additive manufacturing. Addit Manuf 2020;34:10169. [75] Ball P. Using artificial intelligence to accelerate materials development. MRS Bull. 2019;44(5):335- 44. [76] Ward L, Agrawal A, Choudhary A, Wolverton C. A general- purpose machine learning framework for predicting properties of inorganic materials. npj Computational Materials 2016;2(1):1- 7. [77] S.S. Razvi, S. Feng, A. Narayanan, Y.T.T. Lee, P. Witherell, A review of machine learning applications in additive manufacturing (8 2019). doi:10.1115/ DETC2019- 98415. doi: 10.1115/DETC2019- 98415. [78] Meng L, McWilliams B, Jarosinski W, Park H- Y, Jung Y- G, Lee J, Zhang J. Machine learning in additive manufacturing: A review. JOM 2020;72:2363- 77. https://doi.org/10.1007/s11837- 020- 04155- y. [79] Jiang J, Xiong Y, Zhang Z, Rosen DW. Machine learning integrated design for additive manufacturing. J Intell Manuf 2020. https://doi.org/10.1007/s10845- 020- 01715- 6.",
    "summary": "References - Part 9/34",
    "size": 1964
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-94",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " [80] Razvi SS, Feng S, Narayanan A, Lee Y- TT, Witherell P. In: A review of machine learning applications in additive manufacturing, Vol. 59179. in: International Design Engineering Technical Conferences and Computers and Information in Engineering Conference, American Society of Mechanical Engineers; 2019. V001T02A040. [81] Jin Z, Zhang Z, Demir K, Gu GX. Machine learning for advanced additive manufacturing. Matter 2020;3(5):1541- 56. [82] DebRoy T, Wei HL, Zuback JS, Mukherjee T, Elmer JW, Milewski JO, Beese AM, de Wilson- Heid A, De A, Zhang W. Additive manufacturing of metallic components- process, structure and properties. Prog. Mater Sci. 2018;92:112- 224. [83] Yang J, Han J, Yu H, Yin J, Gao M, Wang Z, Zeng X. Role of molten pool mode on formability, microstructure and mechanical properties of selective laser melted ti- 6al- 4v alloy. Materials & Design 2016;110:558- 70. https://doi.org/10.1016/J.MATDES.2016.08.036. [84] Thompson SM, Bian L, Shamsaei N, Yadollahi A. An overview of direct laser deposition for additive manufacturing: part i: Transport phenomena, modeling and diagnostics. Addit Manuf 2015;8:36- 62. [85] Bauerei8 A, Scharowsky T, Körner C. Defect generation and propagation mechanism during additive manufacturing by selective beam melting. J. Mater. Process. Technol. 2014;214(11):2522- 8. https://doi.org/10.1016/j.jmatprotec.2014.05.002. URL https://www.sciencedirect.com/science/article/pii/S0924013614001691. [86] Dadbakhsh S, Hao L. Effect of al alloys on selective laser melting behaviour and microstructure of in situ formed particle reinforced composites. Journal of alloys and compounds 2012;541:328- 34. [87] Yasa E, Kruth J- P. Microstructural investigation of selective laser melting 316l stainless steel parts exposed to laser re- melting. Procedia Engineering 2011;19: 389- 95. [88] Clark D, Bache M, Whittaker MT. Shaped metal deposition of a nickel alloy for aero engine applications.",
    "summary": "References - Part 10/34",
    "size": 1940
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-95",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Journal of materials processing technology 2008;203 (1- 3):439- 48. [89] Yusuf SM, Gao N. Influence of energy density on metallurgy and properties in metal additive manufacturing. Mater. Sci. Technol. 2017;33(11):1269- 89. [90] Darvish K, Chen Z, Pasang T. Reducing lack of fusion during selective laser melting of cormo alloy: Effect of laser power on geometrical features of tracks. Materials & Design 2016;112:357- 66. [91] Promoppatum P, Yao S- C. Analytical evaluation of defect generation for selective laser melting of metals. The International Journal of Advanced Manufacturing Technology 2019;103(1):1- 85- 98. [92] King WE, Barth HD, Castillo VM, Gallegos GF, Gibbs JW, Hahn DE, Kamath C, Rubenchik AM. Observation of keyhole- mode laser melting in laser powder- bed fusion additive manufacturing. J. Mater. Process. Technol. 2014;214(12):2915- 25. [93] Khairallah SA, Anderson AT, Rubenchik A, King WE. Laser powder- bed fusion additive manufacturing: Physics of complex melt flow and formation mechanisms of pores, spatter, and denudation zones. Acta Mater. 2016;108:36- 45. https://doi.org/10.1016/J.ACTAMAT.2016.02.014. [94] Sibillano T, Ancona A, Berardi V, Schingare E, Basile G, Lugara P. Optical detection of conduction/keyhole mode transition in laser welding. J. Mater. Process. Technol. 2007;191(1- 3):364- 7. [95] Lee JY, Ko SH, Parson DF, Yoo CD. Mechanism of keyhole formation and stability in stationary laser welding. J. Phys. D: Appl. Phys. 2002;35(13):1570. [96] Scime L, Beuth J. Melt pool geometry and morphology variability for the inconel 718 alloy in a laser powder bed fusion additive manufacturing process. Addit Manuf 2019;29:100830. https://doi.org/10.1016/j.addma.2019.100830. URL https://www.sciencedirect.com/science/article/pii/S2214860419306104. [97] Jadhav SD, Goossens LR, Kinds Y, Van Hooreweder B, Vanmeensel K. Laser- based powder bed fusion additive manufacturing of pure copper. Addit Manuf 2021;42:101990. [98] Tang C, Tan JL, Wong CH.",
    "summary": "References - Part 11/34",
    "size": 1986
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-96",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " A numerical investigation on the physical mechanisms of single track defects in selective laser melting. Int. J. Heat Mass Transf. 2018;126:957- 68. https://doi.org/10.1016/J.IHEATMASSTRANSFER.2018.06.073. [99] Kruth JP, Froyen L, Vaerenbergh JV, Mercolis P, Rombouts M, Lauwers B. Selective laser melting of iron- based powder. J. Mater. Process. Technol. 2004;149: 616- 22. https://doi.org/10.1016/J.JMATPROTEC.2003.11.051. [100] Tapia G, Elwany AH, Sang H. Prediction of porosity in metal- based additive manufacturing using spatial gaussian process models. Addit Manuf 2016;12: 282- 90. https://doi.org/10.1016/j.addma.2016.05.009.",
    "summary": "References - Part 12/34",
    "size": 636
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-97",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "machine learning. Addit Manuf 2022;55:102817. [102] Vilaro T, Colin C, Bartout J- D, As- fabricated and heat- treated microstructures of the ti- 6al- 4v alloy processed by selective laser melting. Metallurgical and materials transactions A 2011;42(10):3190- 9. [103] Wang S, Ning J, Zhu L, Yang Z, Yan W, Duh Y, Xue P, Xu P, Bose S, Bandyopadhyay A. Role of porosity defects in metal 3d printing: Formation mechanisms, impacts on properties and mitigation strategies. Mater. Today 2022. [104] Sola A, Nouri A. Microstructural porosity in additive manufacturing: The formation and detection of pores in metal parts fabricated by powder bed fusion. Journal of Advanced Manufacturing and Processing 2019;1(3):e10021. [105] Paul R, Anand S, Gerner F. Effect of thermal deformation on part errors in metal powder based additive manufacturing processes. Journal of manufacturing science and Engineering 2014;136(3). [106] Wang R- J, Wang L, Zhao L, Liu Z. Influence of process parameters on part shrinkage in sls. The International Journal of Advanced Manufacturing Technology 2007;33(5):498- 504. [107] Paul R. Modeling and optimization of powder based additive manufacturing (AM) processes. University of Cincinnati; 2013. [108] Li C, Liu Z, Fang X, Guo Y. Residual stress in metal additive manufacturing. Procedia Cirp 2018;71:348- 53. [109] Gu D, Hagedorn Y- C, Meiners W, Meng G, Batista RJ, Wissenbach K, Poprawe R. Densification behavior, microstructure evolution, and wear performance of selective laser melting processes commercially pure titanium. Acta Mater. 2012;60(9):3849- 60. [110] R. Margalis, L. P. Kruth. Residual stress in selective laser sintering and selective laser melting. Rapid prototyping journal (2006). [111] King WE, Anderson AT, Ferencz RM, Hodge NE, Kamath G, Khairallah SA, Rubenchik AM. Laser powder bed fusion additive manufacturing of metals; physics, computational, and materials challenges. Applied Physics Reviews 2015;2(4):041304. [112] Zhu H, Lu L, Fuh J.",
    "summary": "References - Part 13/34",
    "size": 1989
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-98",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Study on shrinkage behaviour of direct laser sintering metallic powder. Proc. Inst. Mech. Eng., Part B: J. Eng. Manuf. 2006;220(2):183- 90. [113] Wang S, Zhu L, Dun Y, Yang Z, Fuh JYH, Yan W. Multi- physics modeling of direct energy deposition process of thin- walled structures: defect analysis. Comput. Mech. 2021;67(4):1229- 42. [114] Raghunath N, Pandey PM. Improving accuracy through shrinkage modelling by using taguchi method in selective laser sintering. Int. J. Mach. Tools Manuf 2007;47(6):985- 95. https://doi.org/10.1016/j.ijmachtools.2006.07.001. URL https://www.sciencedirect.com/science/article/pii/S0890695506001775. [115] Yang Wp, Tamg Y. Design optimization of cutting parameters for turning operations based on the taguchi method. Journal of materials processing technology 1998;84(1- 3):122- 9. [116] Zheng H, Zhang J, Lu S, Wang G, Xu Z. Effect of core- shell composite particles on the sintering behavior and properties of nano- al2o3/polystyrene composite prepared by sls. Mater. Lett. 2006;60(9- 10):1219- 23. [117] Klingbeil NW, Beuth JL, Chin R, Amon C. Residual stress- induced warping in direct metal solid freeform fabrication. Int. J. Mech. Sci. 2002;44(1):57- 77. [118] M. Zae, G. Branner, T. Krol, A three dimensional fe- model for the investigation of transient physical effects in selective laser melting, in: Fourth International Conference on Advanced Research in Virtual and Rapid Prototyping: Innovative Development in Design and Manufacturing- Advanced Research in Virtual and Rapid Prototyping, Leiria, Portugal (Taylor & Francis, London, 2009), 2009, pp. 415- 424. [119] W. Rong- Ji, L. Xin- Hua, W. Qing- Ding, W. Lingling, Optimizing process parameters for selective laser sintering based on neural network and genetic algorithm, The International Journal of Advanced Manufacturing Technology 2008 42:11 42 (2008) 1035- 1042. doi:10.1007/S00170- 008- 1669- 0. https://link.springer. com/article/10.1007/s00170- 008- 1669- 0. [120] Williams JD, Deckard CR.",
    "summary": "References - Part 14/34",
    "size": 1999
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-99",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Advances in modeling the effects of selected parameters on the sls process. Rapid Prototyping Journal 1998;4:90- 100. https://doi. org/10.1108/13552549810210257/FULL/XML. [121] Bai Y, Wagner G, Williams CB. Effect of particle size distribution on powder packing and sintering in binder setting additive manufacturing of metals. J. Manuf. Sci. Eng. 2017;139(8). [122] Lee S, Peng J, Shin D, Choi YS. Data analytics approach for melt- pool geometries in metal additive manufacturing. Sci. Technol. Adv. Mater. 2019;20:972- 8. https://doi.org/10.1080/14686996.2019.1671140. [123] Johnson L, Mahmoudi M, Zhang B, Seede R, Huang X, Maier JT, Maier HJ, Karaman I, Elwany A, Arrovaive R. Assessing prntability maps in additive manufacturing of metal alloys. Acta Mater. 2019;176:199- 210. https://doi.org/10.1016/J.ACTAMAT.2019.07.005. [124] Cijsters S, Craegts T, Buls S, Kempen K, Kruh J- P. In situ quality control of the selective laser melting process using a high- speed, real- time melt pool monitoring system. The International Journal of Advanced Manufacturing Technology 2014;75(5):1089- 1091. [125] Heigel JC, Lane BM. Measurement of the melt pool length during single scan tracks in a commercial laser powder bed fusion process. J. Manuf. Sci. Eng. 2018; 140(5). [126] Tan W, Shin YC. Analysis of multi- phase interaction and its effects on keyhole dynamics with a multi- physio numerical model. J. Phys. D: Appl. Phys. 2014;47 (34):345501. [127] Hann D, Iammi J, Folkes J. A simple methodology for predicting laser- weld properties from material and laser parameters. J. Phys. D: Appl. Phys. 2011;44(44): 445401. [128] Fabbro R, Dal M, Peyre P, Coste F, Schneider M, Gunenthiram V. Analysis and possible estimate of keyhole depths evolution, using laser operating parameters and material properties. Journal of Laser Applications 2018;30(3):032410. [129] Goossens LR, Van Hooreweder B.",
    "summary": "References - Part 15/34",
    "size": 1892
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-100",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " A virtual sensing approach for monitoring melt- pool dimensions using high speed coaxial imaging during laser powder bed fusion of metals. Addit Manuf 2021;40:101923. [130] Ye J, Khairallah SA, Rubenchik AM, Crumb MF, Guss G, Belak J, Matthews MJ. Energy coupling mechanisms and scaling behavior associated with laser powder bed fusion additive manufacturing. Adv. Eng. Mater. 2019;21(7):1900185. [131] Pinkerton AJ, Li L. Modelling the geometry of a serving laser melt pool and deposition track via energy and mass balances. J. Phys. D: Appl. Phys. 2004;37(14): 1885. [132] Zhuang J- R, Lee Y- T, Hsieh W- H, Yang A- S. Determination of melt pool dimensions using doe- fem and rsm with process window during slm of ti6al4v powder. Optics & Laser Technology 2018;103:59- 76. [133] Sun Z, Guo W, Li L. In- process measurement of melt pool cross- sectional geometry and grain orientation in a laser directed energy deposition additive manufacturing process. Optics & Laser Technology 2020;129:106280. [134] Pinkerton AJ, Li L. Multiple- layer cladding of stainless steel using a high- powered diode laser: an experimental investigation of the process characteristics and material properties. Thin Solid Films 2004;453:471- 6. [135] Majumdar JD, Pinkerton A, Liu Z, Manna J, Li L. Microstructure characterisation and process optimization of laser assisted rapid fabrication of 316l stainless steel. Appl. Surf. Sci. 2005;247(1- 4):320- 7. [136] Yahata T, Ikeda T, Maeda M. Deoxidation of molten titanium by electron- beam remelting technique. Metall. Trans. B 1993;24(4):599- 604. [137] Van Den Avyle JA, Brooks JA, Powell AC. Reducing defects in remelting processes for high- performance alloys. Jom 1998;50(3):22- 5. [138] Sun Y, Moroz A, Albaey K. Sliding wear characteristics and corrosion behaviour of selective laser melted 316l stainless steel. Journal of materials engineering and performance 2014;23(2):518- 26. [139] Fang X, Du J, Wei Z, Wang X, He P, Bai H, Wang B, Chen J, Geng R, Lu B.",
    "summary": "References - Part 16/34",
    "size": 1996
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-101",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Study on metal deposit in the fused- coating based additive manufacturing. Procedia Cirp 2016;55:115- 21. [140] Li Y, Gu D. Parametric analysis of thermal behavior during selective laser melting additive manufacturing of aluminum alloy powder. Materials & design 2014; 63:856- 67. [141] Hao S, Zhang X, Mei X, Grosdidier T, Dong C. Surface treatment of dz4 directionally solidified nickel- based superalloy by high current pulsed electron beam. Materials letters 2008;62(3):414- 7. [142] Das S. Physical aspects of process control in selective laser sintering of metals. Adv. Eng. Mater. 2003;5(10):701- 11. [143] Charles C. Modelling microstructure evolution of weld deposited ti- 6al- 4v. Lulea tekniska universitet; 2008. Ph.D. thesis.",
    "summary": "References - Part 17/34",
    "size": 739
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-102",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "[144] Huang F, Jiang Z, Liu X, Lian J, Chen L. Microstructure and properties of thin wall by laser cladding forming. J. Mater. Process. Technol. 2009;209(11):4970- 6. [145] Vastola G, Zhang G, Pei Q, Zhang Y- W. Modeling and control of remelting in high- energy beam additive manufacturing. Addit Manuf 2015;7:57- 63. [146] Zhang G, Lu X, Li J, Chen J, Lin X, Wang M, Tan H, Huang W. In- situ grain structure control in directed energy deposition of ti6al4v. Addit Manuf 2022: 102865. [147] Ren K, Chew Y, Fuh J, Zhang Y, Bi G. Thermo- mechanical analyses for optimized path planning in laser- aided additive manufacturing processes. Materials & Design 2019;162:80- 93. [148] Tang L, Landers RG. Melt pool temperature control for laser metal deposition processes- part i: Online temperature control. Journal of Manufacturing Science and Engineering, Transactions of the ASME 2010;132:01101- 9. https://doi.org/10.1115/1.4000882/464568. URL https://asmedigitalcollection.asme.org/manufacturingscience/article/132/1/011010/468568/Melt- Pool- Temperature- Control- for- Laser- Metal. [149] Fisher BA, Lane B, Yeung H, Beuth J. Toward determining melt pool quality metrics via coaxial monitoring in laser powder bed fusion. Manufacturing Letters 2018;15:119- 21. https://doi.org/10.1016/J.MPEGLET.2018.02.009. [150] Masoomi M, Thompson SM, Shamsaei N. Laser powder bed fusion of ti- 6al- 4v parts: Thermal modeling and mechanical implications. Int. J. Mach. Tools Manuf 2017;118:73- 90. [151] Tang M, Pistorius PC, Beuth JL. Prediction of lack- of- fusion porosity for powder bed fusion. Addit Manuf 2017;14:39- 48. [152] Zhang B, Zhou Y, Smugeresky J, Schoenung J, Lavernia E. Thermal behavior and microstructural evolution during laser deposition with laser- engineered net shaping: Part i. numerical calculations. Metallurgical and materials transactions A 2008;39(9):2228- 36. [153] Khairullah SA, Anderson AT, Rubenshik A, King WE.",
    "summary": "References - Part 18/34",
    "size": 1932
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-103",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Laser powder bed fusion additive manufacturing: Physics of complex melt flow and formation mechanisms of pores, spatter, and denudation zones. Acta Mater. 2016;108:36- 45. [154] Yadollahi A, Shamsaei N. Additive manufacturing of fatigue resistant materials: Challenges and opportunities. Int. J. Fatigue 2017;98:14- 31. [155] Wolff S, Lee T, Faerson E, Ehmann K, Cao J. Anisotropic properties of directed energy deposition (ded)- processed ti- 6al- 4v. Journal of Manufacturing Processes 2016;24:397- 405. https://doi.org/10.1016/J.JJAMPRO.2016.06.020. [156] Keicher DM, Smugeresky JE. The laser forming of metallic components using particulate materials. J. 1997;49(5):51- 4. [157] Ren K, Chew Y, Zhang Y, Bi G, Fuh J. Thermal analyses for optimal scanning pattern evaluation in laser aided additive manufacturing. J. Mater. Process. Technol. 2019;271:178- 88. [158] Hua T, Jing C, Xin L, Fengying Z, Weidong H. Research on molten pool temperature in the process of laser rapid forming, journal of materials processing technology 2008;198(1- 3):454- 62. [159] Islam M, Purtonen T, Pilli H, Salminen A, Nyrhila O. Temperature profile and imaging analysis of laser additive manufacturing of stainless steel. Physics Procedia 2013;41:835- 42. [160] Liu Z, Kim H, Liu W, Cong W, Jiang Q, Zhang H. Influence of energy density on macro/micro structures and mechanical properties of as- deposited inconel 718 parts fabricated by laser engineered net shaping. Journal of manufacturing processes 2019;42:96- 105. [161] Paulson NH, Gould B, Wolff SJ, Stan M, Greco AC. Correlations between thermal history and keyhole porosity in laser powder bed fusion. Addit Manuf 2020; 34:101213. [162] Ren K, Chew Y, Liu N, Zhang Y, Fuh J, Bi G. Integrated numerical modelling and deep learning for multi- layer cube deposition planning in laser aided additive manufacturing. Virtual and Physical Prototyping 2021;16(3):318- 32. [163] Francis J, Bian L.",
    "summary": "References - Part 19/34",
    "size": 1933
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-104",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Deep learning for distortion prediction in laser- based additive manufacturing using big data. Manufacturing Letters 2019;20:10- 4. [164] Rakita A, Nikolic N, Mildner M, Matiasek J, Elbe- Burger A. Re- epithelialization and immune cell behaviour in an ex vivo human skin model. Scientific reports 2020;10(1):1- 11. [165] Fantz U. Basics of plasma spectroscopy. Plasma sources science and technology 2006;15(4):S137. [166] A. Geron, Hands- on Machine Learning with Scikit- Learn, Keras & TensorFlow, second edl Edition, 2019. [167] Sutton RS, Barto AG. Reinforcement learning: An introduction. MIT press; 2018. [168] Ogoke F, Farimani AB. Thermal control of laser powder bed fusion using deep reinforcement learning. Addit Manuf 2021;46:102033. [169] Zhou Z- H. Machine learning. Springer Nature; 2021. [170] Zhu X, Goldberg AB. Introduction to semi- supervised learning. Synthesis lectures on artificial intelligence and machine learning 2009;3(1):1- 130. [171] Breiman L. Random forests. Machine learning 2001;45(1):5- 32. [172] Cortes C, Vapnik V. Support- vector networks. Machine learning 1995;20(3):273- 97. [173] Rasmussen CE. Gaussian processes in machine learning. In: Summer school on machine learning. Springer; 2003. p. 63- 71. [174] Hoerl AE, Kennard RW. Ridge regression: Biased estimation for nonorthogonal problems. Technometrics 1970;12(1):55- 67. [175] Hinton GE, Osindero S, Teh Y- W. A fast learning algorithm for deep belief nets. Neural computation 2006;18(7):1527- 54. [176] Sewak M, Karim MR, Pujari P. Practical convolutional neural networks: implement advanced deep learning models using Python. Packt Publishing Ltd; 2018. [177] T. Chen, C. Guestrin, Xgboost: A scalable tree boosting system, in: Proceedings of the 22nd international conference on knowledge discovery and data mining, 2016, pp. 785- 794. [178] Friedman J, Hastie T, Tibshirani R. Additive logistic regression: a statistical view of boosting (with discussion and a rejoinder by the authors).",
    "summary": "References - Part 20/34",
    "size": 1985
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-105",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " The annals of statistics 2000;28(2):337- 407. [179] Friedman JH. Greedy function approximation: a gradient boosting machine. Annals of statistics 2001;1189- 232. [180] Tibshirani R. Regression shrinkage and selection via the lasso. J. Roy. Stat. Soc.: Ser. B (Methodol.) 1996;58(1):267- 88. [181] O. Kramer, K- nearest neighbors, in: Dimensionality reduction with unsupervised nearest neighbors, Springer, 2013, pp. 13- 23. [182] G. Huang, Z. Liu, L. Van Der Maaten, K.Q. Weinberger, Densely connected convolutional networks, in: Proceedings of the IEEE conference on computer vision and pattern recognition, 2017, pp. 4700- 4708. [183] Kohonen T. Self- organization maps, ser. Information Sciences. Berlin: Springer 2001;30. [184] Jafari- Marandi R, Khanzadeh M, Smith BK, Bian L. Self- organizing and error driven (soed) artificial neural network for smarter classifications. Journal of Computational Design and Engineering 2017;4(4):282- 304. [185] Lee JA, Verleysen M. Nonlinear dimensionality reduction, Vol. 1. Springer; 2007. [186] Lu H, Plataniotis KN, Venetsanopoulos AN. Multilinear principal component analysis of tensor objects for recognition. In: in: 18th International Conference on Pattern Recognition (ICPR 06). Vol. 2. IEEE; 2006. p. 776- 9. [187] S. Mika, G. Ratsch, J. Weston, B. Scholkopf, K- R. Mullers, Fisher discriminant analysis with kernels, in: Neural networks for signal processing IX: Proceedings of the 1999 IEEE signal processing society workshop (cat. no. 98th8468), Ieee, 1999, pp. 41- 48. [188] B. Becker, R. Kohavi, D. Sommerfield, Visualizing the simple bayesian classifier (1997). [189] J.- C. Vialatte, V. Gripon, G. Mercier, Generalizing the convolution operator to extend cnns to irregular domains, arXiv preprint arXiv:1606.01166 (2016). [190] M. Awad, R. Khanna, Support vector regression, in: Efficient learning machines, Springer, 2015, pp. 67- 89. [191] L.K. Saul, S.T. Roweis, An introduction to locally linear embedding, unpublished.",
    "summary": "References - Part 21/34",
    "size": 1982
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-106",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Available at: http://www.cs.toronto.edu/roweis/lle/publications.html (2000). [192] Csurka G, Dance C, Fan L, Willamowski J, Bray C. Visual categorization with bags of keypoints. In: Workshop on statistical learning in computer vision, ECCV, Prague, Vol. 1; 2004. p. 1- 2. [193] Likas A, Vlassis N, Verbeek JJ. The global k- means clustering algorithm. Pattern recognition 2003;36(2):451- 61. [194] Le Roux N, Bengio Y. Representational power of restricted boltzmann machines and deep belief networks. Neural computation 2008;20(6):1631- 49. [195] Bishop CM, Nasrabadi NM. Pattern recognition and machine learning, Vol. 4. Springer; 2006. [196] J. Schulman, F. Wolski, P. Dhariwal, A. Radford, O. Klimov, Proximal policy optimization algorithms, arXiv preprint arXiv:1707.06347 (2017). [197] V. Mnih, A.P. Badia, M. Mirza, A. Graves, T. Lillicrap, T. Harley, D. Silver, K. Kavukcuoglu, Asynchronous methods for deep reinforcement learning, in: International conference on machine learning, PMLR, 2016, pp. 1928- 1937.",
    "summary": "References - Part 22/34",
    "size": 1017
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-107",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "preprint arXiv:1812.05905 (2018). [199] Wan H, Chen G, Li C, Qi X, Zhang G. Data- driven evaluation of fatigue performance of additive manufactured parts using miniature specimens. Journal of Materials Science & Technology 2019;35(1):1137- 46. [200] Wu M, Phoha VV, Moon YB, Belman AK. Detecting malicious defects in 3d printing process using machine learning and image classification. In: ASME International Mechanical Engineering Congress and Exposition, Vol. 50688. American Society of Mechanical Engineers; 2016. V014T07A004. [201] Xie X, Bennett J, Saha S, Lu Y, Cao J, Liu W, Gan Z. Mechanistic data- driven prediction of as- built mechanical properties in metal additive manufacturing. npj Computational Materials 2021;7(1):1- 12. [202] Yan R, Gao RX. Base wavelet selection for bearing vibration signal analysis. Int. J. Wavelets Multiresolut. Inf. Process. 2009;7(04):411- 26. [203] Inyang- Udoh U, Mishra S. A learning- based approach to modeling and control of inkjet 3d printing. 2020 American Control Conference (ACC). IEEE; 2020. p.460- 6. [204] Inyang- Udoh U, Mishra S. A physics- guided neural network dynamical model for droplet- based additive manufacturing. IEEE Trans. Control Syst. Technol. 2021. [205] T. Li, Z. Zhao, C. Sun, L. Cheng, X. Chen, R. Yan, R.X. Gao, Waveletkernet: An interpretable deep neural network for industrial intelligent diagnosis, IEEE Transactions on Systems, Man, and Cybernetics: Systems (2021). [206] Grezak J, Wang P, Sun C, Gao RX. Explainable convolutional neural network for gearbox fault diagnosis. Procedia CIRP 2019;80:476- 81. [207] Bach S, Binder A, Montyver G, Kluebner F, Miller K.P., Samak W. On pixel wise explorations for non- linear classifier decisions by layer- wise relevance propagation. PloS one 2015;10(7):e0130130. [208] Ye J, Bab- Hadiashar A, Hoseinnezhad R, Alam N, Vargas- Uscategui A, Patel M, Cole I. Predictions of in- situ melt pool geometric signatures via machine learning techniques for laser metal deposition. Int. J.",
    "summary": "References - Part 23/34",
    "size": 2000
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-108",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Comput. Integr. Manuf. 2022:1- 17. [209] C. Spearman, The proof and measurement of association between two things. (1961). [210] Yuan B, Guss GM, Wilson AC, Hau- Riege S, DePond PJ, McMains S, Matthews MJ, Giera B. Machine- learning- based monitoring of laser powder bed fusion. Advanced Materials Technologies 2018;3(2):1800136. [211] Chowdhury S, Anand S. Artificial neural network based geometric compensation for thermal deformation in additive manufacturing processes. In: International Manufacturing Science and Engineering Conference, Vol. 49910. American Society of Mechanical Engineers; 2016. V003T08A006. [212] T.Q.D. Pham, T.V. Hoang, Q.T. Pham, T.P. Huynh, V.X. Tran, S. Fetni, L. Duchene, H.S. Tran, A.M. Habraken, Data- driven prediction of temperature evolution in metallic additive manufacturing process (2021). [213] S. Fetni, Q.D.T. Pham, V.X. Tran, L. Duchene, H.S. Tran, A.M. Habraken, Thermal field prediction in ded manufacturing process using artificial neural network (2021). [214] Roy M, Wodo O. Data- driven modeling of thermal history in additive manufacturing. Addit Manuf 2020;32:101017. [215] Kozjek D, Carter III FM, Porter C, Mogonye J- E, Ehmann K, Cao J. Data- driven prediction of next- layer melt pool temperatures in laser powder bed fusion based on co- axial high- resolution planck thermometry measurements. Journal of Manufacturing Processes 2022;79:81- 90. [216] Ren Y, Wang Q, Michaeleris PP. A physics- informed two- level machine- learning model for predicting melt- pool size in laser powder bed fusion. J. Dyn. Syst. Meas. Contr. 2021;143(12). [217] Ren Y, Wang Q. Gaussian- process based model for optimal control of melt- pool geometry in laser powder bed fusion. J Intell Manuf 2021:1- 18. [218] Zhu Q, Liu Z, Yan J. Machine learning for metal additive manufacturing: Predicting temperature and melt pool fluid dynamics using physics- informed neural networks. Comput. Mech. 2021;67(2):619- 35. [219] Yan J, Yan W, Lin S, Wagner G.",
    "summary": "References - Part 24/34",
    "size": 1981
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-109",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " A fully coupled finite element formulation for liquid- solid- gas thermo- fluid flow with melting and solidification. Comput. Methods Appl. Mech. Eng. 2018;336:444- 70. [220] Yan W, Lin S, Kafka OL, Lian Y, Yu C, Liu Z, Yan J, Wolff S, Wu H, Ndip- Agbor E, et al. Data- driven multi- scale multi- physics models to derive process- structure- property relationships for additive manufacturing. Comput. Mech. 2018;61(5):521- 41. [221] Ren K, Chew Y, Zhang Y, Fuh J, Bi G. Thermal field prediction for laser scanning paths in laser aided additive manufacturing by physics- based machine learning. Comput. Methods Appl. Mech. Eng. 2020;362:112734. [222] Mahmoudi M, Ezzat AA, Elwany A. Layer- wise anomaly detection in laser powder- bed fusion metal additive manufacturing. J. Manuf. Sci. Eng. 2019;141(3). [223] Seifi SH, Tian W, Doude H, Tschopp MA, Bajn L. Layer- wise modeling and anomaly detection for laser- based additive manufacturing. J. Manuf. Sci. Eng. 2019;141(8):081013. [224] Gaja H, Liou F. Defect classification of laser metal deposition using logistic regression and artificial neural networks for pattern recognition. The International Journal of Advanced Manufacturing Technology 2018;94(1):315- 26. [225] Shevchik SA, Kenel C, Leinenbach C, Wasmer K. Acoustic emission for in situ quality monitoring in additive manufacturing using spectral convolutional neural networks. Addit Manuf 2018;21:598- 604. [226] J. Bruna, W. Zaremba, A. Szlam, Y. LeCur. Spectral networks and locally connected networks on graphs, arXiv preprint arXiv:1312.6203 (2013). [227] Ye DS, Fuh Y, Zhang Y, Hong G, Zhu KP. Defect recognition in selective laser melting with acoustic signals by svm based on feature reduction. In: IOP Conference Series: Materials Science and Engineering, Vol. 436, IOP Publishing; 2018. p. 012020. [228] Gobert C, Reutzel EW, Petrich J, Nassar AR, Phoha S.",
    "summary": "References - Part 25/34",
    "size": 1877
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-110",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Application of supervised machine learning for defect detection during metallic powder bed fusion additive manufacturing using high resolution imaging. Addit Manuf 2018;21:517- 28. [229] Smoqi Z, Gaikwad A, Bevans B, Kobir MH, Craig J, Abul- Haj A, Peralta A, Rao P. Monitoring and prediction of porosity in laser powder bed fusion using physics- informed meltpool signatures and machine learning. J. Mater. Process. Technol. 2022;304:117559. [230] Yuan J, Liu H, Liu W, Wang F, Peng S. A method for melt pool state monitoring in laser- based direct energy deposition based on densenet. Measurement 2022; 195:11146. [231] Yang Z, Lu Y, Yeung H, Krishnamurty S. Investigation of deep learning for real- time melt pool classification in additive manufacturing. 2019 IEEE 15th international conference on automation science and engineering (CASE). IEEE; 2019. p. 640- 7. [232] Khan MF, Alam A, Siddiqui MA, Alam MS, Rafat Y, Salik N, Al- Saidan I. Real- time defect detection in 3d printing using machine learning. Materials Today: Proceedings 2021;42:521- 8. [233] Valizaden M, Wolff SJ. Convolutional neural network applications in additive manufacturing: A review, Advances in Industrial and Manufacturing Engineering 2022:100072. [234] Imani F, Gaikwad A, Montazeri M, Rao P, Yang H, Reutzel E. Process mapping and in- process monitoring of porosity in laser powder bed fusion using layerwise optical imaging. J. Manuf. Sci. Eng. 2018;140(10). [235] Kwon O, Kim HG, Ham MJ, Kim W, Kim J- H, Cho J- H, Kim N, Kim K. A deep neural network for classification of melt- pool images in metal additive manufacturing. J Intell Manuf 2020;31(2):975- 86. [236] Hertlein N, Deshpande S, Venugopal V, Kumar M, Anand S. Prediction of selective laser melting part quality using hybrid bayesian network. Addit Manuf 2020; 32:101089. [237] Liu R, Liu S, Zhang X. A physics- informed machine learning model for porosity analysis in laser powder bed fusion additive manufacturing.",
    "summary": "References - Part 26/34",
    "size": 1964
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-111",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " The International Journal of Advanced Manufacturing Technology 2021;113(7):1943- 58. [238] DebRoy T, Wei H, Zuback J, Mukherjee T, Elmer J, Milewski J, Beese AM, Wilson- Heid Ad, De A, Zhang W. Additive manufacturing of metallic components- process, structure and properties. Prog. Mater Sci. 2018;92:112- 224. [239] Wei H, Mukherjee T, Zhang W, Zuback J, Knapp G, De A, DebRoy T. Mechanistic models for additive manufacturing of metallic components. Prog. Mater Sci. 2021;116:100703. [240] Du Y, Mukherjee T, DebRoy T. Physics- informed machine learning and mechanistic modeling of additive manufacturing to reduce defects. Applied Materials Today 2021;24:101123.",
    "summary": "References - Part 27/34",
    "size": 665
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-112",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "manufting. J. Mater. Process. Technol. 2022;302:117472. 101877. 23 digital twins of metal additive manufacturing. Addit Manuf 2021;46:102089. 24) Mani M, Lane BM, Donmez MA, Feng SC, Moylan SP. A review on measurement science needs for real- time control of additive manufacturing metal powder bed fusion processes. Int. J. Prod. Res. 2017;55(5):1400- 18. 245) Yavari R, Riensche A, Tekerek E, Jacquemerton L, Halliday H, Vandever M, Tenequer A, Perumal V, Kontos A, Smoqi Z, et al. Digitally twinned additive 110167. 246) Chen L, Yao X, Xu P, Moon SK, Bi G. Rapid surface defect identification for additive manufacturing with in- situ pulim cloud processing and machine learning. Virtual and Physical Prototyping 2021;16(1):50- 67. 247) Ren W, Wen G, Zhang Z, Mazumder J. Quality monitoring in additive manufacturing using emission spectroscopy and unsupervised deep learning. Mater. Manuf. Processes 2021:1- 8. 248) Ye D, Hong GS, Zhang Y, Zhu K, Fuh JYH. Defect detection in selective laser melting technology by acoustic signals with deep belief networks. The International Journal of Advanced Manufacturing Technology 2018;96(5):3791- 901. 249) Ye D, Fuh JYH, Zhang Y, Hong GS, Zhu K. In situ monitoring of selective laser melting using plume and spatter signatures by deep belief networks. ISA transactions 2018;81:96- 104. 250) Okaro IA, Jayasinghe S, Sutcliffe C, Black K, Paoletti P, Green PL. Automatic fault detection for laser powder- bed fusion using semi- supervised machine learning. Addit Manuf 2019;27:42- 53. 251) Yuan B, Giera B, Guss G, Matthews I, McManus S. Semi- supervised convolutional neural networks for in- situ video monitoring of selective laser melting. 2019 IEEE winter conference on applications of computer vision (WACV). IEEE; 2019. p. 744- 53. 252) Tran HC, Lo YL. Systematic approach for determining optimal processing parameters to produce parts with high density in selective laser melting process. Int. J. Adv. Manuf. Technol. 2019;105:4443- 60. https://doi.",
    "summary": "References - Part 28/34",
    "size": 1998
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-113",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "org/10.1007/s00170- 019- 04517- 0. 253) Schmid S, Krabusch J, Schromm T, Jiejing S, Ziegelmeier S, Grosse CU, Schleifenbaum JH. A new approach for automated measuring of the melt pool geometry in laser- powder bed fusion. Prog. Addit Manuf 2021;6:269- 79. https://doi.org/10.1007/s40964- 021- 00173- 7. 254) Chen Y, Wang H, Wu Y, Wang H. Predicting the print fuidity in selective laser melting with a supervised- based machine learning method. Materials 2020;13(22):5063. 255) Men L, Wang J, Process design of laser powder bed fision of staelles stel using a gaussian proceses- based machine learning model. JOM 2020;72(1):420- 8. 256) A. Singh, D. Cooper, N. Blundell, G. Gibbons, D. Pratihar, Modelling of direct metal laser sintering of eos- dm20 bronze using neural networks and genetic algorithms, in: Proceedings of the 37th international MATADOR conference, Springer Science & Business Media, 2012, pp. 395- 398. 257) Tapia G, Khairallah S, Matthews M, King WE, Elwany A. Gaussian process- based surrogate modeling framework for process planning in laser powder- bed fusion additive manufacturing of 3161 stainless steel. The International Journal of Advanced Manufacturing Technology 2018;94(9):3591- 603. 258) Caiazzo D, Caggiano A. Laser direct metal deposition of 2024 al alloy: trace geometry prediction via machine learning. Materials 2018;11:444. 259) Lu Z, Li D, Lu B, Zhang A, Zhu G, Pi G. The prediction of the buling precision in the laser enginerey net shing proces using advanced networks. Opt. Lasers Eng. 2010;48(5):519- 25. 260) Jafari- Marandi R, Khanzadeh M, Tian W, Smith B, Bian L. From in- situ monitoring toward high- throughput process control: cost- driven decision- making framework for laser- based additive manufacturing. Journal of Manufacturing Systems 2019;51:29- 41. 261) B. Kappes, S. Moorthy, D. Drake, H. Geerlings, A.",
    "summary": "References - Part 29/34",
    "size": 1859
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-114",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Stebner, Machine learning to optimize additive manufacturing parameters for laser powder bed fusion of inconel 718, in: Proceedings of the 9th international symposium on superalloy 718 & derivatives: Energy, aerospace, and industrial applications. Springer, 2018, pp. 595- 610. 262) Malekipour E, El- Mounayri H. Defects, process parameters and signatures for online monitoring and control in powder- based additive manufacturing. In: Mechanics of Additive and Advanced Manufacturing, Volume 9. Springer; 2018. p. 83- 90. 263) Gaja H, Liou F. Defects monitoring of laser metal deposition using acoustic emission sensor. The International Journal of Advanced Manufacturing Technology 2017;90(1):561- 74. 264) Gutkin R, Green C, Vangrattanachai S, Pirino S, Robinson P, Curtis P. On acoustic emission for failure investigation in cfrp: Pattern recognition and peak frequency analyses. Mechanical systems and signal processing 2011;25(4):1393- 407. 265) Taheri H, Koester LW, Bigelow TA, Faierson EJ, Bond LJ. In situ additive manufacturing process monitoring with an acoustic technique: clustering performance evaluation using k- means algorithm. J. Manuf. Sci. Eng. 2019;141(4). 266) Tapia G, Elwany A. A review on process monitoring and control in metal- based additive manufacturing. J. Manuf. Sci. Eng. 2014;136(6). 267) Zhang Y, Fuh JY, Ye D, Hong GS. In- situ monitoring of laser- based pbf via off- axis vision and image processing approaches. Addit Manuf 2019;25:263- 74. 268) Guo X, Liu X, Zhu E, Yin J. Deep clustering with convolutional autoencoders. In: International conference on neural information processing. Springer; 2017. p. 373- 82. 269) Hinton GE, Salakhutdinov RR. Reducing the dimensionality of data with neural networks, science 2006;313(5786):504- 7. 270) Silbernagel C, Aremu A, Ashcroft I. Using machine learning to aid in the parameter optimisation process for metal- based additive manufacturing. Rapid Prototyping Journal 2020. 271) Tibshirani R, Walther G, Hastie T.",
    "summary": "References - Part 30/34",
    "size": 1996
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-115",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Estimating the number of clusters in a data set via the gap statistic. Journal of the Royal Statistical Society: Series B (Statistical Methodology) 2001;63(2):411- 23. 272) Snell R, Taminas- Williams S, Chechik L, Lyle A, Hernandez- Nava E, Boig C, Panoutsos G, Todd I. Methods for rapid pore classification in metal additive manufacturing. Jom 2020;72(1):101- 9. 273) Grasso M, Laguzza V, Semeraro Q, Colosimo BM. In- process monitoring of selective laser melting: spatial detection of defects via image data analysis. J. Manuf. Sci. Eng. 2017;139(5). 274) Garcia- Moreno A- I. Automatic quantification of porosity using an intelligent classfier. The International Journal of Advanced Manufacturing Technology 2019;105(5):1883- 99. 275) Khanzadeh M, Chowdhury S, Bian L, Tschopp MA. A methodology for predicting porosity from thermal imaging of melt pools in additive manufacturing thin wall sections. In: International Manufacturing Science and Engineering Conference, Vol. 50732. American Society of Mechanical Engineers; 2017. V002T01A044. 276) Khanzadeh M, Bian L, Shamsaei N, Thompson SM. Porosity detection of laser based additive manufacturing using melt pool morphology clustering. In: in: 2016 International Solid Freeform Fabrication Symposium. University of Texas at Austin; 2016. 277) Beuth J, Fox J, Gockel J, Montgomery C, Yang R, Qiao H, Soylemez E, Reesewatt P, Anvari A, Narra S, et al. Process mapping for qualification across multiple direct metal additive manufacturing processes. In: in: 2013 International Solid Freeform Fabrication Symposium. University of Texas at Austin; 2013. 278) DeCost BL, Jain H, Rollett AD, Holm EA. Computer vision and machine learning for autonomous characterization of am powder feedstocks. Jom 2017;69(3): 456- 65. 279) Scime L, Beuth J. Anomaly detection and classification in a laser powder bed additive manufacturing process using a trained computer vision algorithm. Addit Manuf 2018;19:114- 26. 280) DeCost BL, Holm EA.",
    "summary": "References - Part 31/34",
    "size": 1978
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-116",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Characterizing powder materials using keypoint- based computer vision methods. Comput. Mater. Sci. 2017;126:438- 45. 281) D.G. Lowe, Object recognition from local scale- invariant features, in: Proceedings of the seventh IEEE international conference on computer vision, Vol. 2, Ieee, 1999, pp. 1150- 1157.",
    "summary": "References - Part 32/34",
    "size": 307
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-117",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": "[282] Bisht M, Ray N, Verbist F, Coeck S. Correlation of selective laser melting- melt pool events with the tensile properties of ti- 6al- 4v eli processed by laser powder bed fusion. Addit Manuf 2018;22:302- 6. [283] Coeck S, Bisht M, Plas J, Verbist F. Prediction of lack of fusion porosity in selective laser melting based on melt pool monitoring data. Addit Manuf 2019;25: 347- 56. [284] J. Voigt, T. Bock, U. Hilpert, R. Hellmann, M. Moeckel, Increased relative density and characteristic melt pool. signals at the edge in pbf- lb/m, Additive Manufacturing (2022) 102798. [285] Donegan SP, Schwalbach EJ, Groeber MA. Zoning additive manufacturing process histories using unsupervised machine learning. Mater. Charact. 2020;161. https://doi.org/10.1016/j.matchar.2020.11.0123. [286] Y. Tan, B. Jin, A. Nettekoven, Y. Chen, Y. Yue, U. Topcu, A. Sangiovanni- Vincentelli, An encoder- decoder based approach for anomaly detection with application in additive manufacturing, Proceedings - 18th IEEE International Conference on Machine Learning and Applications, ICMLA 2019 (2019) 1008- 1015. doi:10.1109/ICMLA.2019.00171. [287] Pagan DC, Phan TQ, Weaver JS, Benson AR, Rondoin AJ. Unsupervised learning of dislocation motion. Acta Mater. 2019;181:510- 8. [288] Singh A, Nowak R, Zhu J. Unlabeled data: Now it helps, now it doesn't. Adv Neural Inform Process Syst 2008;21. [289] Yadav P, Singh VK, Joffre T, Rigo O, Arvidu C, Le Guen E, Lacoste E. Inline drift detection using monitoring systems and machine learning in selective laser melting. Adv. Eng. Mater. 2020;22(12):2000660. [290] Larsen S, Hooper PA. Deep semi- supervised learning of dynamics for anomaly detection in laser powder bed fusion. J Intell Manuf 2022;33(2):457- 71. [291] Li X, Jia X, Yang Q, Lee J. Quality- analysis in metal additive manufacturing with deep learning. J Intell Manuf 2020;31(8):2993- 17. [292] Mozaffar M, Ebrahimi A, Cao J.",
    "summary": "References - Part 33/34",
    "size": 1913
  },
  {
    "name": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103-part-118",
    "projectId": "-lunvKwP7UTb",
    "fileName": "2023 - Progress in Materials Science - Parsazadeh, Sharma, Dahotre - Towards the next generation of machine learning models in additive.pdf-2f2e54b7-f56a-4971-a084-b5efd419d103.md",
    "content": " Toolpath design for additive manufacturing using deep reinforcement learning, arXiv preprint arXiv:2009.14365; 2020. [293] Wasmer K, Le- Quang T, Meylan B, Shevchik SA. In situ quality monitoring in am using acoustic emission: A reinforcement learning approach. J. Mater. Eng. Perform. 2019;28(2):666- 72. [294] Weiss K, Khoshgoftaar TM, Wang D. A survey of transfer learning. J Big data 2016;3(1):1- 40. [295] Teng C, Gong H, Szabo A, Dilip J, Ashby K, Zhang S, Patil N, Pal D, Stucker B. Simulating melt pool shape and lack of fusion porosity for selective laser melting of cobalt chromium components. J Manuf Sci Eng 2017;139(1). [296] Karniadakis GE, Kevrekidis IG, Lu L, Perdikaris P, Wang S, Yang L. Physics- informed machine learning. Nat Rev Phys 2021;3(6):422- 40.",
    "summary": "References - Part 34/34",
    "size": 774
  }
]